<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  </Function>
  <Function id="_1778" name="fabsl" returns="_1807" throw="" context="_1" location="f2:181" file="f2" line="181" extern="1" attributes="nothrow const">
    <Argument name="__x" type="_1807" location="f2:181" file="f2" line="181"/>
  </Function>
  <Function id="_1779" name="_IO_ftrylockfile" returns="_167" throw="" context="_1" location="f45:447" file="f45" line="447" extern="1">
    <Argument type="_2045" location="f45:447" file="f45" line="447"/>
  </Function>
  <Variable id="_1780" name="_ZTI18btConstraintSolver" type="_2012c" context="_1" location="f126:32" file="f126" line="32" extern="1" artificial="1"/>
  <Typedef id="_1781" name="__int32_t" type="_167" context="_1" location="f20:40" file="f20" line="40"/>
  <Function id="_1782" name="abs" returns="_167" throw="" context="_1" location="f13:775" file="f13" line="775" extern="1" attributes="nothrow const __warn_unused_result__">
    <Argument name="__x" type="_167" location="f13:775" file="f13" line="775"/>
  </Function>
  <Typedef id="_1783" name="__io_write_fn" type="_394" context="_1" location="f45:347" file="f45" line="347"/>
  <Struct id="_1784" name="btOverlapFilterCallback" context="_1" abstract="1" mangled="23btOverlapFilterCallback" demangled="btOverlapFilterCallback" location="f14:39" file="f14" line="39" artificial="1" size="64" align="64" members="_8648 _8649 _8650 _8651 _8652 " bases=""/>
  <Variable id="_1785" name="_ZTI12btSerializer" type="_2012c" context="_1" location="f30:70" file="f30" line="70" extern="1" artificial="1"/>
  <Class id="_1786" name="btBU_Simplex1to4" context="_1" mangled="16btBU_Simplex1to4" demangled="btBU_Simplex1to4" location="f118:26" file="f118" line="26" artificial="1" size="1408" align="64" members="_8653 _8654 _8655 _8656 _8657 _8658 _8659 _8660 _8661 _8662 _8663 _8664 _8665 _8666 _8667 _8668 _8669 _8670 _8671 _8672 _8673 _8674 _8675 _8676 _8677 _8678 _8679 _8680 _8681 _8682 " bases="_1018 ">
    <Base type="_1018" access="public" virtual="0" offset="0"/>
  </Class>
  <Typedef id="_1787" name="__caddr_t" type="_1062" context="_1" location="f20:183" file="f20" line="183"/>
  <Class id="_1788" name="bad_exception" context="_2" mangled="St13bad_exception" demangled="std::bad_exception" location="f57:74" file="f57" line="74" artificial="1" size="64" align="64" members="_8683 _8684 _8685 _8686 _8687 " bases="_1801 ">
    <Base type="_1801" access="public" virtual="0" offset="0"/>
  </Class>
  <Function id="_1789" name="set_unexpected" returns="_1792" throw="" context="_2" mangled="_ZSt14set_unexpectedPFvvE" demangled="std::set_unexpected(void (*)())" location="f57:100" file="f57" line="100" extern="1">
    <Argument type="_1792" location="f57:100" file="f57" line="100"/>
  </Function>
  <Function id="_1790" name="terminate" returns="_631" throw="" context="_2" mangled="_ZSt9terminatev" demangled="std::terminate()" location="f57:97" file="f57" line="97" extern="1" attributes="__noreturn__"/>
  <PointerType id="_1791" type="_8688" size="64" align="64"/>
  <Typedef id="_1792" name="unexpected_handler" type="_1791" context="_2" location="f57:90" file="f57" line="90"/>
  <Variable id="_1793" name="nothrow" type="_1797c" context="_2" mangled="_ZSt7nothrow" demangled="std::nothrow" location="f42:69" file="f42" line="69" extern="1"/>
  <Typedef id="_1794" name="new_handler" type="_1791" context="_2" location="f42:73" file="f42" line="73"/>
  <Function id="_1795" name="unexpected" returns="_631" context="_2" mangled="_ZSt10unexpectedv" demangled="std::unexpected()" location="f57:104" file="f57" line="104" extern="1" attributes="__noreturn__"/>
  <Typedef id="_1796" name="ptrdiff_t" type="_22" context="_2" location="f130:1858" file="f130" line="1858"/>
  <Struct id="_1797" name="nothrow_t" context="_2" mangled="St9nothrow_t" demangled="std::nothrow_t" location="f42:67" file="f42" line="67" artificial="1" size="8" align="8" members="_8690 _8691 _8692 _8693 " bases=""/>
  <Function id="_1798" name="set_new_handler" returns="_1794" throw="" context="_2" mangled="_ZSt15set_new_handlerPFvvE" demangled="std::set_new_handler(void (*)())" location="f42:77" file="f42" line="77" extern="1">
    <Argument type="_1794" location="f42:77" file="f42" line="77"/>
  </Function>
  <Typedef id="_1799" name="size_t" type="_152" context="_2" location="f130:1857" file="f130" line="1857"/>
  <Class id="_1800" name="bad_alloc" context="_2" mangled="St9bad_alloc" demangled="std::bad_alloc" location="f42:55" file="f42" line="55" artificial="1" size="64" align="64" members="_8694 _8695 _8696 _8697 _8698 " bases="_1801 ">
    <Base type="_1801" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1801" name="exception" context="_2" mangled="St9exception" demangled="std::exception" location="f57:61" file="f57" line="61" artificial="1" size="64" align="64" members="_8699 _8700 _8701 _8702 _8703 " bases=""/>
  <Function id="_1802" name="uncaught_exception" returns="_1816" throw="" context="_2" mangled="_ZSt18uncaught_exceptionv" demangled="std::uncaught_exception()" location="f57:117" file="f57" line="117" extern="1" attributes="__pure__"/>
  <Function id="_1803" name="set_terminate" returns="_1804" throw="" context="_2" mangled="_ZSt13set_terminatePFvvE" demangled="std::set_terminate(void (*)())" location="f57:93" file="f57" line="93" extern="1">
    <Argument type="_1804" location="f57:93" file="f57" line="93"/>
  </Function>
  <Typedef id="_1804" name="terminate_handler" type="_1791" context="_2" location="f57:87" file="f57" line="87"/>
  <PointerType id="_1805" type="_5949c" size="64" align="64"/>
  <ReferenceType id="_1806" type="_192c" size="64" align="64"/>
  <FundamentalType id="_1807" name="long double" size="128" align="128"/>
  <Struct id="_1808" name="__si_class_type_info_pseudo" context="_1" mangled="27__si_class_type_info_pseudo" demangled="__si_class_type_info_pseudo" location="f131:0" file="f131" line="0" size="192" align="64" members=""/>
  <CvQualifiedType id="_1808c" type="_1808" const="1"/>
  <Field id="_1810" name="tv_sec" type="_1015" offset="0" context="_14" access="public" location="f5:32" file="f5" line="32"/>
  <Field id="_1811" name="tv_usec" type="_199" offset="64" context="_14" access="public" location="f5:33" file="f5" line="33"/>
  <Destructor id="_1812" name="timeval" artificial="1" throw="" context="_14" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f5:31" file="f5" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1813" name="=" returns="_8706" artificial="1" throw="" context="_14" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f5:31" file="f5" line="31" endline="31" inline="1">
    <Argument type="_8707" location="f5:31" file="f5" line="31"/>
  </OperatorMethod>
  <Constructor id="_1814" name="timeval" artificial="1" throw="" context="_14" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f5:31" file="f5" line="31" endline="31" inline="1">
    <Argument type="_8707" location="f5:31" file="f5" line="31"/>
  </Constructor>
  <Constructor id="_1815" name="timeval" artificial="1" throw="" context="_14" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f5:31" file="f5" line="31" inline="1"/>
  <FundamentalType id="_1816" name="bool" size="8" align="8"/>
  <Field id="_1817" name="m_convexInternalShapeData" type="_1333" offset="0" context="_16" access="public" location="f7:160" file="f7" line="160"/>
  <Field id="_1818" name="m_upAxis" type="_167" offset="448" context="_16" access="public" location="f7:162" file="f7" line="162"/>
  <Field id="_1819" name="m_padding" type="_8708" offset="480" context="_16" access="public" location="f7:164" file="f7" line="164"/>
  <Destructor id="_1820" name="btCapsuleShapeData" artificial="1" throw="" context="_16" access="public" mangled="_ZN18btCapsuleShapeDataD1Ev *INTERNAL* " demangled="btCapsuleShapeData::~btCapsuleShapeData()" location="f7:159" file="f7" line="159" endline="159" inline="1">
  </Destructor>
  <OperatorMethod id="_1821" name="=" returns="_8709" artificial="1" throw="" context="_16" access="public" mangled="_ZN18btCapsuleShapeDataaSERKS_" demangled="btCapsuleShapeData::operator=(btCapsuleShapeData const&amp;)" location="f7:159" file="f7" line="159" endline="159" inline="1">
    <Argument type="_8710" location="f7:159" file="f7" line="159"/>
  </OperatorMethod>
  <Constructor id="_1822" name="btCapsuleShapeData" artificial="1" throw="" context="_16" access="public" mangled="_ZN18btCapsuleShapeDataC1ERKS_ *INTERNAL* " demangled="btCapsuleShapeData::btCapsuleShapeData(btCapsuleShapeData const&amp;)" location="f7:159" file="f7" line="159" endline="159" inline="1">
    <Argument type="_8710" location="f7:159" file="f7" line="159"/>
  </Constructor>
  <Constructor id="_1823" name="btCapsuleShapeData" artificial="1" throw="" context="_16" access="public" mangled="_ZN18btCapsuleShapeDataC1Ev *INTERNAL* " demangled="btCapsuleShapeData::btCapsuleShapeData()" location="f7:159" file="f7" line="159" inline="1"/>
  <Field id="_1824" name="m_convexEpsilon" type="_360" offset="1088" context="_17" access="public" location="f8:60" file="f8" line="60"/>
  <Field id="_1825" name="m_planarEpsilon" type="_360" offset="1120" context="_17" access="public" location="f8:61" file="f8" line="61"/>
  <Field id="_1826" name="m_equalVertexThreshold" type="_360" offset="1152" context="_17" access="public" location="f8:62" file="f8" line="62"/>
  <Field id="_1827" name="m_edgeDistanceThreshold" type="_360" offset="1184" context="_17" access="public" location="f8:63" file="f8" line="63"/>
  <Field id="_1828" name="m_maxEdgeAngleThreshold" type="_360" offset="1216" context="_17" access="public" location="f8:64" file="f8" line="64"/>
  <Field id="_1829" name="m_zeroAreaThreshold" type="_360" offset="1248" context="_17" access="public" location="f8:65" file="f8" line="65"/>
  <OperatorMethod id="_1830" name="=" returns="_8711" artificial="1" context="_17" access="public" mangled="_ZN17btTriangleInfoMapaSERKS_" demangled="btTriangleInfoMap::operator=(btTriangleInfoMap const&amp;)" location="f8:59" file="f8" line="59" endline="59" inline="1">
    <Argument type="_8712" location="f8:59" file="f8" line="59"/>
  </OperatorMethod>
  <Constructor id="_1831" name="btTriangleInfoMap" artificial="1" context="_17" access="public" mangled="_ZN17btTriangleInfoMapC1ERKS_ *INTERNAL* " demangled="btTriangleInfoMap::btTriangleInfoMap(btTriangleInfoMap const&amp;)" location="f8:59" file="f8" line="59" endline="59" inline="1">
    <Argument type="_8712" location="f8:59" file="f8" line="59"/>
  </Constructor>
  <Constructor id="_1832" name="btTriangleInfoMap" explicit="1" context="_17" access="public" mangled="_ZN17btTriangleInfoMapC1Ev *INTERNAL* " demangled="btTriangleInfoMap::btTriangleInfoMap()" location="f8:68" file="f8" line="68" endline="76" inline="1"/>
  <Destructor id="_1833" name="btTriangleInfoMap" virtual="1" overrides="" context="_17" access="public" mangled="_ZN17btTriangleInfoMapD1Ev *INTERNAL* " demangled="btTriangleInfoMap::~btTriangleInfoMap()" location="f8:77" file="f8" line="77" endline="77" inline="1">
  </Destructor>
  <Method id="_1834" name="calculateSerializeBufferSize" returns="_167" const="1" virtual="1" overrides="" context="_17" access="public" mangled="_ZNK17btTriangleInfoMap28calculateSerializeBufferSizeEv" demangled="btTriangleInfoMap::calculateSerializeBufferSize() const" location="f8:117" file="f8" line="117" endline="119" inline="1"/>
  <Method id="_1835" name="serialize" returns="_1805" const="1" virtual="1" overrides="" context="_17" access="public" mangled="_ZNK17btTriangleInfoMap9serializeEPvP12btSerializer" demangled="btTriangleInfoMap::serialize(void*, btSerializer*) const" location="f8:123" file="f8" line="123" endline="198" inline="1">
    <Argument name="dataBuffer" type="_1068" location="f8:123" file="f8" line="123"/>
    <Argument name="serializer" type="_8713" location="f8:123" file="f8" line="123"/>
  </Method>
  <Method id="_1836" name="deSerialize" returns="_631" context="_17" access="public" mangled="_ZN17btTriangleInfoMap11deSerializeER21btTriangleInfoMapData" demangled="btTriangleInfoMap::deSerialize(btTriangleInfoMapData&amp;)" location="f8:204" file="f8" line="204" inline="1">
    <Argument name="tmapData" type="_8714" location="f8:204" file="f8" line="204"/>
  </Method>
  <Field id="_1837" name="m_el" type="_8715" offset="0" context="_18" access="public" location="f9:1324" file="f9" line="1324"/>
  <Destructor id="_1838" name="btMatrix3x3DoubleData" artificial="1" throw="" context="_18" access="public" mangled="_ZN21btMatrix3x3DoubleDataD1Ev *INTERNAL* " demangled="btMatrix3x3DoubleData::~btMatrix3x3DoubleData()" location="f9:1323" file="f9" line="1323" endline="1323" inline="1">
  </Destructor>
  <OperatorMethod id="_1839" name="=" returns="_8716" artificial="1" throw="" context="_18" access="public" mangled="_ZN21btMatrix3x3DoubleDataaSERKS_" demangled="btMatrix3x3DoubleData::operator=(btMatrix3x3DoubleData const&amp;)" location="f9:1323" file="f9" line="1323" endline="1323" inline="1">
    <Argument type="_8717" location="f9:1323" file="f9" line="1323"/>
  </OperatorMethod>
  <Constructor id="_1840" name="btMatrix3x3DoubleData" artificial="1" throw="" context="_18" access="public" mangled="_ZN21btMatrix3x3DoubleDataC1ERKS_ *INTERNAL* " demangled="btMatrix3x3DoubleData::btMatrix3x3DoubleData(btMatrix3x3DoubleData const&amp;)" location="f9:1323" file="f9" line="1323" endline="1323" inline="1">
    <Argument type="_8717" location="f9:1323" file="f9" line="1323"/>
  </Constructor>
  <Constructor id="_1841" name="btMatrix3x3DoubleData" artificial="1" throw="" context="_18" access="public" mangled="_ZN21btMatrix3x3DoubleDataC1Ev *INTERNAL* " demangled="btMatrix3x3DoubleData::btMatrix3x3DoubleData()" location="f9:1323" file="f9" line="1323" inline="1"/>
  <Field id="_1842" name="m_userConstraintType" type="_167" offset="96" context="_19" access="private" location="f10:68" file="f10" line="68"/>
  <Field id="_1843" name="" type="_1853" offset="128" context="_19" access="private" location="f10:74" file="f10" line="74"/>
  <Field id="_1844" name="m_breakingImpulseThreshold" type="_360" offset="192" context="_19" access="private" location="f10:76" file="f10" line="76"/>
  <Field id="_1845" name="m_isEnabled" type="_1816" offset="224" context="_19" access="private" location="f10:77" file="f10" line="77"/>
  <Field id="_1846" name="m_needsFeedback" type="_1816" offset="232" context="_19" access="private" location="f10:78" file="f10" line="78"/>
  <Field id="_1847" name="m_overrideNumSolverIterations" type="_167" offset="256" context="_19" access="private" location="f10:79" file="f10" line="79"/>
  <Field id="_1848" name="m_rbA" type="_8718" offset="320" context="_19" access="protected" location="f10:90" file="f10" line="90"/>
  <Field id="_1849" name="m_rbB" type="_8718" offset="384" context="_19" access="protected" location="f10:91" file="f10" line="91"/>
  <Field id="_1850" name="m_appliedImpulse" type="_360" offset="448" context="_19" access="protected" location="f10:92" file="f10" line="92"/>
  <Field id="_1851" name="m_dbgDrawSize" type="_360" offset="480" context="_19" access="protected" location="f10:93" file="f10" line="93"/>
  <Field id="_1852" name="m_jointFeedback" type="_8719" offset="512" context="_19" access="protected" location="f10:94" file="f10" line="94"/>
  <Union id="_1853" context="_19" access="private" mangled="N17btTypedConstraint4._34E" demangled="btTypedConstraint::._34" location="f10:71" file="f10" line="71" artificial="1" size="64" align="64" members="_8720 _8721 " bases=""/>
  <Struct id="_1854" name="btConstraintInfo1" context="_19" access="public" mangled="N17btTypedConstraint17btConstraintInfo1E" demangled="btTypedConstraint::btConstraintInfo1" location="f10:108" file="f10" line="108" artificial="1" size="64" align="32" members="_8722 _8723 _8724 _8725 _8726 _8727 " bases=""/>
  <Struct id="_1855" name="btConstraintInfo2" context="_19" access="public" mangled="N17btTypedConstraint17btConstraintInfo2E" demangled="btTypedConstraint::btConstraintInfo2" location="f10:114" file="f10" line="114" artificial="1" size="768" align="64" members="_8728 _8729 _8730 _8731 _8732 _8733 _8734 _8735 _8736 _8737 _8738 _8739 _8740 _8741 _8742 _8743 _8744 _8745 " bases=""/>
  <Constructor id="_1856" name="btTypedConstraint" artificial="1" throw="" context="_19" access="public" mangled="_ZN17btTypedConstraintC1ERKS_ *INTERNAL* " demangled="btTypedConstraint::btTypedConstraint(btTypedConstraint const&amp;)" location="f10:67" file="f10" line="67" endline="67" inline="1">
    <Argument type="_8746" location="f10:67" file="f10" line="67"/>
  </Constructor>
  <OperatorMethod id="_1857" name="=" returns="_8747" context="_19" access="private" mangled="_ZN17btTypedConstraintaSERS_" demangled="btTypedConstraint::operator=(btTypedConstraint&amp;)" location="f10:82" file="f10" line="82" endline="86" inline="1">
    <Argument name="other" type="_8747" location="f10:82" file="f10" line="82"/>
  </OperatorMethod>
  <Method id="_1858" name="getMotorFactor" returns="_360" context="_19" access="protected" mangled="_ZN17btTypedConstraint14getMotorFactorEfffff" demangled="btTypedConstraint::getMotorFactor(float, float, float, float, float)" location="f10:97" file="f10" line="97" extern="1">
    <Argument name="pos" type="_360" location="f10:97" file="f10" line="97"/>
    <Argument name="lowLim" type="_360" location="f10:97" file="f10" line="97"/>
    <Argument name="uppLim" type="_360" location="f10:97" file="f10" line="97"/>
    <Argument name="vel" type="_360" location="f10:97" file="f10" line="97"/>
    <Argument name="timeFact" type="_360" location="f10:97" file="f10" line="97"/>
  </Method>
  <OperatorMethod id="_1859" name="new" returns="_1068" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintnwEm" demangled="btTypedConstraint::operator new(unsigned long)" location="f10:102" file="f10" line="102" endline="102" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f10:102" file="f10" line="102"/>
  </OperatorMethod>
  <OperatorMethod id="_1860" name="delete" returns="_631" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintdlEPv" demangled="btTypedConstraint::operator delete(void*)" location="f10:102" file="f10" line="102" endline="102" inline="1">
    <Argument name="ptr" type="_1068" location="f10:102" file="f10" line="102"/>
  </OperatorMethod>
  <OperatorMethod id="_1861" name="new" returns="_1068" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintnwEmPv" demangled="btTypedConstraint::operator new(unsigned long, void*)" location="f10:102" file="f10" line="102" endline="102" inline="1">
    <Argument type="_1155" location="f10:102" file="f10" line="102"/>
    <Argument name="ptr" type="_1068" location="f10:102" file="f10" line="102"/>
  </OperatorMethod>
  <OperatorMethod id="_1862" name="delete" returns="_631" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintdlEPvS0_" demangled="btTypedConstraint::operator delete(void*, void*)" location="f10:102" file="f10" line="102" inline="1">
    <Argument type="_1068" location="f10:102" file="f10" line="102"/>
    <Argument type="_1068" location="f10:102" file="f10" line="102"/>
  </OperatorMethod>
  <OperatorMethod id="_1863" name="new []" returns="_1068" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintnaEm" demangled="btTypedConstraint::operator new[](unsigned long)" location="f10:102" file="f10" line="102" endline="102" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f10:102" file="f10" line="102"/>
  </OperatorMethod>
  <OperatorMethod id="_1864" name="delete []" returns="_631" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintdaEPv" demangled="btTypedConstraint::operator delete[](void*)" location="f10:102" file="f10" line="102" endline="102" inline="1">
    <Argument name="ptr" type="_1068" location="f10:102" file="f10" line="102"/>
  </OperatorMethod>
  <OperatorMethod id="_1865" name="new []" returns="_1068" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintnaEmPv" demangled="btTypedConstraint::operator new[](unsigned long, void*)" location="f10:102" file="f10" line="102" endline="102" inline="1">
    <Argument type="_1155" location="f10:102" file="f10" line="102"/>
    <Argument name="ptr" type="_1068" location="f10:102" file="f10" line="102"/>
  </OperatorMethod>
  <OperatorMethod id="_1866" name="delete []" returns="_631" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraintdaEPvS0_" demangled="btTypedConstraint::operator delete[](void*, void*)" location="f10:102" file="f10" line="102" inline="1">
    <Argument type="_1068" location="f10:102" file="f10" line="102"/>
    <Argument type="_1068" location="f10:102" file="f10" line="102"/>
  </OperatorMethod>
  <Destructor id="_1867" name="btTypedConstraint" virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraintD1Ev *INTERNAL* " demangled="btTypedConstraint::~btTypedConstraint()" location="f10:104" file="f10" line="104" endline="104" inline="1">
  </Destructor>
  <Constructor id="_1868" name="btTypedConstraint" explicit="1" context="_19" access="public" mangled="_ZN17btTypedConstraintC1E21btTypedConstraintTypeR11btRigidBody *INTERNAL* " demangled="btTypedConstraint::btTypedConstraint(btTypedConstraintType, btRigidBody&amp;)" location="f10:105" file="f10" line="105" extern="1">
    <Argument name="type" type="_884" location="f10:105" file="f10" line="105"/>
    <Argument name="rbA" type="_8718" location="f10:105" file="f10" line="105"/>
  </Constructor>
  <Constructor id="_1869" name="btTypedConstraint" explicit="1" context="_19" access="public" mangled="_ZN17btTypedConstraintC1E21btTypedConstraintTypeR11btRigidBodyS2_ *INTERNAL* " demangled="btTypedConstraint::btTypedConstraint(btTypedConstraintType, btRigidBody&amp;, btRigidBody&amp;)" location="f10:106" file="f10" line="106" extern="1">
    <Argument name="type" type="_884" location="f10:106" file="f10" line="106"/>
    <Argument name="rbA" type="_8718" location="f10:106" file="f10" line="106"/>
    <Argument name="rbB" type="_8718" location="f10:106" file="f10" line="106"/>
  </Constructor>
  <Method id="_1870" name="getFixedBody" returns="_8718" static="1" context="_19" access="public" mangled="_ZN17btTypedConstraint12getFixedBodyEv" demangled="btTypedConstraint::getFixedBody()" location="f10:112" file="f10" line="112" extern="1"/>
  <Method id="_1871" name="getOverrideNumSolverIterations" returns="_167" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint30getOverrideNumSolverIterationsEv" demangled="btTypedConstraint::getOverrideNumSolverIterations() const" location="f10:148" file="f10" line="148" endline="150" inline="1"/>
  <Method id="_1872" name="setOverrideNumSolverIterations" returns="_631" context="_19" access="public" mangled="_ZN17btTypedConstraint30setOverrideNumSolverIterationsEi" demangled="btTypedConstraint::setOverrideNumSolverIterations(int)" location="f10:155" file="f10" line="155" endline="157" inline="1">
    <Argument name="overideNumIterations" type="_167" location="f10:155" file="f10" line="155"/>
  </Method>
  <Method id="_1873" name="buildJacobian" returns="_631" virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint13buildJacobianEv" demangled="btTypedConstraint::buildJacobian()" location="f10:161" file="f10" line="161" inline="1"/>
  <Method id="_1874" name="setupSolverConstraint" returns="_631" virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint21setupSolverConstraintER20btAlignedObjectArrayI18btSolverConstraintEiif" demangled="btTypedConstraint::setupSolverConstraint(btAlignedObjectArray&lt;btSolverConstraint&gt;&amp;, int, int, float)" location="f10:164" file="f10" line="164" inline="1">
    <Argument name="ca" type="_8748" location="f10:164" file="f10" line="164"/>
    <Argument name="solverBodyA" type="_167" location="f10:164" file="f10" line="164"/>
    <Argument name="solverBodyB" type="_167" location="f10:164" file="f10" line="164"/>
    <Argument name="timeStep" type="_360" location="f10:164" file="f10" line="164"/>
  </Method>
  <Method id="_1875" name="getInfo1" returns="_631" virtual="1" pure_virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint8getInfo1EPNS_17btConstraintInfo1E" demangled="btTypedConstraint::getInfo1(btTypedConstraint::btConstraintInfo1*)" location="f10:173" file="f10" line="173" extern="1">
    <Argument name="info" type="_3623" location="f10:173" file="f10" line="173"/>
  </Method>
  <Method id="_1876" name="getInfo2" returns="_631" virtual="1" pure_virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint8getInfo2EPNS_17btConstraintInfo2E" demangled="btTypedConstraint::getInfo2(btTypedConstraint::btConstraintInfo2*)" location="f10:176" file="f10" line="176" extern="1">
    <Argument name="info" type="_8749" location="f10:176" file="f10" line="176"/>
  </Method>
  <Method id="_1877" name="internalSetAppliedImpulse" returns="_631" context="_19" access="public" mangled="_ZN17btTypedConstraint25internalSetAppliedImpulseEf" demangled="btTypedConstraint::internalSetAppliedImpulse(float)" location="f10:179" file="f10" line="179" endline="181" inline="1">
    <Argument name="appliedImpulse" type="_360" location="f10:179" file="f10" line="179"/>
  </Method>
  <Method id="_1878" name="internalGetAppliedImpulse" returns="_360" context="_19" access="public" mangled="_ZN17btTypedConstraint25internalGetAppliedImpulseEv" demangled="btTypedConstraint::internalGetAppliedImpulse()" location="f10:184" file="f10" line="184" endline="186" inline="1"/>
  <Method id="_1879" name="getBreakingImpulseThreshold" returns="_360" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint27getBreakingImpulseThresholdEv" demangled="btTypedConstraint::getBreakingImpulseThreshold() const" location="f10:190" file="f10" line="190" endline="192" inline="1"/>
  <Method id="_1880" name="setBreakingImpulseThreshold" returns="_631" context="_19" access="public" mangled="_ZN17btTypedConstraint27setBreakingImpulseThresholdEf" demangled="btTypedConstraint::setBreakingImpulseThreshold(float)" location="f10:195" file="f10" line="195" endline="197" inline="1">
    <Argument name="threshold" type="_360" location="f10:195" file="f10" line="195"/>
  </Method>
  <Method id="_1881" name="isEnabled" returns="_1816" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint9isEnabledEv" demangled="btTypedConstraint::isEnabled() const" location="f10:200" file="f10" line="200" endline="202" inline="1"/>
  <Method id="_1882" name="setEnabled" returns="_631" context="_19" access="public" mangled="_ZN17btTypedConstraint10setEnabledEb" demangled="btTypedConstraint::setEnabled(bool)" location="f10:205" file="f10" line="205" endline="207" inline="1">
    <Argument name="enabled" type="_1816" location="f10:205" file="f10" line="205"/>
  </Method>
  <Method id="_1883" name="solveConstraintObsolete" returns="_631" virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint23solveConstraintObsoleteER12btSolverBodyS1_f" demangled="btTypedConstraint::solveConstraintObsolete(btSolverBody&amp;, btSolverBody&amp;, float)" location="f10:212" file="f10" line="212" inline="1">
    <Argument type="_3644" location="f10:212" file="f10" line="212"/>
    <Argument type="_3644" location="f10:212" file="f10" line="212"/>
    <Argument type="_360" location="f10:212" file="f10" line="212"/>
  </Method>
  <Method id="_1884" name="getRigidBodyA" returns="_8750" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint13getRigidBodyAEv" demangled="btTypedConstraint::getRigidBodyA() const" location="f10:215" file="f10" line="215" endline="217" inline="1"/>
  <Method id="_1885" name="getRigidBodyB" returns="_8750" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint13getRigidBodyBEv" demangled="btTypedConstraint::getRigidBodyB() const" location="f10:219" file="f10" line="219" endline="221" inline="1"/>
  <Method id="_1886" name="getRigidBodyA" returns="_8718" context="_19" access="public" mangled="_ZN17btTypedConstraint13getRigidBodyAEv" demangled="btTypedConstraint::getRigidBodyA()" location="f10:224" file="f10" line="224" endline="226" inline="1"/>
  <Method id="_1887" name="getRigidBodyB" returns="_8718" context="_19" access="public" mangled="_ZN17btTypedConstraint13getRigidBodyBEv" demangled="btTypedConstraint::getRigidBodyB()" location="f10:228" file="f10" line="228" endline="230" inline="1"/>
  <Method id="_1888" name="getUserConstraintType" returns="_167" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint21getUserConstraintTypeEv" demangled="btTypedConstraint::getUserConstraintType() const" location="f10:233" file="f10" line="233" endline="235" inline="1"/>
  <Method id="_1889" name="setUserConstraintType" returns="_631" context="_19" access="public" mangled="_ZN17btTypedConstraint21setUserConstraintTypeEi" demangled="btTypedConstraint::setUserConstraintType(int)" location="f10:238" file="f10" line="238" endline="240" inline="1">
    <Argument name="userConstraintType" type="_167" location="f10:238" file="f10" line="238"/>
  </Method>
  <Method id="_1890" name="setUserConstraintId" returns="_631" context="_19" access="public" mangled="_ZN17btTypedConstraint19setUserConstraintIdEi" demangled="btTypedConstraint::setUserConstraintId(int)" location="f10:243" file="f10" line="243" endline="245" inline="1">
    <Argument name="uid" type="_167" location="f10:243" file="f10" line="243"/>
  </Method>
  <Method id="_1891" name="getUserConstraintId" returns="_167" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint19getUserConstraintIdEv" demangled="btTypedConstraint::getUserConstraintId() const" location="f10:248" file="f10" line="248" endline="250" inline="1"/>
  <Method id="_1892" name="setUserConstraintPtr" returns="_631" context="_19" access="public" mangled="_ZN17btTypedConstraint20setUserConstraintPtrEPv" demangled="btTypedConstraint::setUserConstraintPtr(void*)" location="f10:253" file="f10" line="253" endline="255" inline="1">
    <Argument name="ptr" type="_1068" location="f10:253" file="f10" line="253"/>
  </Method>
  <Method id="_1893" name="getUserConstraintPtr" returns="_1068" context="_19" access="public" mangled="_ZN17btTypedConstraint20getUserConstraintPtrEv" demangled="btTypedConstraint::getUserConstraintPtr()" location="f10:258" file="f10" line="258" endline="260" inline="1"/>
  <Method id="_1894" name="setJointFeedback" returns="_631" context="_19" access="public" mangled="_ZN17btTypedConstraint16setJointFeedbackEP15btJointFeedback" demangled="btTypedConstraint::setJointFeedback(btJointFeedback*)" location="f10:263" file="f10" line="263" endline="265" inline="1">
    <Argument name="jointFeedback" type="_8719" location="f10:263" file="f10" line="263"/>
  </Method>
  <Method id="_1895" name="getJointFeedback" returns="_8751" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint16getJointFeedbackEv" demangled="btTypedConstraint::getJointFeedback() const" location="f10:268" file="f10" line="268" endline="270" inline="1"/>
  <Method id="_1896" name="getJointFeedback" returns="_8719" context="_19" access="public" mangled="_ZN17btTypedConstraint16getJointFeedbackEv" demangled="btTypedConstraint::getJointFeedback()" location="f10:273" file="f10" line="273" endline="275" inline="1"/>
  <Method id="_1897" name="getUid" returns="_167" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint6getUidEv" demangled="btTypedConstraint::getUid() const" location="f10:279" file="f10" line="279" endline="281" inline="1"/>
  <Method id="_1898" name="needsFeedback" returns="_1816" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint13needsFeedbackEv" demangled="btTypedConstraint::needsFeedback() const" location="f10:284" file="f10" line="284" endline="286" inline="1"/>
  <Method id="_1899" name="enableFeedback" returns="_631" context="_19" access="public" mangled="_ZN17btTypedConstraint14enableFeedbackEb" demangled="btTypedConstraint::enableFeedback(bool)" location="f10:291" file="f10" line="291" endline="293" inline="1">
    <Argument name="needsFeedback" type="_1816" location="f10:291" file="f10" line="291"/>
  </Method>
  <Method id="_1900" name="getAppliedImpulse" returns="_360" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint17getAppliedImpulseEv" demangled="btTypedConstraint::getAppliedImpulse() const" location="f10:298" file="f10" line="298" endline="301" inline="1"/>
  <Method id="_1901" name="getConstraintType" returns="_884" const="1" context="_19" access="public" mangled="_ZNK17btTypedConstraint17getConstraintTypeEv" demangled="btTypedConstraint::getConstraintType() const" location="f10:304" file="f10" line="304" endline="306" inline="1"/>
  <Method id="_1902" name="setDbgDrawSize" returns="_631" context="_19" access="public" mangled="_ZN17btTypedConstraint14setDbgDrawSizeEf" demangled="btTypedConstraint::setDbgDrawSize(float)" location="f10:309" file="f10" line="309" endline="311" inline="1">
    <Argument name="dbgDrawSize" type="_360" location="f10:309" file="f10" line="309"/>
  </Method>
  <Method id="_1903" name="getDbgDrawSize" returns="_360" context="_19" access="public" mangled="_ZN17btTypedConstraint14getDbgDrawSizeEv" demangled="btTypedConstraint::getDbgDrawSize()" location="f10:313" file="f10" line="313" endline="315" inline="1"/>
  <Method id="_1904" name="setParam" returns="_631" virtual="1" pure_virtual="1" overrides="" context="_19" access="public" mangled="_ZN17btTypedConstraint8setParamEifi" demangled="btTypedConstraint::setParam(int, float, int)" location="f10:320" file="f10" line="320" extern="1">
    <Argument name="num" type="_167" location="f10:320" file="f10" line="320"/>
    <Argument name="value" type="_360" location="f10:320" file="f10" line="320"/>
    <Argument name="axis" type="_167" location="f10:320" file="f10" line="320" default="-0x00000000000000001"/>
  </Method>
  <Method id="_1905" name="getParam" returns="_360" const="1" virtual="1" pure_virtual="1" overrides="" context="_19" access="public" mangled="_ZNK17btTypedConstraint8getParamEii" demangled="btTypedConstraint::getParam(int, int) const" location="f10:323" file="f10" line="323" extern="1">
    <Argument name="num" type="_167" location="f10:323" file="f10" line="323"/>
    <Argument name="axis" type="_167" location="f10:323" file="f10" line="323" default="-0x00000000000000001"/>
  </Method>
  <Method id="_1906" name="calculateSerializeBufferSize" returns="_167" const="1" virtual="1" overrides="" context="_19" access="public" mangled="_ZNK17btTypedConstraint28calculateSerializeBufferSizeEv" demangled="btTypedConstraint::calculateSerializeBufferSize() const" location="f10:381" file="f10" line="381" endline="383" inline="1"/>
  <Method id="_1907" name="serialize" returns="_1805" const="1" virtual="1" overrides="" context="_19" access="public" mangled="_ZNK17btTypedConstraint9serializeEPvP12btSerializer" demangled="btTypedConstraint::serialize(void*, btSerializer*) const" location="f10:328" file="f10" line="328" extern="1">
    <Argument name="dataBuffer" type="_1068" location="f10:328" file="f10" line="328"/>
    <Argument name="serializer" type="_8713" location="f10:328" file="f10" line="328"/>
  </Method>
  <PointerType id="_1908" type="_973" size="64" align="64"/>
  <Field id="_1909" name="m_overlappingPairArray" type="_822" offset="64" context="_25" access="private" location="f14:389" file="f14" line="389"/>
  <OperatorMethod id="_1910" name="=" returns="_8752" artificial="1" context="_25" access="public" mangled="_ZN15btNullPairCacheaSERKS_" demangled="btNullPairCache::operator=(btNullPairCache const&amp;)" location="f14:387" file="f14" line="387" endline="387" inline="1">
    <Argument type="_8753" location="f14:387" file="f14" line="387"/>
  </OperatorMethod>
  <Constructor id="_1911" name="btNullPairCache" artificial="1" context="_25" access="public" mangled="_ZN15btNullPairCacheC1ERKS_ *INTERNAL* " demangled="btNullPairCache::btNullPairCache(btNullPairCache const&amp;)" location="f14:387" file="f14" line="387" endline="387" inline="1">
    <Argument type="_8753" location="f14:387" file="f14" line="387"/>
  </Constructor>
  <Constructor id="_1912" name="btNullPairCache" artificial="1" context="_25" access="public" mangled="_ZN15btNullPairCacheC1Ev *INTERNAL* " demangled="btNullPairCache::btNullPairCache()" location="f14:387" file="f14" line="387" endline="387" inline="1"/>
  <Method id="_1913" name="getOverlappingPairArrayPtr" returns="_4308" virtual="1" overrides="_5584 " context="_25" access="public" mangled="_ZN15btNullPairCache26getOverlappingPairArrayPtrEv" demangled="btNullPairCache::getOverlappingPairArrayPtr()" location="f14:393" file="f14" line="393" endline="395" inline="1"/>
  <Method id="_1914" name="getOverlappingPairArrayPtr" returns="_4304" const="1" virtual="1" overrides="_5585 " context="_25" access="public" mangled="_ZNK15btNullPairCache26getOverlappingPairArrayPtrEv" demangled="btNullPairCache::getOverlappingPairArrayPtr() const" location="f14:397" file="f14" line="397" endline="399" inline="1"/>
  <Method id="_1915" name="getOverlappingPairArray" returns="_8754" virtual="1" overrides="_5586 " context="_25" access="public" mangled="_ZN15btNullPairCache23getOverlappingPairArrayEv" demangled="btNullPairCache::getOverlappingPairArray()" location="f14:401" file="f14" line="401" endline="403" inline="1"/>
  <Method id="_1916" name="cleanOverlappingPair" returns="_631" virtual="1" overrides="_5587 " context="_25" access="public" mangled="_ZN15btNullPairCache20cleanOverlappingPairER16btBroadphasePairP12btDispatcher" demangled="btNullPairCache::cleanOverlappingPair(btBroadphasePair&amp;, btDispatcher*)" location="f14:406" file="f14" line="406" inline="1">
    <Argument type="_4310" location="f14:406" file="f14" line="406"/>
    <Argument type="_8755" location="f14:406" file="f14" line="406"/>
  </Method>
  <Method id="_1917" name="getNumOverlappingPairs" returns="_167" const="1" virtual="1" overrides="_5588 " context="_25" access="public" mangled="_ZNK15btNullPairCache22getNumOverlappingPairsEv" demangled="btNullPairCache::getNumOverlappingPairs() const" location="f14:411" file="f14" line="411" endline="413" inline="1"/>
  <Method id="_1918" name="cleanProxyFromPairs" returns="_631" virtual="1" overrides="_5589 " context="_25" access="public" mangled="_ZN15btNullPairCache19cleanProxyFromPairsEP17btBroadphaseProxyP12btDispatcher" demangled="btNullPairCache::cleanProxyFromPairs(btBroadphaseProxy*, btDispatcher*)" location="f14:416" file="f14" line="416" inline="1">
    <Argument type="_8756" location="f14:416" file="f14" line="416"/>
    <Argument type="_8755" location="f14:416" file="f14" line="416"/>
  </Method>
  <Method id="_1919" name="setOverlapFilterCallback" returns="_631" virtual="1" overrides="_5590 " context="_25" access="public" mangled="_ZN15btNullPairCache24setOverlapFilterCallbackEP23btOverlapFilterCallback" demangled="btNullPairCache::setOverlapFilterCallback(btOverlapFilterCallback*)" location="f14:421" file="f14" line="421" inline="1">
    <Argument type="_8757" location="f14:421" file="f14" line="421"/>
  </Method>
  <Method id="_1920" name="processAllOverlappingPairs" returns="_631" virtual="1" overrides="_5591 " context="_25" access="public" mangled="_ZN15btNullPairCache26processAllOverlappingPairsEP17btOverlapCallbackP12btDispatcher" demangled="btNullPairCache::processAllOverlappingPairs(btOverlapCallback*, btDispatcher*)" location="f14:425" file="f14" line="425" inline="1">
    <Argument type="_8758" location="f14:425" file="f14" line="425"/>
    <Argument type="_8755" location="f14:425" file="f14" line="425"/>
  </Method>
  <Method id="_1921" name="findPair" returns="_4308" virtual="1" overrides="_5592 " context="_25" access="public" mangled="_ZN15btNullPairCache8findPairEP17btBroadphaseProxyS1_" demangled="btNullPairCache::findPair(btBroadphaseProxy*, btBroadphaseProxy*)" location="f14:429" file="f14" line="429" endline="431" inline="1">
    <Argument type="_8756" location="f14:429" file="f14" line="429"/>
    <Argument type="_8756" location="f14:429" file="f14" line="429"/>
  </Method>
  <Method id="_1922" name="hasDeferredRemoval" returns="_1816" virtual="1" overrides="_5593 " context="_25" access="public" mangled="_ZN15btNullPairCache18hasDeferredRemovalEv" demangled="btNullPairCache::hasDeferredRemoval()" location="f14:434" file="f14" line="434" endline="436" inline="1"/>
  <Method id="_1923" name="setInternalGhostPairCallback" returns="_631" virtual="1" overrides="_5594 " context="_25" access="public" mangled="_ZN15btNullPairCache28setInternalGhostPairCallbackEP25btOverlappingPairCallback" demangled="btNullPairCache::setInternalGhostPairCallback(btOverlappingPairCallback*)" location="f14:439" file="f14" line="439" inline="1">
    <Argument type="_8759" location="f14:439" file="f14" line="439"/>
  </Method>
  <Method id="_1924" name="addOverlappingPair" returns="_4308" virtual="1" overrides="_6762 " context="_25" access="public" mangled="_ZN15btNullPairCache18addOverlappingPairEP17btBroadphaseProxyS1_" demangled="btNullPairCache::addOverlappingPair(btBroadphaseProxy*, btBroadphaseProxy*)" location="f14:444" file="f14" line="444" endline="446" inline="1">
    <Argument type="_8756" location="f14:444" file="f14" line="444"/>
    <Argument type="_8756" location="f14:444" file="f14" line="444"/>
  </Method>
  <Method id="_1925" name="removeOverlappingPair" returns="_1068" virtual="1" overrides="_6763 " context="_25" access="public" mangled="_ZN15btNullPairCache21removeOverlappingPairEP17btBroadphaseProxyS1_P12btDispatcher" demangled="btNullPairCache::removeOverlappingPair(btBroadphaseProxy*, btBroadphaseProxy*, btDispatcher*)" location="f14:449" file="f14" line="449" endline="451" inline="1">
    <Argument type="_8756" location="f14:449" file="f14" line="449"/>
    <Argument type="_8756" location="f14:449" file="f14" line="449"/>
    <Argument type="_8755" location="f14:449" file="f14" line="449"/>
  </Method>
  <Method id="_1926" name="removeOverlappingPairsContainingProxy" returns="_631" virtual="1" overrides="_6764 " context="_25" access="public" mangled="_ZN15btNullPairCache37removeOverlappingPairsContainingProxyEP17btBroadphaseProxyP12btDispatcher" demangled="btNullPairCache::removeOverlappingPairsContainingProxy(btBroadphaseProxy*, btDispatcher*)" location="f14:454" file="f14" line="454" inline="1">
    <Argument type="_8756" location="f14:454" file="f14" line="454"/>
    <Argument type="_8755" location="f14:454" file="f14" line="454"/>
  </Method>
  <Method id="_1927" name="sortOverlappingPairs" returns="_631" virtual="1" overrides="_5595 " context="_25" access="public" mangled="_ZN15btNullPairCache20sortOverlappingPairsEP12btDispatcher" demangled="btNullPairCache::sortOverlappingPairs(btDispatcher*)" location="f14:458" file="f14" line="458" inline="1">
    <Argument name="dispatcher" type="_8755" location="f14:458" file="f14" line="458"/>
  </Method>
  <Destructor id="_1928" name="btNullPairCache" virtual="1" overrides="_5583 " artificial="1" context="_25" access="public" mangled="_ZN15btNullPairCacheD1Ev *INTERNAL* " demangled="btNullPairCache::~btNullPairCache()" location="f14:387" file="f14" line="387" endline="387" inline="1">
  </Destructor>
  <Field id="_1930" name="m_transform" type="_1453" offset="0" context="_29" access="public" location="f16:181" file="f16" line="181"/>
  <Field id="_1931" name="m_childShape" type="_8760" offset="512" context="_29" access="public" location="f16:182" file="f16" line="182"/>
  <Field id="_1932" name="m_childShapeType" type="_167" offset="576" context="_29" access="public" location="f16:183" file="f16" line="183"/>
  <Field id="_1933" name="m_childMargin" type="_359" offset="608" context="_29" access="public" location="f16:184" file="f16" line="184"/>
  <Destructor id="_1934" name="btCompoundShapeChildData" artificial="1" throw="" context="_29" access="public" mangled="_ZN24btCompoundShapeChildDataD1Ev *INTERNAL* " demangled="btCompoundShapeChildData::~btCompoundShapeChildData()" location="f16:180" file="f16" line="180" endline="180" inline="1">
  </Destructor>
  <OperatorMethod id="_1935" name="=" returns="_8761" artificial="1" throw="" context="_29" access="public" mangled="_ZN24btCompoundShapeChildDataaSERKS_" demangled="btCompoundShapeChildData::operator=(btCompoundShapeChildData const&amp;)" location="f16:180" file="f16" line="180" endline="180" inline="1">
    <Argument type="_8762" location="f16:180" file="f16" line="180"/>
  </OperatorMethod>
  <Constructor id="_1936" name="btCompoundShapeChildData" artificial="1" throw="" context="_29" access="public" mangled="_ZN24btCompoundShapeChildDataC1ERKS_ *INTERNAL* " demangled="btCompoundShapeChildData::btCompoundShapeChildData(btCompoundShapeChildData const&amp;)" location="f16:180" file="f16" line="180" endline="180" inline="1">
    <Argument type="_8762" location="f16:180" file="f16" line="180"/>
  </Constructor>
  <Constructor id="_1937" name="btCompoundShapeChildData" artificial="1" throw="" context="_29" access="public" mangled="_ZN24btCompoundShapeChildDataC1Ev *INTERNAL* " demangled="btCompoundShapeChildData::btCompoundShapeChildData()" location="f16:180" file="f16" line="180" inline="1"/>
  <CvQualifiedType id="_1805r" type="_1805" restrict="1"/>
  <PointerType id="_1939" type="_3390" size="64" align="64"/>
  <Field id="_1940" name="fptr" type="_5800" offset="0" context="_31" access="public" location="f13:345" file="f13" line="345"/>
  <Field id="_1941" name="rptr" type="_5800" offset="64" context="_31" access="public" location="f13:346" file="f13" line="346"/>
  <Field id="_1942" name="state" type="_5800" offset="128" context="_31" access="public" location="f13:347" file="f13" line="347"/>
  <Field id="_1943" name="rand_type" type="_167" offset="192" context="_31" access="public" location="f13:348" file="f13" line="348"/>
  <Field id="_1944" name="rand_deg" type="_167" offset="224" context="_31" access="public" location="f13:349" file="f13" line="349"/>
  <Field id="_1945" name="rand_sep" type="_167" offset="256" context="_31" access="public" location="f13:350" file="f13" line="350"/>
  <Field id="_1946" name="end_ptr" type="_5800" offset="320" context="_31" access="public" location="f13:351" file="f13" line="351"/>
  <Destructor id="_1947" name="random_data" artificial="1" throw="" context="_31" access="public" mangled="_ZN11random_dataD1Ev *INTERNAL* " demangled="random_data::~random_data()" location="f13:344" file="f13" line="344" endline="344" inline="1">
  </Destructor>
  <OperatorMethod id="_1948" name="=" returns="_8763" artificial="1" throw="" context="_31" access="public" mangled="_ZN11random_dataaSERKS_" demangled="random_data::operator=(random_data const&amp;)" location="f13:344" file="f13" line="344" endline="344" inline="1">
    <Argument type="_8764" location="f13:344" file="f13" line="344"/>
  </OperatorMethod>
  <Constructor id="_1949" name="random_data" artificial="1" throw="" context="_31" access="public" mangled="_ZN11random_dataC1ERKS_ *INTERNAL* " demangled="random_data::random_data(random_data const&amp;)" location="f13:344" file="f13" line="344" endline="344" inline="1">
    <Argument type="_8764" location="f13:344" file="f13" line="344"/>
  </Constructor>
  <Constructor id="_1950" name="random_data" artificial="1" throw="" context="_31" access="public" mangled="_ZN11random_dataC1Ev *INTERNAL* " demangled="random_data::random_data()" location="f13:344" file="f13" line="344" inline="1"/>
  <FundamentalType id="_1951" name="wchar_t" size="32" align="32"/>
  <PointerType id="_1952" type="_167" size="64" align="64"/>
  <FundamentalType id="_1953" name="long long int" size="64" align="64"/>
  <PointerType id="_1954" type="_1062" size="64" align="64"/>
  <CvQualifiedType id="_1954r" type="_1954" restrict="1"/>
  <FundamentalType id="_1956" name="complex float" size="64" align="32"/>
  <FundamentalType id="_1957" name="complex long double" size="256" align="128"/>
  <OperatorMethod id="_1958" name="=" returns="_8765" artificial="1" throw="" context="_44" access="public" mangled="_ZN17bt32BitAxisSweep3aSERKS_" demangled="bt32BitAxisSweep3::operator=(bt32BitAxisSweep3 const&amp;)" location="f21:1043" file="f21" line="1043" endline="1043" inline="1">
    <Argument type="_8766" location="f21:1043" file="f21" line="1043"/>
  </OperatorMethod>
  <Constructor id="_1959" name="bt32BitAxisSweep3" artificial="1" throw="" context="_44" access="public" mangled="_ZN17bt32BitAxisSweep3C1ERKS_ *INTERNAL* " demangled="bt32BitAxisSweep3::bt32BitAxisSweep3(bt32BitAxisSweep3 const&amp;)" location="f21:1043" file="f21" line="1043" endline="1043" inline="1">
    <Argument type="_8766" location="f21:1043" file="f21" line="1043"/>
  </Constructor>
  <Constructor id="_1960" name="bt32BitAxisSweep3" explicit="1" context="_44" access="public" mangled="_ZN17bt32BitAxisSweep3C1ERK9btVector3S2_jP22btOverlappingPairCacheb *INTERNAL* " demangled="bt32BitAxisSweep3::bt32BitAxisSweep3(btVector3 const&amp;, btVector3 const&amp;, unsigned int, btOverlappingPairCache*, bool)" location="f21:1046" file="f21" line="1046" extern="1">
    <Argument name="worldAabbMin" type="_1806" location="f21:1046" file="f21" line="1046"/>
    <Argument name="worldAabbMax" type="_1806" location="f21:1046" file="f21" line="1046"/>
    <Argument name="maxHandles" type="_85" location="f21:1046" file="f21" line="1046" default="1500000"/>
    <Argument name="pairCache" type="_8767" location="f21:1046" file="f21" line="1046" default="0"/>
    <Argument name="disableRaycastAccelerator" type="_1816" location="f21:1046" file="f21" line="1046" default="false"/>
  </Constructor>
  <Destructor id="_1961" name="bt32BitAxisSweep3" virtual="1" overrides="_8469 " artificial="1" context="_44" access="public" mangled="_ZN17bt32BitAxisSweep3D1Ev *INTERNAL* " demangled="bt32BitAxisSweep3::~bt32BitAxisSweep3()" location="f21:1043" file="f21" line="1043" endline="1043" inline="1">
  </Destructor>
  <CvQualifiedType id="_1062r" type="_1062" restrict="1"/>
  <Field id="_1963" name="__size" type="_8708" offset="0" context="_50" access="public" location="f22:157" file="f22" line="157"/>
  <Field id="_1964" name="__align" type="_167" offset="0" context="_50" access="public" location="f22:158" file="f22" line="158"/>
  <Destructor id="_1965" name="._15" artificial="1" throw="" context="_50" access="public" mangled="_ZN18pthread_condattr_tD1Ev *INTERNAL* " demangled="pthread_condattr_t::~pthread_condattr_t()" location="f22:159" file="f22" line="159" endline="159" inline="1">
  </Destructor>
  <OperatorMethod id="_1966" name="=" returns="_8768" artificial="1" throw="" context="_50" access="public" mangled="_ZN18pthread_condattr_taSERKS_" demangled="pthread_condattr_t::operator=(pthread_condattr_t const&amp;)" location="f22:159" file="f22" line="159" endline="159" inline="1">
    <Argument type="_8769" location="f22:156" file="f22" line="156"/>
  </OperatorMethod>
  <Constructor id="_1967" name="._15" artificial="1" throw="" context="_50" access="public" mangled="_ZN18pthread_condattr_tC1ERKS_ *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t(pthread_condattr_t const&amp;)" location="f22:159" file="f22" line="159" endline="159" inline="1">
    <Argument type="_8769" location="f22:156" file="f22" line="156"/>
  </Constructor>
  <Constructor id="_1968" name="._15" artificial="1" throw="" context="_50" access="public" mangled="_ZN18pthread_condattr_tC1Ev *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t()" location="f22:159" file="f22" line="159" inline="1"/>
  <Field id="_1969" name="m_convexInternalShapeData" type="_1333" offset="0" context="_55" access="public" location="f24:85" file="f24" line="85"/>
  <Field id="_1970" name="m_localPositionArrayPtr" type="_8770" offset="448" context="_55" access="public" location="f24:87" file="f24" line="87"/>
  <Field id="_1971" name="m_localPositionArraySize" type="_167" offset="512" context="_55" access="public" location="f24:88" file="f24" line="88"/>
  <Field id="_1972" name="m_padding" type="_8708" offset="544" context="_55" access="public" location="f24:89" file="f24" line="89"/>
  <Destructor id="_1973" name="btMultiSphereShapeData" artificial="1" throw="" context="_55" access="public" mangled="_ZN22btMultiSphereShapeDataD1Ev *INTERNAL* " demangled="btMultiSphereShapeData::~btMultiSphereShapeData()" location="f24:84" file="f24" line="84" endline="84" inline="1">
  </Destructor>
  <OperatorMethod id="_1974" name="=" returns="_8771" artificial="1" throw="" context="_55" access="public" mangled="_ZN22btMultiSphereShapeDataaSERKS_" demangled="btMultiSphereShapeData::operator=(btMultiSphereShapeData const&amp;)" location="f24:84" file="f24" line="84" endline="84" inline="1">
    <Argument type="_8772" location="f24:84" file="f24" line="84"/>
  </OperatorMethod>
  <Constructor id="_1975" name="btMultiSphereShapeData" artificial="1" throw="" context="_55" access="public" mangled="_ZN22btMultiSphereShapeDataC1ERKS_ *INTERNAL* " demangled="btMultiSphereShapeData::btMultiSphereShapeData(btMultiSphereShapeData const&amp;)" location="f24:84" file="f24" line="84" endline="84" inline="1">
    <Argument type="_8772" location="f24:84" file="f24" line="84"/>
  </Constructor>
  <Constructor id="_1976" name="btMultiSphereShapeData" artificial="1" throw="" context="_55" access="public" mangled="_ZN22btMultiSphereShapeDataC1Ev *INTERNAL* " demangled="btMultiSphereShapeData::btMultiSphereShapeData()" location="f24:84" file="f24" line="84" inline="1"/>
  <Field id="_1977" name="m_transform" type="_481" offset="0" context="_56" access="public" location="f16:34" file="f16" line="34"/>
  <Field id="_1978" name="m_childShape" type="_8773" offset="512" context="_56" access="public" location="f16:35" file="f16" line="35"/>
  <Field id="_1979" name="m_childShapeType" type="_167" offset="576" context="_56" access="public" location="f16:36" file="f16" line="36"/>
  <Field id="_1980" name="m_childMargin" type="_360" offset="608" context="_56" access="public" location="f16:37" file="f16" line="37"/>
  <Field id="_1981" name="m_node" type="_8774" offset="640" context="_56" access="public" location="f16:38" file="f16" line="38"/>
  <Destructor id="_1982" name="btCompoundShapeChild" artificial="1" throw="" context="_56" access="public" mangled="_ZN20btCompoundShapeChildD1Ev *INTERNAL* " demangled="btCompoundShapeChild::~btCompoundShapeChild()" location="f16:31" file="f16" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1983" name="=" returns="_3879" artificial="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildaSERKS_" demangled="btCompoundShapeChild::operator=(btCompoundShapeChild const&amp;)" location="f16:31" file="f16" line="31" endline="31" inline="1">
    <Argument type="_3875" location="f16:31" file="f16" line="31"/>
  </OperatorMethod>
  <Constructor id="_1984" name="btCompoundShapeChild" artificial="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildC1ERKS_ *INTERNAL* " demangled="btCompoundShapeChild::btCompoundShapeChild(btCompoundShapeChild const&amp;)" location="f16:31" file="f16" line="31" endline="31" inline="1">
    <Argument type="_3875" location="f16:31" file="f16" line="31"/>
  </Constructor>
  <Constructor id="_1985" name="btCompoundShapeChild" artificial="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildC1Ev *INTERNAL* " demangled="btCompoundShapeChild::btCompoundShapeChild()" location="f16:31" file="f16" line="31" endline="31" inline="1"/>
  <OperatorMethod id="_1986" name="new" returns="_1068" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildnwEm" demangled="btCompoundShapeChild::operator new(unsigned long)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_1987" name="delete" returns="_631" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChilddlEPv" demangled="btCompoundShapeChild::operator delete(void*)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument name="ptr" type="_1068" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_1988" name="new" returns="_1068" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildnwEmPv" demangled="btCompoundShapeChild::operator new(unsigned long, void*)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument type="_1155" location="f16:32" file="f16" line="32"/>
    <Argument name="ptr" type="_1068" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_1989" name="delete" returns="_631" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChilddlEPvS0_" demangled="btCompoundShapeChild::operator delete(void*, void*)" location="f16:32" file="f16" line="32" inline="1">
    <Argument type="_1068" location="f16:32" file="f16" line="32"/>
    <Argument type="_1068" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_1990" name="new []" returns="_1068" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildnaEm" demangled="btCompoundShapeChild::operator new[](unsigned long)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_1991" name="delete []" returns="_631" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChilddaEPv" demangled="btCompoundShapeChild::operator delete[](void*)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument name="ptr" type="_1068" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_1992" name="new []" returns="_1068" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChildnaEmPv" demangled="btCompoundShapeChild::operator new[](unsigned long, void*)" location="f16:32" file="f16" line="32" endline="32" inline="1">
    <Argument type="_1155" location="f16:32" file="f16" line="32"/>
    <Argument name="ptr" type="_1068" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_1993" name="delete []" returns="_631" static="1" context="_56" access="public" mangled="_ZN20btCompoundShapeChilddaEPvS0_" demangled="btCompoundShapeChild::operator delete[](void*, void*)" location="f16:32" file="f16" line="32" inline="1">
    <Argument type="_1068" location="f16:32" file="f16" line="32"/>
    <Argument type="_1068" location="f16:32" file="f16" line="32"/>
  </OperatorMethod>
  <OperatorMethod id="_1994" name="=" returns="_8775" artificial="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhaSERKS_" demangled="btOptimizedBvh::operator=(btOptimizedBvh const&amp;)" location="f25:28" file="f25" line="28" endline="28" inline="1">
    <Argument type="_8776" location="f25:28" file="f25" line="28"/>
  </OperatorMethod>
  <Constructor id="_1995" name="btOptimizedBvh" artificial="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhC1ERKS_ *INTERNAL* " demangled="btOptimizedBvh::btOptimizedBvh(btOptimizedBvh const&amp;)" location="f25:28" file="f25" line="28" endline="28" inline="1">
    <Argument type="_8776" location="f25:28" file="f25" line="28"/>
  </Constructor>
  <OperatorMethod id="_1996" name="new" returns="_1068" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhnwEm" demangled="btOptimizedBvh::operator new(unsigned long)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_1997" name="delete" returns="_631" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhdlEPv" demangled="btOptimizedBvh::operator delete(void*)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument name="ptr" type="_1068" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_1998" name="new" returns="_1068" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhnwEmPv" demangled="btOptimizedBvh::operator new(unsigned long, void*)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument type="_1155" location="f25:31" file="f25" line="31"/>
    <Argument name="ptr" type="_1068" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_1999" name="delete" returns="_631" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhdlEPvS0_" demangled="btOptimizedBvh::operator delete(void*, void*)" location="f25:31" file="f25" line="31" inline="1">
    <Argument type="_1068" location="f25:31" file="f25" line="31"/>
    <Argument type="_1068" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2000" name="new []" returns="_1068" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhnaEm" demangled="btOptimizedBvh::operator new[](unsigned long)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2001" name="delete []" returns="_631" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhdaEPv" demangled="btOptimizedBvh::operator delete[](void*)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument name="ptr" type="_1068" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2002" name="new []" returns="_1068" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhnaEmPv" demangled="btOptimizedBvh::operator new[](unsigned long, void*)" location="f25:31" file="f25" line="31" endline="31" inline="1">
    <Argument type="_1155" location="f25:31" file="f25" line="31"/>
    <Argument name="ptr" type="_1068" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2003" name="delete []" returns="_631" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhdaEPvS0_" demangled="btOptimizedBvh::operator delete[](void*, void*)" location="f25:31" file="f25" line="31" inline="1">
    <Argument type="_1068" location="f25:31" file="f25" line="31"/>
    <Argument type="_1068" location="f25:31" file="f25" line="31"/>
  </OperatorMethod>
  <Constructor id="_2004" name="btOptimizedBvh" explicit="1" context="_57" access="public" mangled="_ZN14btOptimizedBvhC1Ev *INTERNAL* " demangled="btOptimizedBvh::btOptimizedBvh()" location="f25:37" file="f25" line="37" extern="1"/>
  <Destructor id="_2005" name="btOptimizedBvh" virtual="1" overrides="_4413 " context="_57" access="public" mangled="_ZN14btOptimizedBvhD1Ev *INTERNAL* " demangled="btOptimizedBvh::~btOptimizedBvh()" location="f25:39" file="f25" line="39" extern="1">
  </Destructor>
  <Method id="_2006" name="build" returns="_631" context="_57" access="public" mangled="_ZN14btOptimizedBvh5buildEP23btStridingMeshInterfacebRK9btVector3S4_" demangled="btOptimizedBvh::build(btStridingMeshInterface*, bool, btVector3 const&amp;, btVector3 const&amp;)" location="f25:41" file="f25" line="41" extern="1">
    <Argument name="triangles" type="_8777" location="f25:41" file="f25" line="41"/>
    <Argument name="useQuantizedAabbCompression" type="_1816" location="f25:41" file="f25" line="41"/>
    <Argument name="bvhAabbMin" type="_1806" location="f25:41" file="f25" line="41"/>
    <Argument name="bvhAabbMax" type="_1806" location="f25:41" file="f25" line="41"/>
  </Method>
  <Method id="_2007" name="refit" returns="_631" context="_57" access="public" mangled="_ZN14btOptimizedBvh5refitEP23btStridingMeshInterfaceRK9btVector3S4_" demangled="btOptimizedBvh::refit(btStridingMeshInterface*, btVector3 const&amp;, btVector3 const&amp;)" location="f25:43" file="f25" line="43" extern="1">
    <Argument name="triangles" type="_8777" location="f25:43" file="f25" line="43"/>
    <Argument name="aabbMin" type="_1806" location="f25:43" file="f25" line="43"/>
    <Argument name="aabbMax" type="_1806" location="f25:43" file="f25" line="43"/>
  </Method>
  <Method id="_2008" name="refitPartial" returns="_631" context="_57" access="public" mangled="_ZN14btOptimizedBvh12refitPartialEP23btStridingMeshInterfaceRK9btVector3S4_" demangled="btOptimizedBvh::refitPartial(btStridingMeshInterface*, btVector3 const&amp;, btVector3 const&amp;)" location="f25:45" file="f25" line="45" extern="1">
    <Argument name="triangles" type="_8777" location="f25:45" file="f25" line="45"/>
    <Argument name="aabbMin" type="_1806" location="f25:45" file="f25" line="45"/>
    <Argument name="aabbMax" type="_1806" location="f25:45" file="f25" line="45"/>
  </Method>
  <Method id="_2009" name="updateBvhNodes" returns="_631" context="_57" access="public" mangled="_ZN14btOptimizedBvh14updateBvhNodesEP23btStridingMeshInterfaceiii" demangled="btOptimizedBvh::updateBvhNodes(btStridingMeshInterface*, int, int, int)" location="f25:47" file="f25" line="47" extern="1">
    <Argument name="meshInterface" type="_8777" location="f25:47" file="f25" line="47"/>
    <Argument name="firstNode" type="_167" location="f25:47" file="f25" line="47"/>
    <Argument name="endNode" type="_167" location="f25:47" file="f25" line="47"/>
    <Argument name="index" type="_167" location="f25:47" file="f25" line="47"/>
  </Method>
  <Method id="_2010" name="serializeInPlace" returns="_1816" const="1" virtual="1" overrides="" context="_57" access="public" mangled="_ZNK14btOptimizedBvh16serializeInPlaceEPvjb" demangled="btOptimizedBvh::serializeInPlace(void*, unsigned int, bool) const" location="f25:50" file="f25" line="50" endline="52" inline="1">
    <Argument name="o_alignedDataBuffer" type="_1068" location="f25:50" file="f25" line="50"/>
    <Argument name="i_dataBufferSize" type="_85" location="f25:50" file="f25" line="50"/>
    <Argument name="i_swapEndian" type="_1816" location="f25:50" file="f25" line="50"/>
  </Method>
  <Method id="_2011" name="deSerializeInPlace" returns="_8778" static="1" context="_57" access="public" mangled="_ZN14btOptimizedBvh18deSerializeInPlaceEPvjb" demangled="btOptimizedBvh::deSerializeInPlace(void*, unsigned int, bool)" location="f25:57" file="f25" line="57" extern="1">
    <Argument name="i_alignedDataBuffer" type="_1068" location="f25:57" file="f25" line="57"/>
    <Argument name="i_dataBufferSize" type="_85" location="f25:57" file="f25" line="57"/>
    <Argument name="i_swapEndian" type="_1816" location="f25:57" file="f25" line="57"/>
  </Method>
  <Struct id="_2012" name="__class_type_info_pseudo" context="_1" mangled="24__class_type_info_pseudo" demangled="__class_type_info_pseudo" location="f131:0" file="f131" line="0" size="128" align="64" members=""/>
  <CvQualifiedType id="_2012c" type="_2012" const="1"/>
  <Field id="_2014" name="m_nextFree" type="_167" offset="480" context="_70" access="public" location="f32:25" file="f32" line="25"/>
  <Destructor id="_2015" name="btSimpleBroadphaseProxy" artificial="1" throw="" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxyD1Ev *INTERNAL* " demangled="btSimpleBroadphaseProxy::~btSimpleBroadphaseProxy()" location="f32:24" file="f32" line="24" endline="24" inline="1">
  </Destructor>
  <OperatorMethod id="_2016" name="=" returns="_8779" artificial="1" throw="" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxyaSERKS_" demangled="btSimpleBroadphaseProxy::operator=(btSimpleBroadphaseProxy const&amp;)" location="f32:24" file="f32" line="24" endline="24" inline="1">
    <Argument type="_8780" location="f32:24" file="f32" line="24"/>
  </OperatorMethod>
  <Constructor id="_2017" name="btSimpleBroadphaseProxy" artificial="1" throw="" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxyC1ERKS_ *INTERNAL* " demangled="btSimpleBroadphaseProxy::btSimpleBroadphaseProxy(btSimpleBroadphaseProxy const&amp;)" location="f32:24" file="f32" line="24" endline="24" inline="1">
    <Argument type="_8780" location="f32:24" file="f32" line="24"/>
  </Constructor>
  <Constructor id="_2018" name="btSimpleBroadphaseProxy" explicit="1" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxyC1Ev *INTERNAL* " demangled="btSimpleBroadphaseProxy::btSimpleBroadphaseProxy()" location="f32:30" file="f32" line="30" endline="30" inline="1"/>
  <Constructor id="_2019" name="btSimpleBroadphaseProxy" explicit="1" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxyC1ERK9btVector3S2_iPvssS3_ *INTERNAL* " demangled="btSimpleBroadphaseProxy::btSimpleBroadphaseProxy(btVector3 const&amp;, btVector3 const&amp;, int, void*, short, short, void*)" location="f32:32" file="f32" line="32" endline="33" inline="1">
    <Argument name="minpt" type="_1806" location="f32:32" file="f32" line="32"/>
    <Argument name="maxpt" type="_1806" location="f32:32" file="f32" line="32"/>
    <Argument name="shapeType" type="_167" location="f32:32" file="f32" line="32"/>
    <Argument name="userPtr" type="_1068" location="f32:32" file="f32" line="32"/>
    <Argument name="collisionFilterGroup" type="_225" location="f32:32" file="f32" line="32"/>
    <Argument name="collisionFilterMask" type="_225" location="f32:32" file="f32" line="32"/>
    <Argument name="multiSapProxy" type="_1068" location="f32:32" file="f32" line="32"/>
  </Constructor>
  <Method id="_2020" name="SetNextFree" returns="_631" context="_70" access="public" mangled="_ZN23btSimpleBroadphaseProxy11SetNextFreeEi" demangled="btSimpleBroadphaseProxy::SetNextFree(int)" location="f32:39" file="f32" line="39" endline="39" inline="1">
    <Argument name="next" type="_167" location="f32:39" file="f32" line="39"/>
  </Method>
  <Method id="_2021" name="GetNextFree" returns="_167" const="1" context="_70" access="public" mangled="_ZNK23btSimpleBroadphaseProxy11GetNextFreeEv" demangled="btSimpleBroadphaseProxy::GetNextFree() const" location="f32:40" file="f32" line="40" endline="40" inline="1"/>
  <Struct id="_2022" name="btVehicleRaycasterResult" context="_72" access="public" mangled="N18btVehicleRaycaster24btVehicleRaycasterResultE" demangled="btVehicleRaycaster::btVehicleRaycasterResult" location="f33:23" file="f33" line="23" artificial="1" size="288" align="32" members="_8781 _8782 _8783 _8784 _8785 _8786 _8787 " bases=""/>
  <OperatorMethod id="_2023" name="=" returns="_8788" artificial="1" throw="" context="_72" access="public" mangled="_ZN18btVehicleRaycasteraSERKS_" demangled="btVehicleRaycaster::operator=(btVehicleRaycaster const&amp;)" location="f33:18" file="f33" line="18" endline="18" inline="1">
    <Argument type="_8789" location="f33:18" file="f33" line="18"/>
  </OperatorMethod>
  <Constructor id="_2024" name="btVehicleRaycaster" artificial="1" throw="" context="_72" access="public" mangled="_ZN18btVehicleRaycasterC1ERKS_ *INTERNAL* " demangled="btVehicleRaycaster::btVehicleRaycaster(btVehicleRaycaster const&amp;)" location="f33:18" file="f33" line="18" endline="18" inline="1">
    <Argument type="_8789" location="f33:18" file="f33" line="18"/>
  </Constructor>
  <Constructor id="_2025" name="btVehicleRaycaster" artificial="1" throw="" context="_72" access="public" mangled="_ZN18btVehicleRaycasterC1Ev *INTERNAL* " demangled="btVehicleRaycaster::btVehicleRaycaster()" location="f33:18" file="f33" line="18" endline="18" inline="1"/>
  <Destructor id="_2026" name="btVehicleRaycaster" virtual="1" overrides="" context="_72" access="public" mangled="_ZN18btVehicleRaycasterD1Ev *INTERNAL* " demangled="btVehicleRaycaster::~btVehicleRaycaster()" location="f33:19" file="f33" line="19" endline="21" inline="1">
  </Destructor>
  <Method id="_2027" name="castRay" returns="_1068" virtual="1" pure_virtual="1" overrides="" context="_72" access="public" mangled="_ZN18btVehicleRaycaster7castRayERK9btVector3S2_RNS_24btVehicleRaycasterResultE" demangled="btVehicleRaycaster::castRay(btVector3 const&amp;, btVector3 const&amp;, btVehicleRaycaster::btVehicleRaycasterResult&amp;)" location="f33:30" file="f33" line="30" extern="1">
    <Argument name="from" type="_1806" location="f33:30" file="f33" line="30"/>
    <Argument name="to" type="_1806" location="f33:30" file="f33" line="30"/>
    <Argument name="result" type="_8790" location="f33:30" file="f33" line="30"/>
  </Method>
  <PointerType id="_2028" type="_92" size="64" align="64"/>
  <CvQualifiedType id="_2028r" type="_2028" restrict="1"/>
  <PointerType id="_2030" type="_340" size="64" align="64"/>
  <Field id="_2031" name="quot" type="_167" offset="0" context="_79" access="public" location="f13:99" file="f13" line="99"/>
  <Field id="_2032" name="rem" type="_167" offset="32" context="_79" access="public" location="f13:100" file="f13" line="100"/>
  <Destructor id="_2033" name="._6" artificial="1" throw="" context="_79" access="public" mangled="_ZN5div_tD1Ev *INTERNAL* " demangled="div_t::~div_t()" location="f13:101" file="f13" line="101" endline="101" inline="1">
  </Destructor>
  <OperatorMethod id="_2034" name="=" returns="_8791" artificial="1" throw="" context="_79" access="public" mangled="_ZN5div_taSERKS_" demangled="div_t::operator=(div_t const&amp;)" location="f13:101" file="f13" line="101" endline="101" inline="1">
    <Argument type="_8792" location="f13:98" file="f13" line="98"/>
  </OperatorMethod>
  <Constructor id="_2035" name="._6" artificial="1" throw="" context="_79" access="public" mangled="_ZN5div_tC1ERKS_ *INTERNAL* " demangled="div_t::div_t(div_t const&amp;)" location="f13:101" file="f13" line="101" endline="101" inline="1">
    <Argument type="_8792" location="f13:98" file="f13" line="98"/>
  </Constructor>
  <Constructor id="_2036" name="._6" artificial="1" throw="" context="_79" access="public" mangled="_ZN5div_tC1Ev *INTERNAL* " demangled="div_t::div_t()" location="f13:101" file="f13" line="101" inline="1"/>
  <Field id="_2037" name="m_rootNodeIndex" type="_167" offset="0" context="_83" access="public" location="f35:505" file="f35" line="505"/>
  <Field id="_2038" name="m_subtreeSize" type="_167" offset="32" context="_83" access="public" location="f35:506" file="f35" line="506"/>
  <Field id="_2039" name="m_quantizedAabbMin" type="_8793" offset="64" context="_83" access="public" location="f35:507" file="f35" line="507"/>
  <Field id="_2040" name="m_quantizedAabbMax" type="_8793" offset="112" context="_83" access="public" location="f35:508" file="f35" line="508"/>
  <Destructor id="_2041" name="btBvhSubtreeInfoData" artificial="1" throw="" context="_83" access="public" mangled="_ZN20btBvhSubtreeInfoDataD1Ev *INTERNAL* " demangled="btBvhSubtreeInfoData::~btBvhSubtreeInfoData()" location="f35:504" file="f35" line="504" endline="504" inline="1">
  </Destructor>
  <OperatorMethod id="_2042" name="=" returns="_8794" artificial="1" throw="" context="_83" access="public" mangled="_ZN20btBvhSubtreeInfoDataaSERKS_" demangled="btBvhSubtreeInfoData::operator=(btBvhSubtreeInfoData const&amp;)" location="f35:504" file="f35" line="504" endline="504" inline="1">
    <Argument type="_8795" location="f35:504" file="f35" line="504"/>
  </OperatorMethod>
  <Constructor id="_2043" name="btBvhSubtreeInfoData" artificial="1" throw="" context="_83" access="public" mangled="_ZN20btBvhSubtreeInfoDataC1ERKS_ *INTERNAL* " demangled="btBvhSubtreeInfoData::btBvhSubtreeInfoData(btBvhSubtreeInfoData const&amp;)" location="f35:504" file="f35" line="504" endline="504" inline="1">
    <Argument type="_8795" location="f35:504" file="f35" line="504"/>
  </Constructor>
  <Constructor id="_2044" name="btBvhSubtreeInfoData" artificial="1" throw="" context="_83" access="public" mangled="_ZN20btBvhSubtreeInfoDataC1Ev *INTERNAL* " demangled="btBvhSubtreeInfoData::btBvhSubtreeInfoData()" location="f35:504" file="f35" line="504" inline="1"/>
  <PointerType id="_2045" type="_480" size="64" align="64"/>
  <Field id="_2046" name="m_invInertiaTensorWorld" type="_1248" offset="2304" context="_94" access="private" location="f37:62" file="f37" line="62"/>
  <Field id="_2047" name="m_linearVelocity" type="_192" offset="2688" context="_94" access="private" location="f37:63" file="f37" line="63"/>
  <Field id="_2048" name="m_angularVelocity" type="_192" offset="2816" context="_94" access="private" location="f37:64" file="f37" line="64"/>
  <Field id="_2049" name="m_inverseMass" type="_360" offset="2944" context="_94" access="private" location="f37:65" file="f37" line="65"/>
  <Field id="_2050" name="m_linearFactor" type="_192" offset="2976" context="_94" access="private" location="f37:66" file="f37" line="66"/>
  <Field id="_2051" name="m_gravity" type="_192" offset="3104" context="_94" access="private" location="f37:68" file="f37" line="68"/>
  <Field id="_2052" name="m_gravity_acceleration" type="_192" offset="3232" context="_94" access="private" location="f37:69" file="f37" line="69"/>
  <Field id="_2053" name="m_invInertiaLocal" type="_192" offset="3360" context="_94" access="private" location="f37:70" file="f37" line="70"/>
  <Field id="_2054" name="m_totalForce" type="_192" offset="3488" context="_94" access="private" location="f37:71" file="f37" line="71"/>
  <Field id="_2055" name="m_totalTorque" type="_192" offset="3616" context="_94" access="private" location="f37:72" file="f37" line="72"/>
  <Field id="_2056" name="m_linearDamping" type="_360" offset="3744" context="_94" access="private" location="f37:74" file="f37" line="74"/>
  <Field id="_2057" name="m_angularDamping" type="_360" offset="3776" context="_94" access="private" location="f37:75" file="f37" line="75"/>
  <Field id="_2058" name="m_additionalDamping" type="_1816" offset="3808" context="_94" access="private" location="f37:77" file="f37" line="77"/>
  <Field id="_2059" name="m_additionalDampingFactor" type="_360" offset="3840" context="_94" access="private" location="f37:78" file="f37" line="78"/>
  <Field id="_2060" name="m_additionalLinearDampingThresholdSqr" type="_360" offset="3872" context="_94" access="private" location="f37:79" file="f37" line="79"/>
  <Field id="_2061" name="m_additionalAngularDampingThresholdSqr" type="_360" offset="3904" context="_94" access="private" location="f37:80" file="f37" line="80"/>
  <Field id="_2062" name="m_additionalAngularDampingFactor" type="_360" offset="3936" context="_94" access="private" location="f37:81" file="f37" line="81"/>
  <Field id="_2063" name="m_linearSleepingThreshold" type="_360" offset="3968" context="_94" access="private" location="f37:84" file="f37" line="84"/>
  <Field id="_2064" name="m_angularSleepingThreshold" type="_360" offset="4000" context="_94" access="private" location="f37:85" file="f37" line="85"/>
  <Field id="_2065" name="m_optionalMotionState" type="_8796" offset="4032" context="_94" access="private" location="f37:88" file="f37" line="88"/>
  <Field id="_2066" name="m_constraintRefs" type="_1531" offset="4096" context="_94" access="private" location="f37:91" file="f37" line="91"/>
  <Field id="_2067" name="m_rigidbodyFlags" type="_167" offset="4352" context="_94" access="private" location="f37:93" file="f37" line="93"/>
  <Field id="_2068" name="m_debugBodyId" type="_167" offset="4384" context="_94" access="private" location="f37:95" file="f37" line="95"/>
  <Field id="_2069" name="m_deltaLinearVelocity" type="_192" offset="4416" context="_94" access="protected" location="f37:100" file="f37" line="100"/>
  <Field id="_2070" name="m_deltaAngularVelocity" type="_192" offset="4544" context="_94" access="protected" location="f37:101" file="f37" line="101"/>
  <Field id="_2071" name="m_angularFactor" type="_192" offset="4672" context="_94" access="protected" location="f37:102" file="f37" line="102"/>
  <Field id="_2072" name="m_invMass" type="_192" offset="4800" context="_94" access="protected" location="f37:103" file="f37" line="103"/>
  <Field id="_2073" name="m_pushVelocity" type="_192" offset="4928" context="_94" access="protected" location="f37:104" file="f37" line="104"/>
  <Field id="_2074" name="m_turnVelocity" type="_192" offset="5056" context="_94" access="protected" location="f37:105" file="f37" line="105"/>
  <Field id="_2075" name="m_contactSolverType" type="_167" offset="5184" context="_94" access="public" location="f37:482" file="f37" line="482"/>
  <Field id="_2076" name="m_frictionSolverType" type="_167" offset="5216" context="_94" access="public" location="f37:483" file="f37" line="483"/>
  <Struct id="_2077" name="btRigidBodyConstructionInfo" context="_94" access="public" mangled="N11btRigidBody27btRigidBodyConstructionInfoE" demangled="btRigidBody::btRigidBodyConstructionInfo" location="f37:117" file="f37" line="117" artificial="1" size="1216" align="64" members="_8797 _8798 _8799 _8800 _8801 _8802 _8803 _8804 _8805 _8806 _8807 _8808 _8809 _8810 _8811 _8812 _8813 _8814 _8815 _8816 _8817 " bases=""/>
  <OperatorMethod id="_2078" name="=" returns="_8718" artificial="1" context="_94" access="public" mangled="_ZN11btRigidBodyaSERKS_" demangled="btRigidBody::operator=(btRigidBody const&amp;)" location="f37:60" file="f37" line="60" endline="60" inline="1">
    <Argument type="_8750" location="f37:60" file="f37" line="60"/>
  </OperatorMethod>
  <Constructor id="_2079" name="btRigidBody" artificial="1" context="_94" access="public" mangled="_ZN11btRigidBodyC1ERKS_ *INTERNAL* " demangled="btRigidBody::btRigidBody(btRigidBody const&amp;)" location="f37:60" file="f37" line="60" endline="60" inline="1">
    <Argument type="_8750" location="f37:60" file="f37" line="60"/>
  </Constructor>
  <Constructor id="_2080" name="btRigidBody" context="_94" access="public" mangled="_ZN11btRigidBodyC1ERKNS_27btRigidBodyConstructionInfoE *INTERNAL* " demangled="btRigidBody::btRigidBody(btRigidBody::btRigidBodyConstructionInfo const&amp;)" location="f37:172" file="f37" line="172" extern="1">
    <Argument name="constructionInfo" type="_8818" location="f37:172" file="f37" line="172"/>
  </Constructor>
  <Constructor id="_2081" name="btRigidBody" explicit="1" context="_94" access="public" mangled="_ZN11btRigidBodyC1EfP13btMotionStateP16btCollisionShapeRK9btVector3 *INTERNAL* " demangled="btRigidBody::btRigidBody(float, btMotionState*, btCollisionShape*, btVector3 const&amp;)" location="f37:176" file="f37" line="176" extern="1">
    <Argument name="mass" type="_360" location="f37:176" file="f37" line="176"/>
    <Argument name="motionState" type="_8796" location="f37:176" file="f37" line="176"/>
    <Argument name="collisionShape" type="_8773" location="f37:176" file="f37" line="176"/>
    <Argument name="localInertia" type="_1806" location="f37:176" file="f37" line="176" default="btVector3(((const btScalar&amp;)((const btScalar*)(&amp;0.0))), ((const btScalar&amp;)((const btScalar*)(&amp;0.0))), ((const btScalar&amp;)((const btScalar*)(&amp;0.0))))"/>
  </Constructor>
  <Destructor id="_2082" name="btRigidBody" virtual="1" overrides="_6683 " context="_94" access="public" mangled="_ZN11btRigidBodyD1Ev *INTERNAL* " demangled="btRigidBody::~btRigidBody()" location="f37:179" file="f37" line="179" endline="184" inline="1">
  </Destructor>
  <Method id="_2083" name="setupRigidBody" returns="_631" context="_94" access="protected" mangled="_ZN11btRigidBody14setupRigidBodyERKNS_27btRigidBodyConstructionInfoE" demangled="btRigidBody::setupRigidBody(btRigidBody::btRigidBodyConstructionInfo const&amp;)" location="f37:189" file="f37" line="189" extern="1">
    <Argument name="constructionInfo" type="_8818" location="f37:189" file="f37" line="189"/>
  </Method>
  <Method id="_2084" name="proceedToTransform" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody18proceedToTransformERK11btTransform" demangled="btRigidBody::proceedToTransform(btTransform const&amp;)" location="f37:193" file="f37" line="193" extern="1">
    <Argument name="newTrans" type="_6832" location="f37:193" file="f37" line="193"/>
  </Method>
  <Method id="_2085" name="upcast" returns="_8819" static="1" context="_94" access="public" mangled="_ZN11btRigidBody6upcastEPK17btCollisionObject" demangled="btRigidBody::upcast(btCollisionObject const*)" location="f37:197" file="f37" line="197" endline="201" inline="1">
    <Argument name="colObj" type="_4254" location="f37:197" file="f37" line="197"/>
  </Method>
  <Method id="_2086" name="upcast" returns="_3704" static="1" context="_94" access="public" mangled="_ZN11btRigidBody6upcastEP17btCollisionObject" demangled="btRigidBody::upcast(btCollisionObject*)" location="f37:203" file="f37" line="203" endline="207" inline="1">
    <Argument name="colObj" type="_4274" location="f37:203" file="f37" line="203"/>
  </Method>
  <Method id="_2087" name="predictIntegratedTransform" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody26predictIntegratedTransformEfR11btTransform" demangled="btRigidBody::predictIntegratedTransform(float, btTransform&amp;)" location="f37:211" file="f37" line="211" extern="1">
    <Argument name="step" type="_360" location="f37:211" file="f37" line="211"/>
    <Argument name="predictedTransform" type="_8820" location="f37:211" file="f37" line="211"/>
  </Method>
  <Method id="_2088" name="saveKinematicState" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody18saveKinematicStateEf" demangled="btRigidBody::saveKinematicState(float)" location="f37:213" file="f37" line="213" extern="1">
    <Argument name="step" type="_360" location="f37:213" file="f37" line="213"/>
  </Method>
  <Method id="_2089" name="applyGravity" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody12applyGravityEv" demangled="btRigidBody::applyGravity()" location="f37:215" file="f37" line="215" extern="1"/>
  <Method id="_2090" name="setGravity" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody10setGravityERK9btVector3" demangled="btRigidBody::setGravity(btVector3 const&amp;)" location="f37:217" file="f37" line="217" extern="1">
    <Argument name="acceleration" type="_1806" location="f37:217" file="f37" line="217"/>
  </Method>
  <Method id="_2091" name="getGravity" returns="_1806" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody10getGravityEv" demangled="btRigidBody::getGravity() const" location="f37:219" file="f37" line="219" endline="221" inline="1"/>
  <Method id="_2092" name="setDamping" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody10setDampingEff" demangled="btRigidBody::setDamping(float, float)" location="f37:224" file="f37" line="224" extern="1">
    <Argument name="lin_damping" type="_360" location="f37:224" file="f37" line="224"/>
    <Argument name="ang_damping" type="_360" location="f37:224" file="f37" line="224"/>
  </Method>
  <Method id="_2093" name="getLinearDamping" returns="_360" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody16getLinearDampingEv" demangled="btRigidBody::getLinearDamping() const" location="f37:226" file="f37" line="226" endline="228" inline="1"/>
  <Method id="_2094" name="getAngularDamping" returns="_360" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody17getAngularDampingEv" demangled="btRigidBody::getAngularDamping() const" location="f37:231" file="f37" line="231" endline="233" inline="1"/>
  <Method id="_2095" name="getLinearSleepingThreshold" returns="_360" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody26getLinearSleepingThresholdEv" demangled="btRigidBody::getLinearSleepingThreshold() const" location="f37:236" file="f37" line="236" endline="238" inline="1"/>
  <Method id="_2096" name="getAngularSleepingThreshold" returns="_360" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody27getAngularSleepingThresholdEv" demangled="btRigidBody::getAngularSleepingThreshold() const" location="f37:241" file="f37" line="241" endline="243" inline="1"/>
  <Method id="_2097" name="applyDamping" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody12applyDampingEf" demangled="btRigidBody::applyDamping(float)" location="f37:246" file="f37" line="246" extern="1">
    <Argument name="timeStep" type="_360" location="f37:246" file="f37" line="246"/>
  </Method>
  <Method id="_2098" name="getCollisionShape" returns="_8821" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody17getCollisionShapeEv" demangled="btRigidBody::getCollisionShape() const" location="f37:248" file="f37" line="248" endline="249" inline="1"/>
  <Method id="_2099" name="getCollisionShape" returns="_8773" context="_94" access="public" mangled="_ZN11btRigidBody17getCollisionShapeEv" demangled="btRigidBody::getCollisionShape()" location="f37:252" file="f37" line="252" endline="253" inline="1"/>
  <Method id="_2100" name="setMassProps" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody12setMassPropsEfRK9btVector3" demangled="btRigidBody::setMassProps(float, btVector3 const&amp;)" location="f37:256" file="f37" line="256" extern="1">
    <Argument name="mass" type="_360" location="f37:256" file="f37" line="256"/>
    <Argument name="inertia" type="_1806" location="f37:256" file="f37" line="256"/>
  </Method>
  <Method id="_2101" name="getLinearFactor" returns="_1806" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody15getLinearFactorEv" demangled="btRigidBody::getLinearFactor() const" location="f37:258" file="f37" line="258" endline="260" inline="1"/>
  <Method id="_2102" name="setLinearFactor" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody15setLinearFactorERK9btVector3" demangled="btRigidBody::setLinearFactor(btVector3 const&amp;)" location="f37:262" file="f37" line="262" endline="265" inline="1">
    <Argument name="linearFactor" type="_1806" location="f37:262" file="f37" line="262"/>
  </Method>
  <Method id="_2103" name="getInvMass" returns="_360" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody10getInvMassEv" demangled="btRigidBody::getInvMass() const" location="f37:267" file="f37" line="267" endline="267" inline="1"/>
  <Method id="_2104" name="getInvInertiaTensorWorld" returns="_6018" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody24getInvInertiaTensorWorldEv" demangled="btRigidBody::getInvInertiaTensorWorld() const" location="f37:268" file="f37" line="268" endline="269" inline="1"/>
  <Method id="_2105" name="integrateVelocities" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody19integrateVelocitiesEf" demangled="btRigidBody::integrateVelocities(float)" location="f37:272" file="f37" line="272" extern="1">
    <Argument name="step" type="_360" location="f37:272" file="f37" line="272"/>
  </Method>
  <Method id="_2106" name="setCenterOfMassTransform" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody24setCenterOfMassTransformERK11btTransform" demangled="btRigidBody::setCenterOfMassTransform(btTransform const&amp;)" location="f37:274" file="f37" line="274" extern="1">
    <Argument name="xform" type="_6832" location="f37:274" file="f37" line="274"/>
  </Method>
  <Method id="_2107" name="applyCentralForce" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody17applyCentralForceERK9btVector3" demangled="btRigidBody::applyCentralForce(btVector3 const&amp;)" location="f37:276" file="f37" line="276" endline="278" inline="1">
    <Argument name="force" type="_1806" location="f37:276" file="f37" line="276"/>
  </Method>
  <Method id="_2108" name="getTotalForce" returns="_1806" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody13getTotalForceEv" demangled="btRigidBody::getTotalForce() const" location="f37:281" file="f37" line="281" endline="283" inline="1"/>
  <Method id="_2109" name="getTotalTorque" returns="_1806" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody14getTotalTorqueEv" demangled="btRigidBody::getTotalTorque() const" location="f37:286" file="f37" line="286" endline="288" inline="1"/>
  <Method id="_2110" name="getInvInertiaDiagLocal" returns="_1806" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody22getInvInertiaDiagLocalEv" demangled="btRigidBody::getInvInertiaDiagLocal() const" location="f37:291" file="f37" line="291" endline="293" inline="1"/>
  <Method id="_2111" name="setInvInertiaDiagLocal" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody22setInvInertiaDiagLocalERK9btVector3" demangled="btRigidBody::setInvInertiaDiagLocal(btVector3 const&amp;)" location="f37:296" file="f37" line="296" endline="298" inline="1">
    <Argument name="diagInvInertia" type="_1806" location="f37:296" file="f37" line="296"/>
  </Method>
  <Method id="_2112" name="setSleepingThresholds" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody21setSleepingThresholdsEff" demangled="btRigidBody::setSleepingThresholds(float, float)" location="f37:301" file="f37" line="301" endline="304" inline="1">
    <Argument name="linear" type="_360" location="f37:301" file="f37" line="301"/>
    <Argument name="angular" type="_360" location="f37:301" file="f37" line="301"/>
  </Method>
  <Method id="_2113" name="applyTorque" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody11applyTorqueERK9btVector3" demangled="btRigidBody::applyTorque(btVector3 const&amp;)" location="f37:307" file="f37" line="307" endline="309" inline="1">
    <Argument name="torque" type="_1806" location="f37:307" file="f37" line="307"/>
  </Method>
  <Method id="_2114" name="applyForce" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody10applyForceERK9btVector3S2_" demangled="btRigidBody::applyForce(btVector3 const&amp;, btVector3 const&amp;)" location="f37:312" file="f37" line="312" endline="315" inline="1">
    <Argument name="force" type="_1806" location="f37:312" file="f37" line="312"/>
    <Argument name="rel_pos" type="_1806" location="f37:312" file="f37" line="312"/>
  </Method>
  <Method id="_2115" name="applyCentralImpulse" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody19applyCentralImpulseERK9btVector3" demangled="btRigidBody::applyCentralImpulse(btVector3 const&amp;)" location="f37:318" file="f37" line="318" endline="320" inline="1">
    <Argument name="impulse" type="_1806" location="f37:318" file="f37" line="318"/>
  </Method>
  <Method id="_2116" name="applyTorqueImpulse" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody18applyTorqueImpulseERK9btVector3" demangled="btRigidBody::applyTorqueImpulse(btVector3 const&amp;)" location="f37:323" file="f37" line="323" endline="325" inline="1">
    <Argument name="torque" type="_1806" location="f37:323" file="f37" line="323"/>
  </Method>
  <Method id="_2117" name="applyImpulse" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody12applyImpulseERK9btVector3S2_" demangled="btRigidBody::applyImpulse(btVector3 const&amp;, btVector3 const&amp;)" location="f37:328" file="f37" line="328" endline="330" inline="1">
    <Argument name="impulse" type="_1806" location="f37:328" file="f37" line="328"/>
    <Argument name="rel_pos" type="_1806" location="f37:328" file="f37" line="328"/>
  </Method>
  <Method id="_2118" name="clearForces" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody11clearForcesEv" demangled="btRigidBody::clearForces()" location="f37:340" file="f37" line="340" endline="343" inline="1"/>
  <Method id="_2119" name="updateInertiaTensor" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody19updateInertiaTensorEv" demangled="btRigidBody::updateInertiaTensor()" location="f37:346" file="f37" line="346" extern="1"/>
  <Method id="_2120" name="getCenterOfMassPosition" returns="_1806" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody23getCenterOfMassPositionEv" demangled="btRigidBody::getCenterOfMassPosition() const" location="f37:348" file="f37" line="348" endline="349" inline="1"/>
  <Method id="_2121" name="getOrientation" returns="_1078" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody14getOrientationEv" demangled="btRigidBody::getOrientation() const" location="f37:351" file="f37" line="351" extern="1"/>
  <Method id="_2122" name="getCenterOfMassTransform" returns="_6832" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody24getCenterOfMassTransformEv" demangled="btRigidBody::getCenterOfMassTransform() const" location="f37:353" file="f37" line="353" endline="354" inline="1"/>
  <Method id="_2123" name="getLinearVelocity" returns="_1806" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody17getLinearVelocityEv" demangled="btRigidBody::getLinearVelocity() const" location="f37:356" file="f37" line="356" endline="357" inline="1"/>
  <Method id="_2124" name="getAngularVelocity" returns="_1806" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody18getAngularVelocityEv" demangled="btRigidBody::getAngularVelocity() const" location="f37:359" file="f37" line="359" endline="360" inline="1"/>
  <Method id="_2125" name="setLinearVelocity" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody17setLinearVelocityERK9btVector3" demangled="btRigidBody::setLinearVelocity(btVector3 const&amp;)" location="f37:364" file="f37" line="364" endline="366" inline="1">
    <Argument name="lin_vel" type="_1806" location="f37:364" file="f37" line="364"/>
  </Method>
  <Method id="_2126" name="setAngularVelocity" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody18setAngularVelocityERK9btVector3" demangled="btRigidBody::setAngularVelocity(btVector3 const&amp;)" location="f37:369" file="f37" line="369" endline="371" inline="1">
    <Argument name="ang_vel" type="_1806" location="f37:369" file="f37" line="369"/>
  </Method>
  <Method id="_2127" name="getVelocityInLocalPoint" returns="_192" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody23getVelocityInLocalPointERK9btVector3" demangled="btRigidBody::getVelocityInLocalPoint(btVector3 const&amp;) const" location="f37:374" file="f37" line="374" endline="377" inline="1">
    <Argument name="rel_pos" type="_1806" location="f37:374" file="f37" line="374"/>
  </Method>
  <Method id="_2128" name="translate" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody9translateERK9btVector3" demangled="btRigidBody::translate(btVector3 const&amp;)" location="f37:383" file="f37" line="383" endline="385" inline="1">
    <Argument name="v" type="_1806" location="f37:383" file="f37" line="383"/>
  </Method>
  <Method id="_2129" name="getAabb" returns="_631" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody7getAabbER9btVector3S1_" demangled="btRigidBody::getAabb(btVector3&amp;, btVector3&amp;) const" location="f37:389" file="f37" line="389" extern="1">
    <Argument name="aabbMin" type="_2481" location="f37:389" file="f37" line="389"/>
    <Argument name="aabbMax" type="_2481" location="f37:389" file="f37" line="389"/>
  </Method>
  <Method id="_2130" name="computeImpulseDenominator" returns="_360" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody25computeImpulseDenominatorERK9btVector3S2_" demangled="btRigidBody::computeImpulseDenominator(btVector3 const&amp;, btVector3 const&amp;) const" location="f37:395" file="f37" line="395" endline="403" inline="1">
    <Argument name="pos" type="_1806" location="f37:395" file="f37" line="395"/>
    <Argument name="normal" type="_1806" location="f37:395" file="f37" line="395"/>
  </Method>
  <Method id="_2131" name="computeAngularImpulseDenominator" returns="_360" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody32computeAngularImpulseDenominatorERK9btVector3" demangled="btRigidBody::computeAngularImpulseDenominator(btVector3 const&amp;) const" location="f37:407" file="f37" line="407" endline="410" inline="1">
    <Argument name="axis" type="_1806" location="f37:407" file="f37" line="407"/>
  </Method>
  <Method id="_2132" name="updateDeactivation" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody18updateDeactivationEf" demangled="btRigidBody::updateDeactivation(float)" location="f37:413" file="f37" line="413" endline="418" inline="1">
    <Argument name="timeStep" type="_360" location="f37:413" file="f37" line="413"/>
  </Method>
  <Method id="_2133" name="wantsSleeping" returns="_1816" context="_94" access="public" mangled="_ZN11btRigidBody13wantsSleepingEv" demangled="btRigidBody::wantsSleeping()" location="f37:430" file="f37" line="430" endline="447" inline="1"/>
  <Method id="_2134" name="getBroadphaseProxy" returns="_8822" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody18getBroadphaseProxyEv" demangled="btRigidBody::getBroadphaseProxy() const" location="f37:452" file="f37" line="452" endline="454" inline="1"/>
  <Method id="_2135" name="getBroadphaseProxy" returns="_8756" context="_94" access="public" mangled="_ZN11btRigidBody18getBroadphaseProxyEv" demangled="btRigidBody::getBroadphaseProxy()" location="f37:456" file="f37" line="456" endline="458" inline="1"/>
  <Method id="_2136" name="setNewBroadphaseProxy" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody21setNewBroadphaseProxyEP17btBroadphaseProxy" demangled="btRigidBody::setNewBroadphaseProxy(btBroadphaseProxy*)" location="f37:460" file="f37" line="460" endline="462" inline="1">
    <Argument name="broadphaseProxy" type="_8756" location="f37:460" file="f37" line="460"/>
  </Method>
  <Method id="_2137" name="getMotionState" returns="_8796" context="_94" access="public" mangled="_ZN11btRigidBody14getMotionStateEv" demangled="btRigidBody::getMotionState()" location="f37:466" file="f37" line="466" endline="468" inline="1"/>
  <Method id="_2138" name="getMotionState" returns="_8823" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody14getMotionStateEv" demangled="btRigidBody::getMotionState() const" location="f37:470" file="f37" line="470" endline="472" inline="1"/>
  <Method id="_2139" name="setMotionState" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody14setMotionStateEP13btMotionState" demangled="btRigidBody::setMotionState(btMotionState*)" location="f37:474" file="f37" line="474" endline="477" inline="1">
    <Argument name="motionState" type="_8796" location="f37:474" file="f37" line="474"/>
  </Method>
  <Method id="_2140" name="setAngularFactor" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody16setAngularFactorERK9btVector3" demangled="btRigidBody::setAngularFactor(btVector3 const&amp;)" location="f37:485" file="f37" line="485" endline="487" inline="1">
    <Argument name="angFac" type="_1806" location="f37:485" file="f37" line="485"/>
  </Method>
  <Method id="_2141" name="setAngularFactor" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody16setAngularFactorEf" demangled="btRigidBody::setAngularFactor(float)" location="f37:490" file="f37" line="490" endline="492" inline="1">
    <Argument name="angFac" type="_360" location="f37:490" file="f37" line="490"/>
  </Method>
  <Method id="_2142" name="getAngularFactor" returns="_1806" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody16getAngularFactorEv" demangled="btRigidBody::getAngularFactor() const" location="f37:494" file="f37" line="494" endline="496" inline="1"/>
  <Method id="_2143" name="isInWorld" returns="_1816" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody9isInWorldEv" demangled="btRigidBody::isInWorld() const" location="f37:500" file="f37" line="500" endline="502" inline="1"/>
  <Method id="_2144" name="checkCollideWithOverride" returns="_1816" const="1" virtual="1" overrides="_6663 " context="_94" access="public" mangled="_ZNK11btRigidBody24checkCollideWithOverrideEPK17btCollisionObject" demangled="btRigidBody::checkCollideWithOverride(btCollisionObject const*) const" location="f37:505" file="f37" line="505" extern="1">
    <Argument name="co" type="_4254" location="f37:505" file="f37" line="505"/>
  </Method>
  <Method id="_2145" name="addConstraintRef" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody16addConstraintRefEP17btTypedConstraint" demangled="btRigidBody::addConstraintRef(btTypedConstraint*)" location="f37:507" file="f37" line="507" extern="1">
    <Argument name="c" type="_3724" location="f37:507" file="f37" line="507"/>
  </Method>
  <Method id="_2146" name="removeConstraintRef" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody19removeConstraintRefEP17btTypedConstraint" demangled="btRigidBody::removeConstraintRef(btTypedConstraint*)" location="f37:508" file="f37" line="508" extern="1">
    <Argument name="c" type="_3724" location="f37:508" file="f37" line="508"/>
  </Method>
  <Method id="_2147" name="getConstraintRef" returns="_3724" context="_94" access="public" mangled="_ZN11btRigidBody16getConstraintRefEi" demangled="btRigidBody::getConstraintRef(int)" location="f37:510" file="f37" line="510" endline="512" inline="1">
    <Argument name="index" type="_167" location="f37:510" file="f37" line="510"/>
  </Method>
  <Method id="_2148" name="getNumConstraintRefs" returns="_167" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody20getNumConstraintRefsEv" demangled="btRigidBody::getNumConstraintRefs() const" location="f37:515" file="f37" line="515" endline="517" inline="1"/>
  <Method id="_2149" name="setFlags" returns="_631" context="_94" access="public" mangled="_ZN11btRigidBody8setFlagsEi" demangled="btRigidBody::setFlags(int)" location="f37:520" file="f37" line="520" endline="522" inline="1">
    <Argument name="flags" type="_167" location="f37:520" file="f37" line="520"/>
  </Method>
  <Method id="_2150" name="getFlags" returns="_167" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody8getFlagsEv" demangled="btRigidBody::getFlags() const" location="f37:525" file="f37" line="525" endline="527" inline="1"/>
  <Method id="_2151" name="computeGyroscopicForce" returns="_192" const="1" context="_94" access="public" mangled="_ZNK11btRigidBody22computeGyroscopicForceEf" demangled="btRigidBody::computeGyroscopicForce(float) const" location="f37:530" file="f37" line="530" extern="1">
    <Argument name="maxGyroscopicForce" type="_360" location="f37:530" file="f37" line="530"/>
  </Method>
  <Method id="_2152" name="calculateSerializeBufferSize" returns="_167" const="1" virtual="1" overrides="_6732 " context="_94" access="public" mangled="_ZNK11btRigidBody28calculateSerializeBufferSizeEv" demangled="btRigidBody::calculateSerializeBufferSize() const" location="f37:534" file="f37" line="534" extern="1"/>
  <Method id="_2153" name="serialize" returns="_1805" const="1" virtual="1" overrides="_6733 " context="_94" access="public" mangled="_ZNK11btRigidBody9serializeEPvP12btSerializer" demangled="btRigidBody::serialize(void*, btSerializer*) const" location="f37:537" file="f37" line="537" extern="1">
    <Argument name="dataBuffer" type="_1068" location="f37:537" file="f37" line="537"/>
    <Argument name="serializer" type="_8713" location="f37:537" file="f37" line="537"/>
  </Method>
  <Method id="_2154" name="serializeSingleObject" returns="_631" const="1" virtual="1" overrides="_6734 " context="_94" access="public" mangled="_ZNK11btRigidBody21serializeSingleObjectEP12btSerializer" demangled="btRigidBody::serializeSingleObject(btSerializer*) const" location="f37:539" file="f37" line="539" extern="1">
    <Argument name="serializer" type="_8713" location="f37:539" file="f37" line="539"/>
  </Method>
  <PointerType id="_2155" type="_340c" size="64" align="64"/>
  <Field id="_2156" name="Name" type="_1805" offset="0" context="_101" access="protected" location="f39:89" file="f39" line="89"/>
  <Field id="_2157" name="TotalCalls" type="_167" offset="64" context="_101" access="protected" location="f39:90" file="f39" line="90"/>
  <Field id="_2158" name="TotalTime" type="_359" offset="96" context="_101" access="protected" location="f39:91" file="f39" line="91"/>
  <Field id="_2159" name="StartTime" type="_152" offset="128" context="_101" access="protected" location="f39:92" file="f39" line="92"/>
  <Field id="_2160" name="RecursionCounter" type="_167" offset="192" context="_101" access="protected" location="f39:93" file="f39" line="93"/>
  <Field id="_2161" name="Parent" type="_8825" offset="256" context="_101" access="protected" location="f39:95" file="f39" line="95"/>
  <Field id="_2162" name="Child" type="_8825" offset="320" context="_101" access="protected" location="f39:96" file="f39" line="96"/>
  <Field id="_2163" name="Sibling" type="_8825" offset="384" context="_101" access="protected" location="f39:97" file="f39" line="97"/>
  <Field id="_2164" name="m_userPtr" type="_1068" offset="448" context="_101" access="protected" location="f39:98" file="f39" line="98"/>
  <OperatorMethod id="_2165" name="=" returns="_8826" artificial="1" throw="" context="_101" access="public" mangled="_ZN12CProfileNodeaSERKS_" demangled="CProfileNode::operator=(CProfileNode const&amp;)" location="f39:65" file="f39" line="65" endline="65" inline="1">
    <Argument type="_8827" location="f39:65" file="f39" line="65"/>
  </OperatorMethod>
  <Constructor id="_2166" name="CProfileNode" artificial="1" throw="" context="_101" access="public" mangled="_ZN12CProfileNodeC1ERKS_ *INTERNAL* " demangled="CProfileNode::CProfileNode(CProfileNode const&amp;)" location="f39:65" file="f39" line="65" endline="65" inline="1">
    <Argument type="_8827" location="f39:65" file="f39" line="65"/>
  </Constructor>
  <Constructor id="_2167" name="CProfileNode" explicit="1" context="_101" access="public" mangled="_ZN12CProfileNodeC1EPKcPS_ *INTERNAL* " demangled="CProfileNode::CProfileNode(char const*, CProfileNode*)" location="f39:68" file="f39" line="68" extern="1">
    <Argument name="name" type="_1805" location="f39:68" file="f39" line="68"/>
    <Argument name="parent" type="_8825" location="f39:68" file="f39" line="68"/>
  </Constructor>
  <Destructor id="_2168" name="CProfileNode" context="_101" access="public" mangled="_ZN12CProfileNodeD1Ev *INTERNAL* " demangled="CProfileNode::~CProfileNode()" location="f39:69" file="f39" line="69" extern="1">
  </Destructor>
  <Method id="_2169" name="Get_Sub_Node" returns="_8825" context="_101" access="public" mangled="_ZN12CProfileNode12Get_Sub_NodeEPKc" demangled="CProfileNode::Get_Sub_Node(char const*)" location="f39:71" file="f39" line="71" extern="1">
    <Argument name="name" type="_1805" location="f39:71" file="f39" line="71"/>
  </Method>
  <Method id="_2170" name="Get_Parent" returns="_8825" context="_101" access="public" mangled="_ZN12CProfileNode10Get_ParentEv" demangled="CProfileNode::Get_Parent()" location="f39:73" file="f39" line="73" endline="73" inline="1"/>
  <Method id="_2171" name="Get_Sibling" returns="_8825" context="_101" access="public" mangled="_ZN12CProfileNode11Get_SiblingEv" demangled="CProfileNode::Get_Sibling()" location="f39:74" file="f39" line="74" endline="74" inline="1"/>
  <Method id="_2172" name="Get_Child" returns="_8825" context="_101" access="public" mangled="_ZN12CProfileNode9Get_ChildEv" demangled="CProfileNode::Get_Child()" location="f39:75" file="f39" line="75" endline="75" inline="1"/>
  <Method id="_2173" name="CleanupMemory" returns="_631" context="_101" access="public" mangled="_ZN12CProfileNode13CleanupMemoryEv" demangled="CProfileNode::CleanupMemory()" location="f39:77" file="f39" line="77" extern="1"/>
  <Method id="_2174" name="Reset" returns="_631" context="_101" access="public" mangled="_ZN12CProfileNode5ResetEv" demangled="CProfileNode::Reset()" location="f39:78" file="f39" line="78" extern="1"/>
  <Method id="_2175" name="Call" returns="_631" context="_101" access="public" mangled="_ZN12CProfileNode4CallEv" demangled="CProfileNode::Call()" location="f39:79" file="f39" line="79" extern="1"/>
  <Method id="_2176" name="Return" returns="_1816" context="_101" access="public" mangled="_ZN12CProfileNode6ReturnEv" demangled="CProfileNode::Return()" location="f39:80" file="f39" line="80" extern="1"/>
  <Method id="_2177" name="Get_Name" returns="_1805" context="_101" access="public" mangled="_ZN12CProfileNode8Get_NameEv" demangled="CProfileNode::Get_Name()" location="f39:82" file="f39" line="82" endline="82" inline="1"/>
  <Method id="_2178" name="Get_Total_Calls" returns="_167" context="_101" access="public" mangled="_ZN12CProfileNode15Get_Total_CallsEv" demangled="CProfileNode::Get_Total_Calls()" location="f39:83" file="f39" line="83" endline="83" inline="1"/>
  <Method id="_2179" name="Get_Total_Time" returns="_359" context="_101" access="public" mangled="_ZN12CProfileNode14Get_Total_TimeEv" demangled="CProfileNode::Get_Total_Time()" location="f39:84" file="f39" line="84" endline="84" inline="1"/>
  <Method id="_2180" name="GetUserPointer" returns="_1068" const="1" context="_101" access="public" mangled="_ZNK12CProfileNode14GetUserPointerEv" demangled="CProfileNode::GetUserPointer() const" location="f39:85" file="f39" line="85" endline="85" inline="1"/>
  <Method id="_2181" name="SetUserPointer" returns="_631" context="_101" access="public" mangled="_ZN12CProfileNode14SetUserPointerEPv" demangled="CProfileNode::SetUserPointer(void*)" location="f39:86" file="f39" line="86" endline="86" inline="1">
    <Argument name="ptr" type="_1068" location="f39:86" file="f39" line="86"/>
  </Method>
  <Field id="_2182" name="m_collisionShapeData" type="_1290" offset="0" context="_102" access="public" location="f40:74" file="f40" line="74"/>
  <Field id="_2183" name="m_localScaling" type="_617" offset="128" context="_102" access="public" location="f40:76" file="f40" line="76"/>
  <Field id="_2184" name="m_planeNormal" type="_617" offset="256" context="_102" access="public" location="f40:77" file="f40" line="77"/>
  <Field id="_2185" name="m_planeConstant" type="_359" offset="384" context="_102" access="public" location="f40:78" file="f40" line="78"/>
  <Field id="_2186" name="m_pad" type="_8708" offset="416" context="_102" access="public" location="f40:79" file="f40" line="79"/>
  <Destructor id="_2187" name="btStaticPlaneShapeData" artificial="1" throw="" context="_102" access="public" mangled="_ZN22btStaticPlaneShapeDataD1Ev *INTERNAL* " demangled="btStaticPlaneShapeData::~btStaticPlaneShapeData()" location="f40:73" file="f40" line="73" endline="73" inline="1">
  </Destructor>
  <OperatorMethod id="_2188" name="=" returns="_8828" artificial="1" throw="" context="_102" access="public" mangled="_ZN22btStaticPlaneShapeDataaSERKS_" demangled="btStaticPlaneShapeData::operator=(btStaticPlaneShapeData const&amp;)" location="f40:73" file="f40" line="73" endline="73" inline="1">
    <Argument type="_8829" location="f40:73" file="f40" line="73"/>
  </OperatorMethod>
  <Constructor id="_2189" name="btStaticPlaneShapeData" artificial="1" throw="" context="_102" access="public" mangled="_ZN22btStaticPlaneShapeDataC1ERKS_ *INTERNAL* " demangled="btStaticPlaneShapeData::btStaticPlaneShapeData(btStaticPlaneShapeData const&amp;)" location="f40:73" file="f40" line="73" endline="73" inline="1">
    <Argument type="_8829" location="f40:73" file="f40" line="73"/>
  </Constructor>
  <Constructor id="_2190" name="btStaticPlaneShapeData" artificial="1" throw="" context="_102" access="public" mangled="_ZN22btStaticPlaneShapeDataC1Ev *INTERNAL* " demangled="btStaticPlaneShapeData::btStaticPlaneShapeData()" location="f40:73" file="f40" line="73" inline="1"/>
  <Field id="_2191" name="__val" type="_8830" offset="0" context="_109" access="public" location="f43:29" file="f43" line="29"/>
  <Destructor id="_2192" name="._9" artificial="1" throw="" context="_109" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f43:30" file="f43" line="30" endline="30" inline="1">
  </Destructor>
  <OperatorMethod id="_2193" name="=" returns="_8831" artificial="1" throw="" context="_109" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f43:30" file="f43" line="30" endline="30" inline="1">
    <Argument type="_8832" location="f43:28" file="f43" line="28"/>
  </OperatorMethod>
  <Constructor id="_2194" name="._9" artificial="1" throw="" context="_109" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f43:30" file="f43" line="30" endline="30" inline="1">
    <Argument type="_8832" location="f43:28" file="f43" line="28"/>
  </Constructor>
  <Constructor id="_2195" name="._9" artificial="1" throw="" context="_109" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f43:30" file="f43" line="30" inline="1"/>
  <Field id="_2196" name="mi" type="_192" offset="0" context="_117" access="private" location="f27:170" file="f27" line="170"/>
  <Field id="_2197" name="mx" type="_192" offset="128" context="_117" access="private" location="f27:170" file="f27" line="170"/>
  <Destructor id="_2198" name="btDbvtAabbMm" artificial="1" throw="" context="_117" access="public" mangled="_ZN12btDbvtAabbMmD1Ev *INTERNAL* " demangled="btDbvtAabbMm::~btDbvtAabbMm()" location="f27:131" file="f27" line="131" endline="131" inline="1">
  </Destructor>
  <OperatorMethod id="_2199" name="=" returns="_3391" artificial="1" throw="" context="_117" access="public" mangled="_ZN12btDbvtAabbMmaSERKS_" demangled="btDbvtAabbMm::operator=(btDbvtAabbMm const&amp;)" location="f27:131" file="f27" line="131" endline="131" inline="1">
    <Argument type="_2500" location="f27:131" file="f27" line="131"/>
  </OperatorMethod>
  <Constructor id="_2200" name="btDbvtAabbMm" artificial="1" throw="" context="_117" access="public" mangled="_ZN12btDbvtAabbMmC1ERKS_ *INTERNAL* " demangled="btDbvtAabbMm::btDbvtAabbMm(btDbvtAabbMm const&amp;)" location="f27:131" file="f27" line="131" endline="131" inline="1">
    <Argument type="_2500" location="f27:131" file="f27" line="131"/>
  </Constructor>
  <Constructor id="_2201" name="btDbvtAabbMm" artificial="1" context="_117" access="public" mangled="_ZN12btDbvtAabbMmC1Ev *INTERNAL* " demangled="btDbvtAabbMm::btDbvtAabbMm()" location="f27:131" file="f27" line="131" endline="131" inline="1"/>
  <Method id="_2202" name="Center" returns="_192" const="1" context="_117" access="public" mangled="_ZNK12btDbvtAabbMm6CenterEv" demangled="btDbvtAabbMm::Center() const" location="f27:132" file="f27" line="132" endline="132" inline="1"/>
  <Method id="_2203" name="Lengths" returns="_192" const="1" context="_117" access="public" mangled="_ZNK12btDbvtAabbMm7LengthsEv" demangled="btDbvtAabbMm::Lengths() const" location="f27:133" file="f27" line="133" endline="133" inline="1"/>
  <Method id="_2204" name="Extents" returns="_192" const="1" context="_117" access="public" mangled="_ZNK12btDbvtAabbMm7ExtentsEv" demangled="btDbvtAabbMm::Extents() const" location="f27:134" file="f27" line="134" endline="134" inline="1"/>
  <Method id="_2205" name="Mins" returns="_1806" const="1" context="_117" access="public" mangled="_ZNK12btDbvtAabbMm4MinsEv" demangled="btDbvtAabbMm::Mins() const" location="f27:135" file="f27" line="135" endline="135" inline="1"/>
  <Method id="_2206" name="Maxs" returns="_1806" const="1" context="_117" access="public" mangled="_ZNK12btDbvtAabbMm4MaxsEv" demangled="btDbvtAabbMm::Maxs() const" location="f27:136" file="f27" line="136" endline="136" inline="1"/>
  <Method id="_2207" name="FromCE" returns="_117" static="1" context="_117" access="public" mangled="_ZN12btDbvtAabbMm6FromCEERK9btVector3S2_" demangled="btDbvtAabbMm::FromCE(btVector3 const&amp;, btVector3 const&amp;)" location="f27:397" file="f27" line="397" endline="401" inline="1">
    <Argument name="c" type="_1806" location="f27:397" file="f27" line="397"/>
    <Argument name="e" type="_1806" location="f27:397" file="f27" line="397"/>
  </Method>
  <Method id="_2208" name="FromCR" returns="_117" static="1" context="_117" access="public" mangled="_ZN12btDbvtAabbMm6FromCRERK9btVector3f" demangled="btDbvtAabbMm::FromCR(btVector3 const&amp;, float)" location="f27:405" file="f27" line="405" endline="407" inline="1">
    <Argument name="c" type="_1806" location="f27:405" file="f27" line="405"/>
    <Argument name="r" type="_360" location="f27:405" file="f27" line="405"/>
  </Method>
  <Method id="_2209" name="FromMM" returns="_117" static="1" context="_117" access="public" mangled="_ZN12btDbvtAabbMm6FromMMERK9btVector3S2_" demangled="btDbvtAabbMm::FromMM(btVector3 const&amp;, btVector3 const&amp;)" location="f27:411" file="f27" line="411" endline="415" inline="1">
    <Argument name="mi" type="_1806" location="f27:411" file="f27" line="411"/>
    <Argument name="mx" type="_1806" location="f27:411" file="f27" line="411"/>
  </Method>
  <Method id="_2210" name="FromPoints" returns="_117" static="1" context="_117" access="public" mangled="_ZN12btDbvtAabbMm10FromPointsEPK9btVector3i" demangled="btDbvtAabbMm::FromPoints(btVector3 const*, int)" location="f27:419" file="f27" line="419" endline="428" inline="1">
    <Argument name="pts" type="_4229" location="f27:419" file="f27" line="419"/>
    <Argument name="n" type="_167" location="f27:419" file="f27" line="419"/>
  </Method>
  <Method id="_2211" name="FromPoints" returns="_117" static="1" context="_117" access="public" mangled="_ZN12btDbvtAabbMm10FromPointsEPPK9btVector3i" demangled="btDbvtAabbMm::FromPoints(btVector3 const**, int)" location="f27:432" file="f27" line="432" endline="441" inline="1">
    <Argument name="ppts" type="_8833" location="f27:432" file="f27" line="432"/>
    <Argument name="n" type="_167" location="f27:432" file="f27" line="432"/>
  </Method>
  <Method id="_2212" name="Expand" returns="_631" context="_117" access="public" mangled="_ZN12btDbvtAabbMm6ExpandERK9btVector3" demangled="btDbvtAabbMm::Expand(btVector3 const&amp;)" location="f27:445" file="f27" line="445" endline="447" inline="1">
    <Argument name="e" type="_1806" location="f27:445" file="f27" line="445"/>
  </Method>
  <Method id="_2213" name="SignedExpand" returns="_631" context="_117" access="public" mangled="_ZN12btDbvtAabbMm12SignedExpandERK9btVector3" demangled="btDbvtAabbMm::SignedExpand(btVector3 const&amp;)" location="f27:451" file="f27" line="451" endline="455" inline="1">
    <Argument name="e" type="_1806" location="f27:451" file="f27" line="451"/>
  </Method>
  <Method id="_2214" name="Contain" returns="_1816" const="1" context="_117" access="public" mangled="_ZNK12btDbvtAabbMm7ContainERKS_" demangled="btDbvtAabbMm::Contain(btDbvtAabbMm const&amp;) const" location="f27:459" file="f27" line="459" endline="466" inline="1">
    <Argument name="a" type="_2500" location="f27:459" file="f27" line="459"/>
  </Method>
  <Method id="_2215" name="Classify" returns="_167" const="1" context="_117" access="public" mangled="_ZNK12btDbvtAabbMm8ClassifyERK9btVector3fi" demangled="btDbvtAabbMm::Classify(btVector3 const&amp;, float, int) const" location="f27:470" file="f27" line="470" endline="494" inline="1">
    <Argument name="n" type="_1806" location="f27:470" file="f27" line="470"/>
    <Argument name="o" type="_360" location="f27:470" file="f27" line="470"/>
    <Argument name="s" type="_167" location="f27:470" file="f27" line="470"/>
  </Method>
  <Method id="_2216" name="ProjectMinimum" returns="_360" const="1" context="_117" access="public" mangled="_ZNK12btDbvtAabbMm14ProjectMinimumERK9btVector3j" demangled="btDbvtAabbMm::ProjectMinimum(btVector3 const&amp;, unsigned int) const" location="f27:498" file="f27" line="498" endline="504" inline="1">
    <Argument name="v" type="_1806" location="f27:498" file="f27" line="498"/>
    <Argument name="signs" type="_85" location="f27:498" file="f27" line="498"/>
  </Method>
  <Method id="_2217" name="tMins" returns="_2481" context="_117" access="public" mangled="_ZN12btDbvtAabbMm5tMinsEv" demangled="btDbvtAabbMm::tMins()" location="f27:164" file="f27" line="164" endline="164" inline="1"/>
  <Method id="_2218" name="tMaxs" returns="_2481" context="_117" access="public" mangled="_ZN12btDbvtAabbMm5tMaxsEv" demangled="btDbvtAabbMm::tMaxs()" location="f27:165" file="f27" line="165" endline="165" inline="1"/>
  <Method id="_2219" name="AddSpan" returns="_631" const="1" context="_117" access="private" mangled="_ZNK12btDbvtAabbMm7AddSpanERK9btVector3RfS3_" demangled="btDbvtAabbMm::AddSpan(btVector3 const&amp;, float&amp;, float&amp;) const" location="f27:508" file="f27" line="508" endline="516" inline="1">
    <Argument name="d" type="_1806" location="f27:508" file="f27" line="508"/>
    <Argument name="smi" type="_3266" location="f27:508" file="f27" line="508"/>
    <Argument name="smx" type="_3266" location="f27:508" file="f27" line="508"/>
  </Method>
  <Field id="_2220" name="m_value" type="_225" offset="0" context="_125" access="public" location="f49:111" file="f49" line="111"/>
  <Field id="_2221" name="m_pad" type="_8834" offset="16" context="_125" access="public" location="f49:112" file="f49" line="112"/>
  <Destructor id="_2222" name="btShortIntIndexData" artificial="1" throw="" context="_125" access="public" mangled="_ZN19btShortIntIndexDataD1Ev *INTERNAL* " demangled="btShortIntIndexData::~btShortIntIndexData()" location="f49:110" file="f49" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_2223" name="=" returns="_8835" artificial="1" throw="" context="_125" access="public" mangled="_ZN19btShortIntIndexDataaSERKS_" demangled="btShortIntIndexData::operator=(btShortIntIndexData const&amp;)" location="f49:110" file="f49" line="110" endline="110" inline="1">
    <Argument type="_8836" location="f49:110" file="f49" line="110"/>
  </OperatorMethod>
  <Constructor id="_2224" name="btShortIntIndexData" artificial="1" throw="" context="_125" access="public" mangled="_ZN19btShortIntIndexDataC1ERKS_ *INTERNAL* " demangled="btShortIntIndexData::btShortIntIndexData(btShortIntIndexData const&amp;)" location="f49:110" file="f49" line="110" endline="110" inline="1">
    <Argument type="_8836" location="f49:110" file="f49" line="110"/>
  </Constructor>
  <Constructor id="_2225" name="btShortIntIndexData" artificial="1" throw="" context="_125" access="public" mangled="_ZN19btShortIntIndexDataC1Ev *INTERNAL* " demangled="btShortIntIndexData::btShortIntIndexData()" location="f49:110" file="f49" line="110" inline="1"/>
  <CvQualifiedType id="_1908r" type="_1908" restrict="1"/>
  <PointerType id="_2227" type="_359" size="64" align="64"/>
  <OperatorMethod id="_2228" name="=" returns="_8837" artificial="1" throw="" context="_137" access="public" mangled="_ZN13btMotionStateaSERKS_" demangled="btMotionState::operator=(btMotionState const&amp;)" location="f28:24" file="f28" line="24" endline="24" inline="1">
    <Argument type="_8838" location="f28:24" file="f28" line="24"/>
  </OperatorMethod>
  <Constructor id="_2229" name="btMotionState" artificial="1" throw="" context="_137" access="public" mangled="_ZN13btMotionStateC1ERKS_ *INTERNAL* " demangled="btMotionState::btMotionState(btMotionState const&amp;)" location="f28:24" file="f28" line="24" endline="24" inline="1">
    <Argument type="_8838" location="f28:24" file="f28" line="24"/>
  </Constructor>
  <Constructor id="_2230" name="btMotionState" artificial="1" throw="" context="_137" access="public" mangled="_ZN13btMotionStateC1Ev *INTERNAL* " demangled="btMotionState::btMotionState()" location="f28:24" file="f28" line="24" endline="24" inline="1"/>
  <Destructor id="_2231" name="btMotionState" virtual="1" overrides="" context="_137" access="public" mangled="_ZN13btMotionStateD1Ev *INTERNAL* " demangled="btMotionState::~btMotionState()" location="f28:27" file="f28" line="27" endline="30" inline="1">
  </Destructor>
  <Method id="_2232" name="getWorldTransform" returns="_631" const="1" virtual="1" pure_virtual="1" overrides="" context="_137" access="public" mangled="_ZNK13btMotionState17getWorldTransformER11btTransform" demangled="btMotionState::getWorldTransform(btTransform&amp;) const" location="f28:32" file="f28" line="32" extern="1">
    <Argument name="worldTrans" type="_8820" location="f28:32" file="f28" line="32"/>
  </Method>
  <Method id="_2233" name="setWorldTransform" returns="_631" virtual="1" pure_virtual="1" overrides="" context="_137" access="public" mangled="_ZN13btMotionState17setWorldTransformERK11btTransform" demangled="btMotionState::setWorldTransform(btTransform const&amp;)" location="f28:35" file="f28" line="35" extern="1">
    <Argument name="worldTrans" type="_6832" location="f28:35" file="f28" line="35"/>
  </Method>
  <Field id="_2234" name="m_stridingMesh" type="_8777" offset="896" context="_138" access="private" location="f38:28" file="f38" line="28"/>
  <OperatorMethod id="_2235" name="=" returns="_8839" artificial="1" throw="" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapeaSERKS_" demangled="btConvexTriangleMeshShape::operator=(btConvexTriangleMeshShape const&amp;)" location="f38:26" file="f38" line="26" endline="26" inline="1">
    <Argument type="_8840" location="f38:26" file="f38" line="26"/>
  </OperatorMethod>
  <Constructor id="_2236" name="btConvexTriangleMeshShape" artificial="1" throw="" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapeC1ERKS_ *INTERNAL* " demangled="btConvexTriangleMeshShape::btConvexTriangleMeshShape(btConvexTriangleMeshShape const&amp;)" location="f38:26" file="f38" line="26" endline="26" inline="1">
    <Argument type="_8840" location="f38:26" file="f38" line="26"/>
  </Constructor>
  <OperatorMethod id="_2237" name="new" returns="_1068" static="1" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapenwEm" demangled="btConvexTriangleMeshShape::operator new(unsigned long)" location="f38:31" file="f38" line="31" endline="31" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f38:31" file="f38" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2238" name="delete" returns="_631" static="1" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapedlEPv" demangled="btConvexTriangleMeshShape::operator delete(void*)" location="f38:31" file="f38" line="31" endline="31" inline="1">
    <Argument name="ptr" type="_1068" location="f38:31" file="f38" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2239" name="new" returns="_1068" static="1" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapenwEmPv" demangled="btConvexTriangleMeshShape::operator new(unsigned long, void*)" location="f38:31" file="f38" line="31" endline="31" inline="1">
    <Argument type="_1155" location="f38:31" file="f38" line="31"/>
    <Argument name="ptr" type="_1068" location="f38:31" file="f38" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2240" name="delete" returns="_631" static="1" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapedlEPvS0_" demangled="btConvexTriangleMeshShape::operator delete(void*, void*)" location="f38:31" file="f38" line="31" inline="1">
    <Argument type="_1068" location="f38:31" file="f38" line="31"/>
    <Argument type="_1068" location="f38:31" file="f38" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2241" name="new []" returns="_1068" static="1" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapenaEm" demangled="btConvexTriangleMeshShape::operator new[](unsigned long)" location="f38:31" file="f38" line="31" endline="31" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f38:31" file="f38" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2242" name="delete []" returns="_631" static="1" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapedaEPv" demangled="btConvexTriangleMeshShape::operator delete[](void*)" location="f38:31" file="f38" line="31" endline="31" inline="1">
    <Argument name="ptr" type="_1068" location="f38:31" file="f38" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2243" name="new []" returns="_1068" static="1" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapenaEmPv" demangled="btConvexTriangleMeshShape::operator new[](unsigned long, void*)" location="f38:31" file="f38" line="31" endline="31" inline="1">
    <Argument type="_1155" location="f38:31" file="f38" line="31"/>
    <Argument name="ptr" type="_1068" location="f38:31" file="f38" line="31"/>
  </OperatorMethod>
  <OperatorMethod id="_2244" name="delete []" returns="_631" static="1" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapedaEPvS0_" demangled="btConvexTriangleMeshShape::operator delete[](void*, void*)" location="f38:31" file="f38" line="31" inline="1">
    <Argument type="_1068" location="f38:31" file="f38" line="31"/>
    <Argument type="_1068" location="f38:31" file="f38" line="31"/>
  </OperatorMethod>
  <Constructor id="_2245" name="btConvexTriangleMeshShape" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapeC1EP23btStridingMeshInterfaceb *INTERNAL* " demangled="btConvexTriangleMeshShape::btConvexTriangleMeshShape(btStridingMeshInterface*, bool)" location="f38:33" file="f38" line="33" extern="1">
    <Argument name="meshInterface" type="_8777" location="f38:33" file="f38" line="33"/>
    <Argument name="calcAabb" type="_1816" location="f38:33" file="f38" line="33" default="true"/>
  </Constructor>
  <Method id="_2246" name="getMeshInterface" returns="_8777" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShape16getMeshInterfaceEv" demangled="btConvexTriangleMeshShape::getMeshInterface()" location="f38:35" file="f38" line="35" endline="37" inline="1"/>
  <Method id="_2247" name="getMeshInterface" returns="_8841" const="1" context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape16getMeshInterfaceEv" demangled="btConvexTriangleMeshShape::getMeshInterface() const" location="f38:39" file="f38" line="39" endline="41" inline="1"/>
  <Method id="_2248" name="localGetSupportingVertex" returns="_192" const="1" virtual="1" overrides="_5267 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape24localGetSupportingVertexERK9btVector3" demangled="btConvexTriangleMeshShape::localGetSupportingVertex(btVector3 const&amp;) const" location="f38:44" file="f38" line="44" extern="1">
    <Argument name="vec" type="_1806" location="f38:44" file="f38" line="44"/>
  </Method>
  <Method id="_2249" name="localGetSupportingVertexWithoutMargin" returns="_192" const="1" virtual="1" overrides="_5411 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape37localGetSupportingVertexWithoutMarginERK9btVector3" demangled="btConvexTriangleMeshShape::localGetSupportingVertexWithoutMargin(btVector3 const&amp;) const" location="f38:45" file="f38" line="45" extern="1">
    <Argument name="vec" type="_1806" location="f38:45" file="f38" line="45"/>
  </Method>
  <Method id="_2250" name="batchedUnitVectorGetSupportingVertexWithoutMargin" returns="_631" const="1" virtual="1" overrides="_5412 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape49batchedUnitVectorGetSupportingVertexWithoutMarginEPK9btVector3PS0_i" demangled="btConvexTriangleMeshShape::batchedUnitVectorGetSupportingVertexWithoutMargin(btVector3 const*, btVector3*, int) const" location="f38:46" file="f38" line="46" extern="1">
    <Argument name="vectors" type="_4229" location="f38:46" file="f38" line="46"/>
    <Argument name="supportVerticesOut" type="_4232" location="f38:46" file="f38" line="46"/>
    <Argument name="numVectors" type="_167" location="f38:46" file="f38" line="46"/>
  </Method>
  <Method id="_2251" name="getName" returns="_1805" const="1" virtual="1" overrides="_2471 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape7getNameEv" demangled="btConvexTriangleMeshShape::getName() const" location="f38:49" file="f38" line="49" endline="49" inline="1"/>
  <Method id="_2252" name="getNumVertices" returns="_167" const="1" virtual="1" overrides="_5414 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape14getNumVerticesEv" demangled="btConvexTriangleMeshShape::getNumVertices() const" location="f38:51" file="f38" line="51" extern="1"/>
  <Method id="_2253" name="getNumEdges" returns="_167" const="1" virtual="1" overrides="_5415 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape11getNumEdgesEv" demangled="btConvexTriangleMeshShape::getNumEdges() const" location="f38:52" file="f38" line="52" extern="1"/>
  <Method id="_2254" name="getEdge" returns="_631" const="1" virtual="1" overrides="_5416 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape7getEdgeEiR9btVector3S1_" demangled="btConvexTriangleMeshShape::getEdge(int, btVector3&amp;, btVector3&amp;) const" location="f38:53" file="f38" line="53" extern="1">
    <Argument name="i" type="_167" location="f38:53" file="f38" line="53"/>
    <Argument name="pa" type="_2481" location="f38:53" file="f38" line="53"/>
    <Argument name="pb" type="_2481" location="f38:53" file="f38" line="53"/>
  </Method>
  <Method id="_2255" name="getVertex" returns="_631" const="1" virtual="1" overrides="_5417 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape9getVertexEiR9btVector3" demangled="btConvexTriangleMeshShape::getVertex(int, btVector3&amp;) const" location="f38:54" file="f38" line="54" extern="1">
    <Argument name="i" type="_167" location="f38:54" file="f38" line="54"/>
    <Argument name="vtx" type="_2481" location="f38:54" file="f38" line="54"/>
  </Method>
  <Method id="_2256" name="getNumPlanes" returns="_167" const="1" virtual="1" overrides="_5418 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape12getNumPlanesEv" demangled="btConvexTriangleMeshShape::getNumPlanes() const" location="f38:55" file="f38" line="55" extern="1"/>
  <Method id="_2257" name="getPlane" returns="_631" const="1" virtual="1" overrides="_5419 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape8getPlaneER9btVector3S1_i" demangled="btConvexTriangleMeshShape::getPlane(btVector3&amp;, btVector3&amp;, int) const" location="f38:56" file="f38" line="56" extern="1">
    <Argument name="planeNormal" type="_2481" location="f38:56" file="f38" line="56"/>
    <Argument name="planeSupport" type="_2481" location="f38:56" file="f38" line="56"/>
    <Argument name="i" type="_167" location="f38:56" file="f38" line="56"/>
  </Method>
  <Method id="_2258" name="isInside" returns="_1816" const="1" virtual="1" overrides="_5420 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape8isInsideERK9btVector3f" demangled="btConvexTriangleMeshShape::isInside(btVector3 const&amp;, float) const" location="f38:57" file="f38" line="57" extern="1">
    <Argument name="pt" type="_1806" location="f38:57" file="f38" line="57"/>
    <Argument name="tolerance" type="_360" location="f38:57" file="f38" line="57"/>
  </Method>
  <Method id="_2259" name="setLocalScaling" returns="_631" virtual="1" overrides="_5904 " context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShape15setLocalScalingERK9btVector3" demangled="btConvexTriangleMeshShape::setLocalScaling(btVector3 const&amp;)" location="f38:60" file="f38" line="60" extern="1">
    <Argument name="scaling" type="_1806" location="f38:60" file="f38" line="60"/>
  </Method>
  <Method id="_2260" name="getLocalScaling" returns="_1806" const="1" virtual="1" overrides="_5275 " context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape15getLocalScalingEv" demangled="btConvexTriangleMeshShape::getLocalScaling() const" location="f38:61" file="f38" line="61" extern="1"/>
  <Method id="_2261" name="calculatePrincipalAxisTransform" returns="_631" const="1" context="_138" access="public" mangled="_ZNK25btConvexTriangleMeshShape31calculatePrincipalAxisTransformER11btTransformR9btVector3Rf" demangled="btConvexTriangleMeshShape::calculatePrincipalAxisTransform(btTransform&amp;, btVector3&amp;, float&amp;) const" location="f38:68" file="f38" line="68" extern="1">
    <Argument name="principal" type="_8820" location="f38:68" file="f38" line="68"/>
    <Argument name="inertia" type="_2481" location="f38:68" file="f38" line="68"/>
    <Argument name="volume" type="_3266" location="f38:68" file="f38" line="68"/>
  </Method>
  <Destructor id="_2262" name="btConvexTriangleMeshShape" virtual="1" overrides="_5907 " artificial="1" context="_138" access="public" mangled="_ZN25btConvexTriangleMeshShapeD1Ev *INTERNAL* " demangled="btConvexTriangleMeshShape::~btConvexTriangleMeshShape()" location="f38:26" file="f38" line="26" endline="26" inline="1">
  </Destructor>
  <CvQualifiedType id="_1068r" type="_1068" restrict="1"/>
  <FundamentalType id="_2264" name="complex double" size="128" align="64"/>
  <PointerType id="_2265" type="_1807" size="64" align="64"/>
  <PointerType id="_2266" type="_1951c" size="64" align="64"/>
  <CvQualifiedType id="_2266r" type="_2266" restrict="1"/>
  <Field id="_2268" name="m_manifoldPtr" type="_4331" offset="64" context="_170" access="protected" location="f53:43" file="f53" line="43"/>
  <Field id="_2269" name="m_body0Wrap" type="_8843" offset="128" context="_170" access="protected" location="f53:45" file="f53" line="45"/>
  <Field id="_2270" name="m_body1Wrap" type="_8843" offset="192" context="_170" access="protected" location="f53:46" file="f53" line="46"/>
  <Field id="_2271" name="m_partId0" type="_167" offset="256" context="_170" access="protected" location="f53:47" file="f53" line="47"/>
  <Field id="_2272" name="m_partId1" type="_167" offset="288" context="_170" access="protected" location="f53:48" file="f53" line="48"/>
  <Field id="_2273" name="m_index0" type="_167" offset="320" context="_170" access="protected" location="f53:49" file="f53" line="49"/>
  <Field id="_2274" name="m_index1" type="_167" offset="352" context="_170" access="protected" location="f53:50" file="f53" line="50"/>
  <OperatorMethod id="_2275" name="=" returns="_8844" artificial="1" throw="" context="_170" access="public" mangled="_ZN16btManifoldResultaSERKS_" demangled="btManifoldResult::operator=(btManifoldResult const&amp;)" location="f53:40" file="f53" line="40" endline="40" inline="1">
    <Argument type="_8845" location="f53:40" file="f53" line="40"/>
  </OperatorMethod>
  <Constructor id="_2276" name="btManifoldResult" artificial="1" throw="" context="_170" access="public" mangled="_ZN16btManifoldResultC1ERKS_ *INTERNAL* " demangled="btManifoldResult::btManifoldResult(btManifoldResult const&amp;)" location="f53:40" file="f53" line="40" endline="40" inline="1">
    <Argument type="_8845" location="f53:40" file="f53" line="40"/>
  </Constructor>
  <Constructor id="_2277" name="btManifoldResult" explicit="1" context="_170" access="public" mangled="_ZN16btManifoldResultC1Ev *INTERNAL* " demangled="btManifoldResult::btManifoldResult()" location="f53:55" file="f53" line="55" endline="64" inline="1"/>
  <Constructor id="_2278" name="btManifoldResult" explicit="1" context="_170" access="public" mangled="_ZN16btManifoldResultC1EPK24btCollisionObjectWrapperS2_ *INTERNAL* " demangled="btManifoldResult::btManifoldResult(btCollisionObjectWrapper const*, btCollisionObjectWrapper const*)" location="f53:66" file="f53" line="66" extern="1">
    <Argument name="body0Wrap" type="_8843" location="f53:66" file="f53" line="66"/>
    <Argument name="body1Wrap" type="_8843" location="f53:66" file="f53" line="66"/>
  </Constructor>
  <Destructor id="_2279" name="btManifoldResult" virtual="1" overrides="_8846 " context="_170" access="public" mangled="_ZN16btManifoldResultD1Ev *INTERNAL* " demangled="btManifoldResult::~btManifoldResult()" location="f53:68" file="f53" line="68" endline="68" inline="1">
  </Destructor>
  <Method id="_2280" name="setPersistentManifold" returns="_631" context="_170" access="public" mangled="_ZN16btManifoldResult21setPersistentManifoldEP20btPersistentManifold" demangled="btManifoldResult::setPersistentManifold(btPersistentManifold*)" location="f53:70" file="f53" line="70" endline="72" inline="1">
    <Argument name="manifoldPtr" type="_4331" location="f53:70" file="f53" line="70"/>
  </Method>
  <Method id="_2281" name="getPersistentManifold" returns="_8847" const="1" context="_170" access="public" mangled="_ZNK16btManifoldResult21getPersistentManifoldEv" demangled="btManifoldResult::getPersistentManifold() const" location="f53:75" file="f53" line="75" endline="77" inline="1"/>
  <Method id="_2282" name="getPersistentManifold" returns="_4331" context="_170" access="public" mangled="_ZN16btManifoldResult21getPersistentManifoldEv" demangled="btManifoldResult::getPersistentManifold()" location="f53:79" file="f53" line="79" endline="81" inline="1"/>
  <Method id="_2283" name="setShapeIdentifiersA" returns="_631" virtual="1" overrides="_8848 " context="_170" access="public" mangled="_ZN16btManifoldResult20setShapeIdentifiersAEii" demangled="btManifoldResult::setShapeIdentifiersA(int, int)" location="f53:84" file="f53" line="84" endline="87" inline="1">
    <Argument name="partId0" type="_167" location="f53:84" file="f53" line="84"/>
    <Argument name="index0" type="_167" location="f53:84" file="f53" line="84"/>
  </Method>
  <Method id="_2284" name="setShapeIdentifiersB" returns="_631" virtual="1" overrides="_8849 " context="_170" access="public" mangled="_ZN16btManifoldResult20setShapeIdentifiersBEii" demangled="btManifoldResult::setShapeIdentifiersB(int, int)" location="f53:90" file="f53" line="90" endline="93" inline="1">
    <Argument name="partId1" type="_167" location="f53:90" file="f53" line="90"/>
    <Argument name="index1" type="_167" location="f53:90" file="f53" line="90"/>
  </Method>
  <Method id="_2285" name="addContactPoint" returns="_631" virtual="1" overrides="_8850 " context="_170" access="public" mangled="_ZN16btManifoldResult15addContactPointERK9btVector3S2_f" demangled="btManifoldResult::addContactPoint(btVector3 const&amp;, btVector3 const&amp;, float)" location="f53:97" file="f53" line="97" extern="1">
    <Argument name="normalOnBInWorld" type="_1806" location="f53:97" file="f53" line="97"/>
    <Argument name="pointInWorld" type="_1806" location="f53:97" file="f53" line="97"/>
    <Argument name="depth" type="_360" location="f53:97" file="f53" line="97"/>
  </Method>
  <Method id="_2286" name="refreshContactPoints" returns="_631" context="_170" access="public" mangled="_ZN16btManifoldResult20refreshContactPointsEv" demangled="btManifoldResult::refreshContactPoints()" location="f53:99" file="f53" line="99" endline="107" inline="1"/>
  <Method id="_2287" name="getBody0Wrap" returns="_8843" const="1" context="_170" access="public" mangled="_ZNK16btManifoldResult12getBody0WrapEv" demangled="btManifoldResult::getBody0Wrap() const" location="f53:116" file="f53" line="116" endline="118" inline="1"/>
  <Method id="_2288" name="getBody1Wrap" returns="_8843" const="1" context="_170" access="public" mangled="_ZNK16btManifoldResult12getBody1WrapEv" demangled="btManifoldResult::getBody1Wrap() const" location="f53:120" file="f53" line="120" endline="122" inline="1"/>
  <Method id="_2289" name="setBody0Wrap" returns="_631" context="_170" access="public" mangled="_ZN16btManifoldResult12setBody0WrapEPK24btCollisionObjectWrapper" demangled="btManifoldResult::setBody0Wrap(btCollisionObjectWrapper const*)" location="f53:125" file="f53" line="125" endline="127" inline="1">
    <Argument name="obj0Wrap" type="_8843" location="f53:125" file="f53" line="125"/>
  </Method>
  <Method id="_2290" name="setBody1Wrap" returns="_631" context="_170" access="public" mangled="_ZN16btManifoldResult12setBody1WrapEPK24btCollisionObjectWrapper" demangled="btManifoldResult::setBody1Wrap(btCollisionObjectWrapper const*)" location="f53:130" file="f53" line="130" endline="132" inline="1">
    <Argument name="obj1Wrap" type="_8843" location="f53:130" file="f53" line="130"/>
  </Method>
  <Method id="_2291" name="getBody0Internal" returns="_4254" const="1" context="_170" access="public" mangled="_ZNK16btManifoldResult16getBody0InternalEv" demangled="btManifoldResult::getBody0Internal() const" location="f53:135" file="f53" line="135" endline="137" inline="1"/>
  <Method id="_2292" name="getBody1Internal" returns="_4254" const="1" context="_170" access="public" mangled="_ZNK16btManifoldResult16getBody1InternalEv" demangled="btManifoldResult::getBody1Internal() const" location="f53:140" file="f53" line="140" endline="142" inline="1"/>
  <Method id="_2293" name="calculateCombinedRestitution" returns="_360" static="1" context="_170" access="public" mangled="_ZN16btManifoldResult28calculateCombinedRestitutionEPK17btCollisionObjectS2_" demangled="btManifoldResult::calculateCombinedRestitution(btCollisionObject const*, btCollisionObject const*)" location="f53:146" file="f53" line="146" extern="1">
    <Argument name="body0" type="_4254" location="f53:146" file="f53" line="146"/>
    <Argument name="body1" type="_4254" location="f53:146" file="f53" line="146"/>
  </Method>
  <Method id="_2294" name="calculateCombinedFriction" returns="_360" static="1" context="_170" access="public" mangled="_ZN16btManifoldResult25calculateCombinedFrictionEPK17btCollisionObjectS2_" demangled="btManifoldResult::calculateCombinedFriction(btCollisionObject const*, btCollisionObject const*)" location="f53:147" file="f53" line="147" extern="1">
    <Argument name="body0" type="_4254" location="f53:147" file="f53" line="147"/>
    <Argument name="body1" type="_4254" location="f53:147" file="f53" line="147"/>
  </Method>
  <Struct id="_2295" name="Result" context="_598" access="public" abstract="1" mangled="N36btDiscreteCollisionDetectorInterface6ResultE" demangled="btDiscreteCollisionDetectorInterface::Result" location="f77:33" file="f77" line="33" artificial="1" size="64" align="64" members="_8851 _8852 _8853 _8846 _8848 _8849 _8850 " bases=""/>
  <Field id="_2296" name="m_allocator" type="_568" offset="0" context="_173" access="private" location="f54:49" file="f54" line="49"/>
  <Field id="_2297" name="m_size" type="_167" offset="32" context="_173" access="private" location="f54:51" file="f54" line="51"/>
  <Field id="_2298" name="m_capacity" type="_167" offset="64" context="_173" access="private" location="f54:52" file="f54" line="52"/>
  <Field id="_2299" name="m_data" type="_4270" offset="128" context="_173" access="private" location="f54:53" file="f54" line="53"/>
  <Field id="_2300" name="m_ownsMemory" type="_1816" offset="192" context="_173" access="private" location="f54:55" file="f54" line="55"/>
  <Class id="_2301" name="less" context="_173" access="public" incomplete="1" mangled="N20btAlignedObjectArrayIP17btCollisionObjectE4lessE" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::less" location="f54:324" file="f54" line="324" artificial="1" align="8"/>
  <OperatorMethod id="_2302" name="=" returns="_8854" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectEaSERKS2_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::operator=(btAlignedObjectArray&lt;btCollisionObject*&gt; const&amp;)" location="f54:59" file="f54" line="59" inline="1">
    <Argument name="other" type="_8855" location="f54:59" file="f54" line="59"/>
  </OperatorMethod>
  <Method id="_2303" name="allocSize" returns="_167" context="_173" access="protected" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE9allocSizeEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::allocSize(int)" location="f54:70" file="f54" line="70" extern="1" inline="1">
    <Argument name="size" type="_167" location="f54:70" file="f54" line="70"/>
  </Method>
  <Method id="_2304" name="copy" returns="_631" const="1" context="_173" access="protected" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE4copyEiiPS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::copy(int, int, btCollisionObject**) const" location="f54:74" file="f54" line="74" extern="1" inline="1">
    <Argument name="start" type="_167" location="f54:74" file="f54" line="74"/>
    <Argument name="end" type="_167" location="f54:74" file="f54" line="74"/>
    <Argument name="dest" type="_4270" location="f54:74" file="f54" line="74"/>
  </Method>
  <Method id="_2305" name="init" returns="_631" context="_173" access="protected" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE4initEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::init()" location="f54:85" file="f54" line="85" extern="1" inline="1"/>
  <Method id="_2306" name="destroy" returns="_631" context="_173" access="protected" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE7destroyEii" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::destroy(int, int)" location="f54:93" file="f54" line="93" extern="1" inline="1">
    <Argument name="first" type="_167" location="f54:93" file="f54" line="93"/>
    <Argument name="last" type="_167" location="f54:93" file="f54" line="93"/>
  </Method>
  <Method id="_2307" name="allocate" returns="_1068" context="_173" access="protected" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE8allocateEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::allocate(int)" location="f54:102" file="f54" line="102" extern="1" inline="1">
    <Argument name="size" type="_167" location="f54:102" file="f54" line="102"/>
  </Method>
  <Method id="_2308" name="deallocate" returns="_631" context="_173" access="protected" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE10deallocateEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::deallocate()" location="f54:109" file="f54" line="109" extern="1" inline="1"/>
  <Constructor id="_2309" name="btAlignedObjectArray" explicit="1" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectEC1Ev *INTERNAL* " demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::btAlignedObjectArray()" location="f54:126" file="f54" line="126" extern="1" inline="1"/>
  <Destructor id="_2310" name="btAlignedObjectArray" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectED1Ev *INTERNAL* " demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::~btAlignedObjectArray()" location="f54:131" file="f54" line="131" inline="1">
  </Destructor>
  <Constructor id="_2311" name="btAlignedObjectArray" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectEC1ERKS2_ *INTERNAL* " demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::btAlignedObjectArray(btAlignedObjectArray&lt;btCollisionObject*&gt; const&amp;)" location="f54:137" file="f54" line="137" inline="1">
    <Argument name="otherArray" type="_8855" location="f54:137" file="f54" line="137"/>
  </Constructor>
  <Method id="_2312" name="size" returns="_167" const="1" context="_173" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE4sizeEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::size() const" location="f54:149" file="f54" line="149" inline="1"/>
  <Method id="_2313" name="at" returns="_4268" const="1" context="_173" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE2atEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::at(int) const" location="f54:154" file="f54" line="154" extern="1" inline="1">
    <Argument name="n" type="_167" location="f54:154" file="f54" line="154"/>
  </Method>
  <Method id="_2314" name="at" returns="_4272" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE2atEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::at(int)" location="f54:161" file="f54" line="161" extern="1" inline="1">
    <Argument name="n" type="_167" location="f54:161" file="f54" line="161"/>
  </Method>
  <OperatorMethod id="_2315" name="[]" returns="_4268" const="1" context="_173" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectEixEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::operator[](int) const" location="f54:168" file="f54" line="168" extern="1" inline="1">
    <Argument name="n" type="_167" location="f54:168" file="f54" line="168"/>
  </OperatorMethod>
  <OperatorMethod id="_2316" name="[]" returns="_4272" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectEixEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::operator[](int)" location="f54:175" file="f54" line="175" extern="1" inline="1">
    <Argument name="n" type="_167" location="f54:175" file="f54" line="175"/>
  </OperatorMethod>
  <Method id="_2317" name="clear" returns="_631" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE5clearEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::clear()" location="f54:184" file="f54" line="184" extern="1" inline="1"/>
  <Method id="_2318" name="pop_back" returns="_631" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE8pop_backEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::pop_back()" location="f54:193" file="f54" line="193" extern="1" inline="1"/>
  <Method id="_2319" name="resizeNoInitialize" returns="_631" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE18resizeNoInitializeEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::resizeNoInitialize(int)" location="f54:203" file="f54" line="203" extern="1" inline="1">
    <Argument name="newsize" type="_167" location="f54:203" file="f54" line="203"/>
  </Method>
  <Method id="_2320" name="resize" returns="_631" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE6resizeEiRKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::resize(int, btCollisionObject* const&amp;)" location="f54:220" file="f54" line="220" extern="1" inline="1">
    <Argument name="newsize" type="_167" location="f54:220" file="f54" line="220"/>
    <Argument name="fillData" type="_4268" location="f54:220" file="f54" line="220" default="T()"/>
  </Method>
  <Method id="_2321" name="expandNonInitializing" returns="_4272" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE21expandNonInitializingEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::expandNonInitializing()" location="f54:247" file="f54" line="247" extern="1" inline="1"/>
  <Method id="_2322" name="expand" returns="_4272" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE6expandERKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::expand(btCollisionObject* const&amp;)" location="f54:260" file="f54" line="260" extern="1" inline="1">
    <Argument name="fillValue" type="_4268" location="f54:260" file="f54" line="260" default="T()"/>
  </Method>
  <Method id="_2323" name="push_back" returns="_631" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE9push_backERKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::push_back(btCollisionObject* const&amp;)" location="f54:276" file="f54" line="276" extern="1" inline="1">
    <Argument name="_Val" type="_4268" location="f54:276" file="f54" line="276"/>
  </Method>
  <Method id="_2324" name="capacity" returns="_167" const="1" context="_173" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE8capacityEv" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::capacity() const" location="f54:295" file="f54" line="295" extern="1" inline="1"/>
  <Method id="_2325" name="reserve" returns="_631" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE7reserveEi" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::reserve(int)" location="f54:300" file="f54" line="300" extern="1" inline="1">
    <Argument name="_Count" type="_167" location="f54:300" file="f54" line="300"/>
  </Method>
  <Method id="_2326" name="swap" returns="_631" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE4swapEii" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::swap(int, int)" location="f54:407" file="f54" line="407" extern="1" inline="1">
    <Argument name="index0" type="_167" location="f54:407" file="f54" line="407"/>
    <Argument name="index1" type="_167" location="f54:407" file="f54" line="407"/>
  </Method>
  <Method id="_2327" name="findBinarySearch" returns="_167" const="1" context="_173" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE16findBinarySearchERKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::findBinarySearch(btCollisionObject* const&amp;) const" location="f54:446" file="f54" line="446" extern="1" inline="1">
    <Argument name="key" type="_4268" location="f54:446" file="f54" line="446"/>
  </Method>
  <Method id="_2328" name="findLinearSearch" returns="_167" const="1" context="_173" access="public" mangled="_ZNK20btAlignedObjectArrayIP17btCollisionObjectE16findLinearSearchERKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::findLinearSearch(btCollisionObject* const&amp;) const" location="f54:465" file="f54" line="465" extern="1" inline="1">
    <Argument name="key" type="_4268" location="f54:465" file="f54" line="465"/>
  </Method>
  <Method id="_2329" name="remove" returns="_631" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE6removeERKS1_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::remove(btCollisionObject* const&amp;)" location="f54:481" file="f54" line="481" extern="1" inline="1">
    <Argument name="key" type="_4268" location="f54:481" file="f54" line="481"/>
  </Method>
  <Method id="_2330" name="initializeFromBuffer" returns="_631" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE20initializeFromBufferEPvii" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::initializeFromBuffer(void*, int, int)" location="f54:493" file="f54" line="493" extern="1" inline="1">
    <Argument name="buffer" type="_1068" location="f54:493" file="f54" line="493"/>
    <Argument name="size" type="_167" location="f54:493" file="f54" line="493"/>
    <Argument name="capacity" type="_167" location="f54:493" file="f54" line="493"/>
  </Method>
  <Method id="_2331" name="copyFromArray" returns="_631" context="_173" access="public" mangled="_ZN20btAlignedObjectArrayIP17btCollisionObjectE13copyFromArrayERKS2_" demangled="btAlignedObjectArray&lt;btCollisionObject*&gt;::copyFromArray(btAlignedObjectArray&lt;btCollisionObject*&gt; const&amp;)" location="f54:502" file="f54" line="502" extern="1" inline="1">
    <Argument name="otherArray" type="_8855" location="f54:502" file="f54" line="502"/>
  </Method>
  <Field id="_2332" name="m_allocator" type="_536" offset="0" context="_176" access="private" location="f54:49" file="f54" line="49"/>
  <Field id="_2333" name="m_size" type="_167" offset="32" context="_176" access="private" location="f54:51" file="f54" line="51"/>
  <Field id="_2334" name="m_capacity" type="_167" offset="64" context="_176" access="private" location="f54:52" file="f54" line="52"/>
  <Field id="_2335" name="m_data" type="_3661" offset="128" context="_176" access="private" location="f54:53" file="f54" line="53"/>
  <Field id="_2336" name="m_ownsMemory" type="_1816" offset="192" context="_176" access="private" location="f54:55" file="f54" line="55"/>
  <Class id="_2337" name="less" context="_176" access="public" incomplete="1" mangled="N20btAlignedObjectArrayI18btSolverConstraintE4lessE" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::less" location="f54:324" file="f54" line="324" artificial="1" align="8"/>
  <OperatorMethod id="_2338" name="=" returns="_8856" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintEaSERKS1_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::operator=(btAlignedObjectArray&lt;btSolverConstraint&gt; const&amp;)" location="f54:59" file="f54" line="59" inline="1">
    <Argument name="other" type="_8857" location="f54:59" file="f54" line="59"/>
  </OperatorMethod>
  <Method id="_2339" name="allocSize" returns="_167" context="_176" access="protected" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE9allocSizeEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::allocSize(int)" location="f54:70" file="f54" line="70" extern="1" inline="1">
    <Argument name="size" type="_167" location="f54:70" file="f54" line="70"/>
  </Method>
  <Method id="_2340" name="copy" returns="_631" const="1" context="_176" access="protected" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE4copyEiiPS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::copy(int, int, btSolverConstraint*) const" location="f54:74" file="f54" line="74" extern="1" inline="1">
    <Argument name="start" type="_167" location="f54:74" file="f54" line="74"/>
    <Argument name="end" type="_167" location="f54:74" file="f54" line="74"/>
    <Argument name="dest" type="_3661" location="f54:74" file="f54" line="74"/>
  </Method>
  <Method id="_2341" name="init" returns="_631" context="_176" access="protected" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE4initEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::init()" location="f54:85" file="f54" line="85" extern="1" inline="1"/>
  <Method id="_2342" name="destroy" returns="_631" context="_176" access="protected" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE7destroyEii" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::destroy(int, int)" location="f54:93" file="f54" line="93" extern="1" inline="1">
    <Argument name="first" type="_167" location="f54:93" file="f54" line="93"/>
    <Argument name="last" type="_167" location="f54:93" file="f54" line="93"/>
  </Method>
  <Method id="_2343" name="allocate" returns="_1068" context="_176" access="protected" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE8allocateEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::allocate(int)" location="f54:102" file="f54" line="102" extern="1" inline="1">
    <Argument name="size" type="_167" location="f54:102" file="f54" line="102"/>
  </Method>
  <Method id="_2344" name="deallocate" returns="_631" context="_176" access="protected" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE10deallocateEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::deallocate()" location="f54:109" file="f54" line="109" extern="1" inline="1"/>
  <Constructor id="_2345" name="btAlignedObjectArray" explicit="1" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintEC1Ev *INTERNAL* " demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::btAlignedObjectArray()" location="f54:126" file="f54" line="126" extern="1" inline="1"/>
  <Destructor id="_2346" name="btAlignedObjectArray" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintED1Ev *INTERNAL* " demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::~btAlignedObjectArray()" location="f54:131" file="f54" line="131" inline="1">
  </Destructor>
  <Constructor id="_2347" name="btAlignedObjectArray" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintEC1ERKS1_ *INTERNAL* " demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::btAlignedObjectArray(btAlignedObjectArray&lt;btSolverConstraint&gt; const&amp;)" location="f54:137" file="f54" line="137" inline="1">
    <Argument name="otherArray" type="_8857" location="f54:137" file="f54" line="137"/>
  </Constructor>
  <Method id="_2348" name="size" returns="_167" const="1" context="_176" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE4sizeEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::size() const" location="f54:149" file="f54" line="149" extern="1" inline="1"/>
  <Method id="_2349" name="at" returns="_3659" const="1" context="_176" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE2atEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::at(int) const" location="f54:154" file="f54" line="154" extern="1" inline="1">
    <Argument name="n" type="_167" location="f54:154" file="f54" line="154"/>
  </Method>
  <Method id="_2350" name="at" returns="_3663" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE2atEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::at(int)" location="f54:161" file="f54" line="161" extern="1" inline="1">
    <Argument name="n" type="_167" location="f54:161" file="f54" line="161"/>
  </Method>
  <OperatorMethod id="_2351" name="[]" returns="_3659" const="1" context="_176" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintEixEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::operator[](int) const" location="f54:168" file="f54" line="168" extern="1" inline="1">
    <Argument name="n" type="_167" location="f54:168" file="f54" line="168"/>
  </OperatorMethod>
  <OperatorMethod id="_2352" name="[]" returns="_3663" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintEixEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::operator[](int)" location="f54:175" file="f54" line="175" extern="1" inline="1">
    <Argument name="n" type="_167" location="f54:175" file="f54" line="175"/>
  </OperatorMethod>
  <Method id="_2353" name="clear" returns="_631" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE5clearEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::clear()" location="f54:184" file="f54" line="184" extern="1" inline="1"/>
  <Method id="_2354" name="pop_back" returns="_631" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE8pop_backEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::pop_back()" location="f54:193" file="f54" line="193" extern="1" inline="1"/>
  <Method id="_2355" name="resizeNoInitialize" returns="_631" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE18resizeNoInitializeEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::resizeNoInitialize(int)" location="f54:203" file="f54" line="203" extern="1" inline="1">
    <Argument name="newsize" type="_167" location="f54:203" file="f54" line="203"/>
  </Method>
  <Method id="_2356" name="resize" returns="_631" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE6resizeEiRKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::resize(int, btSolverConstraint const&amp;)" location="f54:220" file="f54" line="220" extern="1" inline="1">
    <Argument name="newsize" type="_167" location="f54:220" file="f54" line="220"/>
    <Argument name="fillData" type="_3659" location="f54:220" file="f54" line="220" default="T()"/>
  </Method>
  <Method id="_2357" name="expandNonInitializing" returns="_3663" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE21expandNonInitializingEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::expandNonInitializing()" location="f54:247" file="f54" line="247" extern="1" inline="1"/>
  <Method id="_2358" name="expand" returns="_3663" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE6expandERKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::expand(btSolverConstraint const&amp;)" location="f54:260" file="f54" line="260" extern="1" inline="1">
    <Argument name="fillValue" type="_3659" location="f54:260" file="f54" line="260" default="T()"/>
  </Method>
  <Method id="_2359" name="push_back" returns="_631" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE9push_backERKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::push_back(btSolverConstraint const&amp;)" location="f54:276" file="f54" line="276" extern="1" inline="1">
    <Argument name="_Val" type="_3659" location="f54:276" file="f54" line="276"/>
  </Method>
  <Method id="_2360" name="capacity" returns="_167" const="1" context="_176" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE8capacityEv" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::capacity() const" location="f54:295" file="f54" line="295" extern="1" inline="1"/>
  <Method id="_2361" name="reserve" returns="_631" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE7reserveEi" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::reserve(int)" location="f54:300" file="f54" line="300" extern="1" inline="1">
    <Argument name="_Count" type="_167" location="f54:300" file="f54" line="300"/>
  </Method>
  <Method id="_2362" name="swap" returns="_631" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE4swapEii" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::swap(int, int)" location="f54:407" file="f54" line="407" extern="1" inline="1">
    <Argument name="index0" type="_167" location="f54:407" file="f54" line="407"/>
    <Argument name="index1" type="_167" location="f54:407" file="f54" line="407"/>
  </Method>
  <Method id="_2363" name="findBinarySearch" returns="_167" const="1" context="_176" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE16findBinarySearchERKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::findBinarySearch(btSolverConstraint const&amp;) const" location="f54:446" file="f54" line="446" extern="1" inline="1">
    <Argument name="key" type="_3659" location="f54:446" file="f54" line="446"/>
  </Method>
  <Method id="_2364" name="findLinearSearch" returns="_167" const="1" context="_176" access="public" mangled="_ZNK20btAlignedObjectArrayI18btSolverConstraintE16findLinearSearchERKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::findLinearSearch(btSolverConstraint const&amp;) const" location="f54:465" file="f54" line="465" extern="1" inline="1">
    <Argument name="key" type="_3659" location="f54:465" file="f54" line="465"/>
  </Method>
  <Method id="_2365" name="remove" returns="_631" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE6removeERKS0_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::remove(btSolverConstraint const&amp;)" location="f54:481" file="f54" line="481" extern="1" inline="1">
    <Argument name="key" type="_3659" location="f54:481" file="f54" line="481"/>
  </Method>
  <Method id="_2366" name="initializeFromBuffer" returns="_631" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE20initializeFromBufferEPvii" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::initializeFromBuffer(void*, int, int)" location="f54:493" file="f54" line="493" extern="1" inline="1">
    <Argument name="buffer" type="_1068" location="f54:493" file="f54" line="493"/>
    <Argument name="size" type="_167" location="f54:493" file="f54" line="493"/>
    <Argument name="capacity" type="_167" location="f54:493" file="f54" line="493"/>
  </Method>
  <Method id="_2367" name="copyFromArray" returns="_631" context="_176" access="public" mangled="_ZN20btAlignedObjectArrayI18btSolverConstraintE13copyFromArrayERKS1_" demangled="btAlignedObjectArray&lt;btSolverConstraint&gt;::copyFromArray(btAlignedObjectArray&lt;btSolverConstraint&gt; const&amp;)" location="f54:502" file="f54" line="502" extern="1" inline="1">
    <Argument name="otherArray" type="_8857" location="f54:502" file="f54" line="502"/>
  </Method>
  <Field id="_2368" name="m_floats" type="_8858" offset="0" context="_192" access="public" location="f3:107" file="f3" line="107"/>
  <Destructor id="_2369" name="btVector3" artificial="1" throw="" context="_192" access="public" mangled="_ZN9btVector3D1Ev *INTERNAL* " demangled="btVector3::~btVector3()" location="f3:79" file="f3" line="79" endline="79" inline="1">
  </Destructor>
  <OperatorMethod id="_2370" name="=" returns="_2481" artificial="1" throw="" context="_192" access="public" mangled="_ZN9btVector3aSERKS_" demangled="btVector3::operator=(btVector3 const&amp;)" location="f3:79" file="f3" line="79" endline="79" inline="1">
    <Argument type="_1806" location="f3:79" file="f3" line="79"/>
  </OperatorMethod>
  <Constructor id="_2371" name="btVector3" artificial="1" throw="" context="_192" access="public" mangled="_ZN9btVector3C1ERKS_ *INTERNAL* " demangled="btVector3::btVector3(btVector3 const&amp;)" location="f3:79" file="f3" line="79" endline="79" inline="1">
    <Argument type="_1806" location="f3:79" file="f3" line="79"/>
  </Constructor>
  <OperatorMethod id="_2372" name="new" returns="_1068" static="1" context="_192" access="public" mangled="_ZN9btVector3nwEm" demangled="btVector3::operator new(unsigned long)" location="f3:82" file="f3" line="82" endline="82" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f3:82" file="f3" line="82"/>
  </OperatorMethod>
  <OperatorMethod id="_2373" name="delete" returns="_631" static="1" context="_192" access="public" mangled="_ZN9btVector3dlEPv" demangled="btVector3::operator delete(void*)" location="f3:82" file="f3" line="82" endline="82" inline="1">
    <Argument name="ptr" type="_1068" location="f3:82" file="f3" line="82"/>
  </OperatorMethod>
  <OperatorMethod id="_2374" name="new" returns="_1068" static="1" context="_192" access="public" mangled="_ZN9btVector3nwEmPv" demangled="btVector3::operator new(unsigned long, void*)" location="f3:82" file="f3" line="82" endline="82" inline="1">
    <Argument type="_1155" location="f3:82" file="f3" line="82"/>
    <Argument name="ptr" type="_1068" location="f3:82" file="f3" line="82"/>
  </OperatorMethod>
  <OperatorMethod id="_2375" name="delete" returns="_631" static="1" context="_192" access="public" mangled="_ZN9btVector3dlEPvS0_" demangled="btVector3::operator delete(void*, void*)" location="f3:82" file="f3" line="82" inline="1">
    <Argument type="_1068" location="f3:82" file="f3" line="82"/>
    <Argument type="_1068" location="f3:82" file="f3" line="82"/>
  </OperatorMethod>
  <OperatorMethod id="_2376" name="new []" returns="_1068" static="1" context="_192" access="public" mangled="_ZN9btVector3naEm" demangled="btVector3::operator new[](unsigned long)" location="f3:82" file="f3" line="82" endline="82" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f3:82" file="f3" line="82"/>
  </OperatorMethod>
  <OperatorMethod id="_2377" name="delete []" returns="_631" static="1" context="_192" access="public" mangled="_ZN9btVector3daEPv" demangled="btVector3::operator delete[](void*)" location="f3:82" file="f3" line="82" endline="82" inline="1">
    <Argument name="ptr" type="_1068" location="f3:82" file="f3" line="82"/>
  </OperatorMethod>
  <OperatorMethod id="_2378" name="new []" returns="_1068" static="1" context="_192" access="public" mangled="_ZN9btVector3naEmPv" demangled="btVector3::operator new[](unsigned long, void*)" location="f3:82" file="f3" line="82" endline="82" inline="1">
    <Argument type="_1155" location="f3:82" file="f3" line="82"/>
    <Argument name="ptr" type="_1068" location="f3:82" file="f3" line="82"/>
  </OperatorMethod>
  <OperatorMethod id="_2379" name="delete []" returns="_631" static="1" context="_192" access="public" mangled="_ZN9btVector3daEPvS0_" demangled="btVector3::operator delete[](void*, void*)" location="f3:82" file="f3" line="82" inline="1">
    <Argument type="_1068" location="f3:82" file="f3" line="82"/>
    <Argument type="_1068" location="f3:82" file="f3" line="82"/>
  </OperatorMethod>
  <Constructor id="_2380" name="btVector3" explicit="1" context="_192" access="public" mangled="_ZN9btVector3C1Ev *INTERNAL* " demangled="btVector3::btVector3()" location="f3:114" file="f3" line="114" inline="1"/>
  <Constructor id="_2381" name="btVector3" explicit="1" context="_192" access="public" mangled="_ZN9btVector3C1ERKfS1_S1_ *INTERNAL* " demangled="btVector3::btVector3(float const&amp;, float const&amp;, float const&amp;)" location="f3:126" file="f3" line="126" endline="131" inline="1">
    <Argument name="_x" type="_3265" location="f3:126" file="f3" line="126"/>
    <Argument name="_y" type="_3265" location="f3:126" file="f3" line="126"/>
    <Argument name="_z" type="_3265" location="f3:126" file="f3" line="126"/>
  </Constructor>
  <OperatorMethod id="_2382" name="+=" returns="_2481" context="_192" access="public" mangled="_ZN9btVector3pLERKS_" demangled="btVector3::operator+=(btVector3 const&amp;)" location="f3:159" file="f3" line="159" endline="170" inline="1">
    <Argument name="v" type="_1806" location="f3:159" file="f3" line="159"/>
  </OperatorMethod>
  <OperatorMethod id="_2383" name="-=" returns="_2481" context="_192" access="public" mangled="_ZN9btVector3mIERKS_" demangled="btVector3::operator-=(btVector3 const&amp;)" location="f3:176" file="f3" line="176" endline="187" inline="1">
    <Argument name="v" type="_1806" location="f3:176" file="f3" line="176"/>
  </OperatorMethod>
  <OperatorMethod id="_2384" name="*=" returns="_2481" context="_192" access="public" mangled="_ZN9btVector3mLERKf" demangled="btVector3::operator*=(float const&amp;)" location="f3:192" file="f3" line="192" endline="205" inline="1">
    <Argument name="s" type="_3265" location="f3:192" file="f3" line="192"/>
  </OperatorMethod>
  <OperatorMethod id="_2385" name="/=" returns="_2481" context="_192" access="public" mangled="_ZN9btVector3dVERKf" demangled="btVector3::operator/=(float const&amp;)" location="f3:210" file="f3" line="210" endline="224" inline="1">
    <Argument name="s" type="_3265" location="f3:210" file="f3" line="210"/>
  </OperatorMethod>
  <Method id="_2386" name="dot" returns="_360" const="1" context="_192" access="public" mangled="_ZNK9btVector33dotERKS_" demangled="btVector3::dot(btVector3 const&amp;) const" location="f3:230" file="f3" line="230" endline="247" inline="1">
    <Argument name="v" type="_1806" location="f3:230" file="f3" line="230"/>
  </Method>
  <Method id="_2387" name="length2" returns="_360" const="1" context="_192" access="public" mangled="_ZNK9btVector37length2Ev" demangled="btVector3::length2() const" location="f3:252" file="f3" line="252" endline="254" inline="1"/>
  <Method id="_2388" name="length" returns="_360" const="1" context="_192" access="public" mangled="_ZNK9btVector36lengthEv" demangled="btVector3::length() const" location="f3:258" file="f3" line="258" endline="260" inline="1"/>
  <Method id="_2389" name="distance2" returns="_360" const="1" context="_192" access="public" mangled="_ZNK9btVector39distance2ERKS_" demangled="btVector3::distance2(btVector3 const&amp;) const" location="f3:926" file="f3" line="926" endline="928" inline="1">
    <Argument name="v" type="_1806" location="f3:926" file="f3" line="926"/>
  </Method>
  <Method id="_2390" name="distance" returns="_360" const="1" context="_192" access="public" mangled="_ZNK9btVector38distanceERKS_" demangled="btVector3::distance(btVector3 const&amp;) const" location="f3:931" file="f3" line="931" endline="933" inline="1">
    <Argument name="v" type="_1806" location="f3:931" file="f3" line="931"/>
  </Method>
  <Method id="_2391" name="safeNormalize" returns="_2481" context="_192" access="public" mangled="_ZN9btVector313safeNormalizeEv" demangled="btVector3::safeNormalize()" location="f3:271" file="f3" line="271" endline="281" inline="1"/>
  <Method id="_2392" name="normalize" returns="_2481" context="_192" access="public" mangled="_ZN9btVector39normalizeEv" demangled="btVector3::normalize()" location="f3:286" file="f3" line="286" endline="324" inline="1"/>
  <Method id="_2393" name="normalized" returns="_192" const="1" context="_192" access="public" mangled="_ZNK9btVector310normalizedEv" demangled="btVector3::normalized() const" location="f3:936" file="f3" line="936" endline="943" inline="1"/>
  <Method id="_2394" name="rotate" returns="_192" const="1" context="_192" access="public" mangled="_ZNK9btVector36rotateERKS_f" demangled="btVector3::rotate(btVector3 const&amp;, float) const" location="f3:947" file="f3" line="947" endline="985" inline="1">
    <Argument name="wAxis" type="_1806" location="f3:947" file="f3" line="947"/>
    <Argument name="_angle" type="_360c" location="f3:947" file="f3" line="947"/>
  </Method>
  <Method id="_2395" name="angle" returns="_360" const="1" context="_192" access="public" mangled="_ZNK9btVector35angleERKS_" demangled="btVector3::angle(btVector3 const&amp;) const" location="f3:338" file="f3" line="338" endline="342" inline="1">
    <Argument name="v" type="_1806" location="f3:338" file="f3" line="338"/>
  </Method>
  <Method id="_2396" name="absolute" returns="_192" const="1" context="_192" access="public" mangled="_ZNK9btVector38absoluteEv" demangled="btVector3::absolute() const" location="f3:346" file="f3" line="346" endline="356" inline="1"/>
  <Method id="_2397" name="cross" returns="_192" const="1" context="_192" access="public" mangled="_ZNK9btVector35crossERKS_" demangled="btVector3::cross(btVector3 const&amp;) const" location="f3:362" file="f3" line="362" endline="397" inline="1">
    <Argument name="v" type="_1806" location="f3:362" file="f3" line="362"/>
  </Method>
  <Method id="_2398" name="triple" returns="_360" const="1" context="_192" access="public" mangled="_ZNK9btVector36tripleERKS_S1_" demangled="btVector3::triple(btVector3 const&amp;, btVector3 const&amp;) const" location="f3:401" file="f3" line="401" endline="447" inline="1">
    <Argument name="v1" type="_1806" location="f3:401" file="f3" line="401"/>
    <Argument name="v2" type="_1806" location="f3:401" file="f3" line="401"/>
  </Method>
  <Method id="_2399" name="minAxis" returns="_167" const="1" context="_192" access="public" mangled="_ZNK9btVector37minAxisEv" demangled="btVector3::minAxis() const" location="f3:453" file="f3" line="453" endline="455" inline="1"/>
  <Method id="_2400" name="maxAxis" returns="_167" const="1" context="_192" access="public" mangled="_ZNK9btVector37maxAxisEv" demangled="btVector3::maxAxis() const" location="f3:460" file="f3" line="460" endline="462" inline="1"/>
  <Method id="_2401" name="furthestAxis" returns="_167" const="1" context="_192" access="public" mangled="_ZNK9btVector312furthestAxisEv" demangled="btVector3::furthestAxis() const" location="f3:465" file="f3" line="465" endline="467" inline="1"/>
  <Method id="_2402" name="closestAxis" returns="_167" const="1" context="_192" access="public" mangled="_ZNK9btVector311closestAxisEv" demangled="btVector3::closestAxis() const" location="f3:470" file="f3" line="470" endline="472" inline="1"/>
  <Method id="_2403" name="setInterpolate3" returns="_631" context="_192" access="public" mangled="_ZN9btVector315setInterpolate3ERKS_S1_f" demangled="btVector3::setInterpolate3(btVector3 const&amp;, btVector3 const&amp;, float)" location="f3:476" file="f3" line="476" endline="496" inline="1">
    <Argument name="v0" type="_1806" location="f3:476" file="f3" line="476"/>
    <Argument name="v1" type="_1806" location="f3:476" file="f3" line="476"/>
    <Argument name="rt" type="_360" location="f3:476" file="f3" line="476"/>
  </Method>
  <Method id="_2404" name="lerp" returns="_192" const="1" context="_192" access="public" mangled="_ZNK9btVector34lerpERKS_RKf" demangled="btVector3::lerp(btVector3 const&amp;, float const&amp;) const" location="f3:505" file="f3" line="505" endline="525" inline="1">
    <Argument name="v" type="_1806" location="f3:505" file="f3" line="505"/>
    <Argument name="t" type="_3265" location="f3:505" file="f3" line="505"/>
  </Method>
  <OperatorMethod id="_2405" name="*=" returns="_2481" context="_192" access="public" mangled="_ZN9btVector3mLERKS_" demangled="btVector3::operator*=(btVector3 const&amp;)" location="f3:531" file="f3" line="531" endline="542" inline="1">
    <Argument name="v" type="_1806" location="f3:531" file="f3" line="531"/>
  </OperatorMethod>
  <Method id="_2406" name="getX" returns="_3265" const="1" context="_192" access="public" mangled="_ZNK9btVector34getXEv" demangled="btVector3::getX() const" location="f3:546" file="f3" line="546" endline="546" inline="1"/>
  <Method id="_2407" name="getY" returns="_3265" const="1" context="_192" access="public" mangled="_ZNK9btVector34getYEv" demangled="btVector3::getY() const" location="f3:548" file="f3" line="548" endline="548" inline="1"/>
  <Method id="_2408" name="getZ" returns="_3265" const="1" context="_192" access="public" mangled="_ZNK9btVector34getZEv" demangled="btVector3::getZ() const" location="f3:550" file="f3" line="550" endline="550" inline="1"/>
  <Method id="_2409" name="setX" returns="_631" context="_192" access="public" mangled="_ZN9btVector34setXEf" demangled="btVector3::setX(float)" location="f3:552" file="f3" line="552" endline="552" inline="1">
    <Argument name="_x" type="_360" location="f3:552" file="f3" line="552"/>
  </Method>
  <Method id="_2410" name="setY" returns="_631" context="_192" access="public" mangled="_ZN9btVector34setYEf" demangled="btVector3::setY(float)" location="f3:554" file="f3" line="554" endline="554" inline="1">
    <Argument name="_y" type="_360" location="f3:554" file="f3" line="554"/>
  </Method>
  <Method id="_2411" name="setZ" returns="_631" context="_192" access="public" mangled="_ZN9btVector34setZEf" demangled="btVector3::setZ(float)" location="f3:556" file="f3" line="556" endline="556" inline="1">
    <Argument name="_z" type="_360" location="f3:556" file="f3" line="556"/>
  </Method>
  <Method id="_2412" name="setW" returns="_631" context="_192" access="public" mangled="_ZN9btVector34setWEf" demangled="btVector3::setW(float)" location="f3:558" file="f3" line="558" endline="558" inline="1">
    <Argument name="_w" type="_360" location="f3:558" file="f3" line="558"/>
  </Method>
  <Method id="_2413" name="x" returns="_3265" const="1" context="_192" access="public" mangled="_ZNK9btVector31xEv" demangled="btVector3::x() const" location="f3:560" file="f3" line="560" endline="560" inline="1"/>
  <Method id="_2414" name="y" returns="_3265" const="1" context="_192" access="public" mangled="_ZNK9btVector31yEv" demangled="btVector3::y() const" location="f3:562" file="f3" line="562" endline="562" inline="1"/>
  <Method id="_2415" name="z" returns="_3265" const="1" context="_192" access="public" mangled="_ZNK9btVector31zEv" demangled="btVector3::z() const" location="f3:564" file="f3" line="564" endline="564" inline="1"/>
  <Method id="_2416" name="w" returns="_3265" const="1" context="_192" access="public" mangled="_ZNK9btVector31wEv" demangled="btVector3::w() const" location="f3:566" file="f3" line="566" endline="566" inline="1"/>
  <Converter id="_2417" name="operator 1" returns="_8860" context="_192" access="public" mangled="_ZN9btVector3cvPfEv" demangled="btVector3::operator float*()" location="f3:571" file="f3" line="571" endline="571" inline="1"/>
  <Converter id="_2418" name="operator 2" returns="_8861" const="1" context="_192" access="public" mangled="_ZNK9btVector3cvPKfEv" demangled="btVector3::operator float const*() const" location="f3:572" file="f3" line="572" endline="572" inline="1"/>
  <OperatorMethod id="_2419" name="==" returns="_1816" const="1" context="_192" access="public" mangled="_ZNK9btVector3eqERKS_" demangled="btVector3::operator==(btVector3 const&amp;) const" location="f3:574" file="f3" line="574" endline="582" inline="1">
    <Argument name="other" type="_1806" location="f3:574" file="f3" line="574"/>
  </OperatorMethod>
  <OperatorMethod id="_2420" name="!=" returns="_1816" const="1" context="_192" access="public" mangled="_ZNK9btVector3neERKS_" demangled="btVector3::operator!=(btVector3 const&amp;) const" location="f3:586" file="f3" line="586" endline="588" inline="1">
    <Argument name="other" type="_1806" location="f3:586" file="f3" line="586"/>
  </OperatorMethod>
  <Method id="_2421" name="setMax" returns="_631" context="_192" access="public" mangled="_ZN9btVector36setMaxERKS_" demangled="btVector3::setMax(btVector3 const&amp;)" location="f3:594" file="f3" line="594" endline="604" inline="1">
    <Argument name="other" type="_1806" location="f3:594" file="f3" line="594"/>
  </Method>
  <Method id="_2422" name="setMin" returns="_631" context="_192" access="public" mangled="_ZN9btVector36setMinERKS_" demangled="btVector3::setMin(btVector3 const&amp;)" location="f3:611" file="f3" line="611" endline="621" inline="1">
    <Argument name="other" type="_1806" location="f3:611" file="f3" line="611"/>
  </Method>
  <Method id="_2423" name="setValue" returns="_631" context="_192" access="public" mangled="_ZN9btVector38setValueERKfS1_S1_" demangled="btVector3::setValue(float const&amp;, float const&amp;, float const&amp;)" location="f3:625" file="f3" line="625" endline="630" inline="1">
    <Argument name="_x" type="_3265" location="f3:625" file="f3" line="625"/>
    <Argument name="_y" type="_3265" location="f3:625" file="f3" line="625"/>
    <Argument name="_z" type="_3265" location="f3:625" file="f3" line="625"/>
  </Method>
  <Method id="_2424" name="getSkewSymmetricMatrix" returns="_631" const="1" context="_192" access="public" mangled="_ZNK9btVector322getSkewSymmetricMatrixEPS_S0_S0_" demangled="btVector3::getSkewSymmetricMatrix(btVector3*, btVector3*, btVector3*) const" location="f3:633" file="f3" line="633" endline="652" inline="1">
    <Argument name="v0" type="_4232" location="f3:633" file="f3" line="633"/>
    <Argument name="v1" type="_4232" location="f3:633" file="f3" line="633"/>
    <Argument name="v2" type="_4232" location="f3:633" file="f3" line="633"/>
  </Method>
  <Method id="_2425" name="setZero" returns="_631" context="_192" access="public" mangled="_ZN9btVector37setZeroEv" demangled="btVector3::setZero()" location="f3:656" file="f3" line="656" endline="664" inline="1"/>
  <Method id="_2426" name="isZero" returns="_1816" const="1" context="_192" access="public" mangled="_ZNK9btVector36isZeroEv" demangled="btVector3::isZero() const" location="f3:668" file="f3" line="668" endline="670" inline="1"/>
  <Method id="_2427" name="fuzzyZero" returns="_1816" const="1" context="_192" access="public" mangled="_ZNK9btVector39fuzzyZeroEv" demangled="btVector3::fuzzyZero() const" location="f3:673" file="f3" line="673" endline="675" inline="1"/>
  <Method id="_2428" name="serialize" returns="_631" const="1" context="_192" access="public" mangled="_ZNK9btVector39serializeER18btVector3FloatData" demangled="btVector3::serialize(btVector3FloatData&amp;) const" location="f3:1330" file="f3" line="1330" endline="1334" inline="1">
    <Argument name="dataOut" type="_8862" location="f3:1330" file="f3" line="1330"/>
  </Method>
  <Method id="_2429" name="deSerialize" returns="_631" context="_192" access="public" mangled="_ZN9btVector311deSerializeERK18btVector3FloatData" demangled="btVector3::deSerialize(btVector3FloatData const&amp;)" location="f3:1337" file="f3" line="1337" endline="1340" inline="1">
    <Argument name="dataIn" type="_8863" location="f3:1337" file="f3" line="1337"/>
  </Method>
  <Method id="_2430" name="serializeFloat" returns="_631" const="1" context="_192" access="public" mangled="_ZNK9btVector314serializeFloatER18btVector3FloatData" demangled="btVector3::serializeFloat(btVector3FloatData&amp;) const" location="f3:1302" file="f3" line="1302" endline="1306" inline="1">
    <Argument name="dataOut" type="_8862" location="f3:1302" file="f3" line="1302"/>
  </Method>
  <Method id="_2431" name="deSerializeFloat" returns="_631" context="_192" access="public" mangled="_ZN9btVector316deSerializeFloatERK18btVector3FloatData" demangled="btVector3::deSerializeFloat(btVector3FloatData const&amp;)" location="f3:1309" file="f3" line="1309" endline="1312" inline="1">
    <Argument name="dataIn" type="_8863" location="f3:1309" file="f3" line="1309"/>
  </Method>
  <Method id="_2432" name="serializeDouble" returns="_631" const="1" context="_192" access="public" mangled="_ZNK9btVector315serializeDoubleER19btVector3DoubleData" demangled="btVector3::serializeDouble(btVector3DoubleData&amp;) const" location="f3:1316" file="f3" line="1316" endline="1320" inline="1">
    <Argument name="dataOut" type="_8864" location="f3:1316" file="f3" line="1316"/>
  </Method>
  <Method id="_2433" name="deSerializeDouble" returns="_631" context="_192" access="public" mangled="_ZN9btVector317deSerializeDoubleERK19btVector3DoubleData" demangled="btVector3::deSerializeDouble(btVector3DoubleData const&amp;)" location="f3:1323" file="f3" line="1323" endline="1326" inline="1">
    <Argument name="dataIn" type="_8865" location="f3:1323" file="f3" line="1323"/>
  </Method>
  <Method id="_2434" name="maxDot" returns="_22" const="1" context="_192" access="public" mangled="_ZNK9btVector36maxDotEPKS_lRf" demangled="btVector3::maxDot(btVector3 const*, long, float&amp;) const" location="f3:989" file="f3" line="989" endline="1019" inline="1">
    <Argument name="array" type="_4229" location="f3:989" file="f3" line="989"/>
    <Argument name="array_count" type="_22" location="f3:989" file="f3" line="989"/>
    <Argument name="dotOut" type="_3266" location="f3:989" file="f3" line="989"/>
  </Method>
  <Method id="_2435" name="minDot" returns="_22" const="1" context="_192" access="public" mangled="_ZNK9btVector36minDotEPKS_lRf" demangled="btVector3::minDot(btVector3 const*, long, float&amp;) const" location="f3:1026" file="f3" line="1026" endline="1059" inline="1">
    <Argument name="array" type="_4229" location="f3:1026" file="f3" line="1026"/>
    <Argument name="array_count" type="_22" location="f3:1026" file="f3" line="1026"/>
    <Argument name="dotOut" type="_3266" location="f3:1026" file="f3" line="1026"/>
  </Method>
  <Method id="_2436" name="dot3" returns="_192" const="1" context="_192" access="public" mangled="_ZNK9btVector34dot3ERKS_S1_S1_" demangled="btVector3::dot3(btVector3 const&amp;, btVector3 const&amp;, btVector3 const&amp;) const" location="f3:703" file="f3" line="703" endline="730" inline="1">
    <Argument name="v0" type="_1806" location="f3:703" file="f3" line="703"/>
    <Argument name="v1" type="_1806" location="f3:703" file="f3" line="703"/>
    <Argument name="v2" type="_1806" location="f3:703" file="f3" line="703"/>
  </Method>
  <PointerType id="_2437" type="_1155" size="64" align="64"/>
  <CvQualifiedType id="_2437r" type="_2437" restrict="1"/>
  <PointerType id="_2439" type="_631c" size="64" align="64"/>
  <PointerType id="_2440" type="_1953" size="64" align="64"/>
  <Field id="_2441" name="m_shapeType" type="_167" offset="64" context="_215" access="protected" location="f62:30" file="f62" line="30"/>
  <Field id="_2442" name="m_userPointer" type="_1068" offset="128" context="_215" access="protected" location="f62:31" file="f62" line="31"/>
  <OperatorMethod id="_2443" name="=" returns="_8867" artificial="1" throw="" context="_215" access="public" mangled="_ZN16btCollisionShapeaSERKS_" demangled="btCollisionShape::operator=(btCollisionShape const&amp;)" location="f62:28" file="f62" line="28" endline="28" inline="1">
    <Argument type="_8868" location="f62:28" file="f62" line="28"/>
  </OperatorMethod>
  <Constructor id="_2444" name="btCollisionShape" artificial="1" throw="" context="_215" access="public" mangled="_ZN16btCollisionShapeC1ERKS_ *INTERNAL* " demangled="btCollisionShape::btCollisionShape(btCollisionShape const&amp;)" location="f62:28" file="f62" line="28" endline="28" inline="1">
    <Argument type="_8868" location="f62:28" file="f62" line="28"/>
  </Constructor>
  <OperatorMethod id="_2445" name="new" returns="_1068" static="1" context="_215" access="public" mangled="_ZN16btCollisionShapenwEm" demangled="btCollisionShape::operator new(unsigned long)" location="f62:35" file="f62" line="35" endline="35" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f62:35" file="f62" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2446" name="delete" returns="_631" static="1" context="_215" access="public" mangled="_ZN16btCollisionShapedlEPv" demangled="btCollisionShape::operator delete(void*)" location="f62:35" file="f62" line="35" endline="35" inline="1">
    <Argument name="ptr" type="_1068" location="f62:35" file="f62" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2447" name="new" returns="_1068" static="1" context="_215" access="public" mangled="_ZN16btCollisionShapenwEmPv" demangled="btCollisionShape::operator new(unsigned long, void*)" location="f62:35" file="f62" line="35" endline="35" inline="1">
    <Argument type="_1155" location="f62:35" file="f62" line="35"/>
    <Argument name="ptr" type="_1068" location="f62:35" file="f62" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2448" name="delete" returns="_631" static="1" context="_215" access="public" mangled="_ZN16btCollisionShapedlEPvS0_" demangled="btCollisionShape::operator delete(void*, void*)" location="f62:35" file="f62" line="35" inline="1">
    <Argument type="_1068" location="f62:35" file="f62" line="35"/>
    <Argument type="_1068" location="f62:35" file="f62" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2449" name="new []" returns="_1068" static="1" context="_215" access="public" mangled="_ZN16btCollisionShapenaEm" demangled="btCollisionShape::operator new[](unsigned long)" location="f62:35" file="f62" line="35" endline="35" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f62:35" file="f62" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2450" name="delete []" returns="_631" static="1" context="_215" access="public" mangled="_ZN16btCollisionShapedaEPv" demangled="btCollisionShape::operator delete[](void*)" location="f62:35" file="f62" line="35" endline="35" inline="1">
    <Argument name="ptr" type="_1068" location="f62:35" file="f62" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2451" name="new []" returns="_1068" static="1" context="_215" access="public" mangled="_ZN16btCollisionShapenaEmPv" demangled="btCollisionShape::operator new[](unsigned long, void*)" location="f62:35" file="f62" line="35" endline="35" inline="1">
    <Argument type="_1155" location="f62:35" file="f62" line="35"/>
    <Argument name="ptr" type="_1068" location="f62:35" file="f62" line="35"/>
  </OperatorMethod>
  <OperatorMethod id="_2452" name="delete []" returns="_631" static="1" context="_215" access="public" mangled="_ZN16btCollisionShapedaEPvS0_" demangled="btCollisionShape::operator delete[](void*, void*)" location="f62:35" file="f62" line="35" inline="1">
    <Argument type="_1068" location="f62:35" file="f62" line="35"/>
    <Argument type="_1068" location="f62:35" file="f62" line="35"/>
  </OperatorMethod>
  <Constructor id="_2453" name="btCollisionShape" explicit="1" context="_215" access="public" mangled="_ZN16btCollisionShapeC1Ev *INTERNAL* " demangled="btCollisionShape::btCollisionShape()" location="f62:37" file="f62" line="37" endline="37" inline="1"/>
  <Destructor id="_2454" name="btCollisionShape" virtual="1" overrides="" context="_215" access="public" mangled="_ZN16btCollisionShapeD1Ev *INTERNAL* " demangled="btCollisionShape::~btCollisionShape()" location="f62:41" file="f62" line="41" endline="43" inline="1">
  </Destructor>
  <Method id="_2455" name="getAabb" returns="_631" const="1" virtual="1" pure_virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape7getAabbERK11btTransformR9btVector3S4_" demangled="btCollisionShape::getAabb(btTransform const&amp;, btVector3&amp;, btVector3&amp;) const" location="f62:46" file="f62" line="46" extern="1">
    <Argument name="t" type="_6832" location="f62:46" file="f62" line="46"/>
    <Argument name="aabbMin" type="_2481" location="f62:46" file="f62" line="46"/>
    <Argument name="aabbMax" type="_2481" location="f62:46" file="f62" line="46"/>
  </Method>
  <Method id="_2456" name="getBoundingSphere" returns="_631" const="1" virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape17getBoundingSphereER9btVector3Rf" demangled="btCollisionShape::getBoundingSphere(btVector3&amp;, float&amp;) const" location="f62:48" file="f62" line="48" extern="1">
    <Argument name="center" type="_2481" location="f62:48" file="f62" line="48"/>
    <Argument name="radius" type="_3266" location="f62:48" file="f62" line="48"/>
  </Method>
  <Method id="_2457" name="getAngularMotionDisc" returns="_360" const="1" virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape20getAngularMotionDiscEv" demangled="btCollisionShape::getAngularMotionDisc() const" location="f62:51" file="f62" line="51" extern="1"/>
  <Method id="_2458" name="getContactBreakingThreshold" returns="_360" const="1" virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape27getContactBreakingThresholdEf" demangled="btCollisionShape::getContactBreakingThreshold(float) const" location="f62:53" file="f62" line="53" extern="1">
    <Argument name="defaultContactThresholdFactor" type="_360" location="f62:53" file="f62" line="53"/>
  </Method>
  <Method id="_2459" name="calculateTemporalAabb" returns="_631" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape21calculateTemporalAabbERK11btTransformRK9btVector3S5_fRS3_S6_" demangled="btCollisionShape::calculateTemporalAabb(btTransform const&amp;, btVector3 const&amp;, btVector3 const&amp;, float, btVector3&amp;, btVector3&amp;) const" location="f62:58" file="f62" line="58" extern="1">
    <Argument name="curTrans" type="_6832" location="f62:58" file="f62" line="58"/>
    <Argument name="linvel" type="_1806" location="f62:58" file="f62" line="58"/>
    <Argument name="angvel" type="_1806" location="f62:58" file="f62" line="58"/>
    <Argument name="timeStep" type="_360" location="f62:58" file="f62" line="58"/>
    <Argument name="temporalAabbMin" type="_2481" location="f62:58" file="f62" line="58"/>
    <Argument name="temporalAabbMax" type="_2481" location="f62:58" file="f62" line="58"/>
  </Method>
  <Method id="_2460" name="isPolyhedral" returns="_1816" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape12isPolyhedralEv" demangled="btCollisionShape::isPolyhedral() const" location="f62:62" file="f62" line="62" endline="64" inline="1"/>
  <Method id="_2461" name="isConvex2d" returns="_1816" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape10isConvex2dEv" demangled="btCollisionShape::isConvex2d() const" location="f62:67" file="f62" line="67" endline="69" inline="1"/>
  <Method id="_2462" name="isConvex" returns="_1816" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape8isConvexEv" demangled="btCollisionShape::isConvex() const" location="f62:72" file="f62" line="72" endline="74" inline="1"/>
  <Method id="_2463" name="isNonMoving" returns="_1816" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape11isNonMovingEv" demangled="btCollisionShape::isNonMoving() const" location="f62:76" file="f62" line="76" endline="78" inline="1"/>
  <Method id="_2464" name="isConcave" returns="_1816" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape9isConcaveEv" demangled="btCollisionShape::isConcave() const" location="f62:80" file="f62" line="80" endline="82" inline="1"/>
  <Method id="_2465" name="isCompound" returns="_1816" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape10isCompoundEv" demangled="btCollisionShape::isCompound() const" location="f62:84" file="f62" line="84" endline="86" inline="1"/>
  <Method id="_2466" name="isSoftBody" returns="_1816" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape10isSoftBodyEv" demangled="btCollisionShape::isSoftBody() const" location="f62:89" file="f62" line="89" endline="91" inline="1"/>
  <Method id="_2467" name="isInfinite" returns="_1816" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape10isInfiniteEv" demangled="btCollisionShape::isInfinite() const" location="f62:95" file="f62" line="95" endline="97" inline="1"/>
  <Method id="_2468" name="setLocalScaling" returns="_631" virtual="1" pure_virtual="1" overrides="" context="_215" access="public" mangled="_ZN16btCollisionShape15setLocalScalingERK9btVector3" demangled="btCollisionShape::setLocalScaling(btVector3 const&amp;)" location="f62:101" file="f62" line="101" extern="1">
    <Argument name="scaling" type="_1806" location="f62:101" file="f62" line="101"/>
  </Method>
  <Method id="_2469" name="getLocalScaling" returns="_1806" const="1" virtual="1" pure_virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape15getLocalScalingEv" demangled="btCollisionShape::getLocalScaling() const" location="f62:102" file="f62" line="102" extern="1"/>
  <Method id="_2470" name="calculateLocalInertia" returns="_631" const="1" virtual="1" pure_virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape21calculateLocalInertiaEfR9btVector3" demangled="btCollisionShape::calculateLocalInertia(float, btVector3&amp;) const" location="f62:103" file="f62" line="103" extern="1">
    <Argument name="mass" type="_360" location="f62:103" file="f62" line="103"/>
    <Argument name="inertia" type="_2481" location="f62:103" file="f62" line="103"/>
  </Method>
  <Method id="_2471" name="getName" returns="_1805" const="1" virtual="1" pure_virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape7getNameEv" demangled="btCollisionShape::getName() const" location="f62:107" file="f62" line="107" extern="1"/>
  <Method id="_2472" name="getShapeType" returns="_167" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape12getShapeTypeEv" demangled="btCollisionShape::getShapeType() const" location="f62:111" file="f62" line="111" endline="111" inline="1"/>
  <Method id="_2473" name="getAnisotropicRollingFrictionDirection" returns="_192" const="1" virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape38getAnisotropicRollingFrictionDirectionEv" demangled="btCollisionShape::getAnisotropicRollingFrictionDirection() const" location="f62:115" file="f62" line="115" endline="117" inline="1"/>
  <Method id="_2474" name="setMargin" returns="_631" virtual="1" pure_virtual="1" overrides="" context="_215" access="public" mangled="_ZN16btCollisionShape9setMarginEf" demangled="btCollisionShape::setMargin(float)" location="f62:119" file="f62" line="119" extern="1">
    <Argument name="margin" type="_360" location="f62:119" file="f62" line="119"/>
  </Method>
  <Method id="_2475" name="getMargin" returns="_360" const="1" virtual="1" pure_virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape9getMarginEv" demangled="btCollisionShape::getMargin() const" location="f62:120" file="f62" line="120" extern="1"/>
  <Method id="_2476" name="setUserPointer" returns="_631" context="_215" access="public" mangled="_ZN16btCollisionShape14setUserPointerEPv" demangled="btCollisionShape::setUserPointer(void*)" location="f62:124" file="f62" line="124" endline="126" inline="1">
    <Argument name="userPtr" type="_1068" location="f62:124" file="f62" line="124"/>
  </Method>
  <Method id="_2477" name="getUserPointer" returns="_1068" const="1" context="_215" access="public" mangled="_ZNK16btCollisionShape14getUserPointerEv" demangled="btCollisionShape::getUserPointer() const" location="f62:129" file="f62" line="129" endline="131" inline="1"/>
  <Method id="_2478" name="calculateSerializeBufferSize" returns="_167" const="1" virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape28calculateSerializeBufferSizeEv" demangled="btCollisionShape::calculateSerializeBufferSize() const" location="f62:151" file="f62" line="151" endline="153" inline="1"/>
  <Method id="_2479" name="serialize" returns="_1805" const="1" virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape9serializeEPvP12btSerializer" demangled="btCollisionShape::serialize(void*, btSerializer*) const" location="f62:137" file="f62" line="137" extern="1">
    <Argument name="dataBuffer" type="_1068" location="f62:137" file="f62" line="137"/>
    <Argument name="serializer" type="_8713" location="f62:137" file="f62" line="137"/>
  </Method>
  <Method id="_2480" name="serializeSingleShape" returns="_631" const="1" virtual="1" overrides="" context="_215" access="public" mangled="_ZNK16btCollisionShape20serializeSingleShapeEP12btSerializer" demangled="btCollisionShape::serializeSingleShape(btSerializer*) const" location="f62:139" file="f62" line="139" extern="1">
    <Argument name="serializer" type="_8713" location="f62:139" file="f62" line="139"/>
  </Method>
  <ReferenceType id="_2481" type="_192" size="64" align="64"/>
  <OperatorMethod id="_2482" name="=" returns="_8869" artificial="1" throw="" context="_217" access="public" mangled="_ZN24btCollisionConfigurationaSERKS_" demangled="btCollisionConfiguration::operator=(btCollisionConfiguration const&amp;)" location="f63:28" file="f63" line="28" endline="28" inline="1">
    <Argument type="_8870" location="f63:28" file="f63" line="28"/>
  </OperatorMethod>
  <Constructor id="_2483" name="btCollisionConfiguration" artificial="1" throw="" context="_217" access="public" mangled="_ZN24btCollisionConfigurationC1ERKS_ *INTERNAL* " demangled="btCollisionConfiguration::btCollisionConfiguration(btCollisionConfiguration const&amp;)" location="f63:28" file="f63" line="28" endline="28" inline="1">
    <Argument type="_8870" location="f63:28" file="f63" line="28"/>
  </Constructor>
  <Constructor id="_2484" name="btCollisionConfiguration" artificial="1" throw="" context="_217" access="public" mangled="_ZN24btCollisionConfigurationC1Ev *INTERNAL* " demangled="btCollisionConfiguration::btCollisionConfiguration()" location="f63:28" file="f63" line="28" endline="28" inline="1"/>
  <Destructor id="_2485" name="btCollisionConfiguration" virtual="1" overrides="" context="_217" access="public" mangled="_ZN24btCollisionConfigurationD1Ev *INTERNAL* " demangled="btCollisionConfiguration::~btCollisionConfiguration()" location="f63:32" file="f63" line="32" endline="34" inline="1">
  </Destructor>
  <Method id="_2486" name="getPersistentManifoldPool" returns="_8871" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZN24btCollisionConfiguration25getPersistentManifoldPoolEv" demangled="btCollisionConfiguration::getPersistentManifoldPool()" location="f63:37" file="f63" line="37" extern="1"/>
  <Method id="_2487" name="getCollisionAlgorithmPool" returns="_8871" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZN24btCollisionConfiguration25getCollisionAlgorithmPoolEv" demangled="btCollisionConfiguration::getCollisionAlgorithmPool()" location="f63:39" file="f63" line="39" extern="1"/>
  <Method id="_2488" name="getStackAllocator" returns="_8872" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZN24btCollisionConfiguration17getStackAllocatorEv" demangled="btCollisionConfiguration::getStackAllocator()" location="f63:41" file="f63" line="41" extern="1"/>
  <Method id="_2489" name="getCollisionAlgorithmCreateFunc" returns="_8873" virtual="1" pure_virtual="1" overrides="" context="_217" access="public" mangled="_ZN24btCollisionConfiguration31getCollisionAlgorithmCreateFuncEii" demangled="btCollisionConfiguration::getCollisionAlgorithmCreateFunc(int, int)" location="f63:43" file="f63" line="43" extern="1">
    <Argument name="proxyType0" type="_167" location="f63:43" file="f63" line="43"/>
    <Argument name="proxyType1" type="_167" location="f63:43" file="f63" line="43"/>
  </Method>
  <OperatorMethod id="_2490" name="=" returns="_8874" artificial="1" throw="" context="_218" access="public" mangled="_ZN15btCapsuleShapeXaSERKS_" demangled="btCapsuleShapeX::operator=(btCapsuleShapeX const&amp;)" location="f7:126" file="f7" line="126" endline="126" inline="1">
    <Argument type="_8875" location="f7:126" file="f7" line="126"/>
  </OperatorMethod>
  <Constructor id="_2491" name="btCapsuleShapeX" artificial="1" throw="" context="_218" access="public" mangled="_ZN15btCapsuleShapeXC1ERKS_ *INTERNAL* " demangled="btCapsuleShapeX::btCapsuleShapeX(btCapsuleShapeX const&amp;)" location="f7:126" file="f7" line="126" endline="126" inline="1">
    <Argument type="_8875" location="f7:126" file="f7" line="126"/>
  </Constructor>
  <Constructor id="_2492" name="btCapsuleShapeX" explicit="1" context="_218" access="public" mangled="_ZN15btCapsuleShapeXC1Eff *INTERNAL* " demangled="btCapsuleShapeX::btCapsuleShapeX(float, float)" location="f7:129" file="f7" line="129" extern="1">
    <Argument name="radius" type="_360" location="f7:129" file="f7" line="129"/>
    <Argument name="height" type="_360" location="f7:129" file="f7" line="129"/>
  </Constructor>
  <Method id="_2493" name="getName" returns="_1805" const="1" virtual="1" overrides="_6914 " context="_218" access="public" mangled="_ZNK15btCapsuleShapeX7getNameEv" demangled="btCapsuleShapeX::getName() const" location="f7:132" file="f7" line="132" endline="134" inline="1"/>
  <Destructor id="_2494" name="btCapsuleShapeX" virtual="1" overrides="_6922 " artificial="1" context="_218" access="public" mangled="_ZN15btCapsuleShapeXD1Ev *INTERNAL* " demangled="btCapsuleShapeX::~btCapsuleShapeX()" location="f7:126" file="f7" line="126" endline="126" inline="1">
  </Destructor>
  <OperatorMethod id="_2495" name="=" returns="_8876" artificial="1" throw="" context="_219" access="public" mangled="_ZN15btCapsuleShapeZaSERKS_" demangled="btCapsuleShapeZ::operator=(btCapsuleShapeZ const&amp;)" location="f7:144" file="f7" line="144" endline="144" inline="1">
    <Argument type="_8877" location="f7:144" file="f7" line="144"/>
  </OperatorMethod>
  <Constructor id="_2496" name="btCapsuleShapeZ" artificial="1" throw="" context="_219" access="public" mangled="_ZN15btCapsuleShapeZC1ERKS_ *INTERNAL* " demangled="btCapsuleShapeZ::btCapsuleShapeZ(btCapsuleShapeZ const&amp;)" location="f7:144" file="f7" line="144" endline="144" inline="1">
    <Argument type="_8877" location="f7:144" file="f7" line="144"/>
  </Constructor>
  <Constructor id="_2497" name="btCapsuleShapeZ" explicit="1" context="_219" access="public" mangled="_ZN15btCapsuleShapeZC1Eff *INTERNAL* " demangled="btCapsuleShapeZ::btCapsuleShapeZ(float, float)" location="f7:146" file="f7" line="146" extern="1">
    <Argument name="radius" type="_360" location="f7:146" file="f7" line="146"/>
    <Argument name="height" type="_360" location="f7:146" file="f7" line="146"/>
  </Constructor>
  <Method id="_2498" name="getName" returns="_1805" const="1" virtual="1" overrides="_6914 " context="_219" access="public" mangled="_ZNK15btCapsuleShapeZ7getNameEv" demangled="btCapsuleShapeZ::getName() const" location="f7:149" file="f7" line="149" endline="151" inline="1"/>
  <Destructor id="_2499" name="btCapsuleShapeZ" virtual="1" overrides="_6922 " artificial="1" context="_219" access="public" mangled="_ZN15btCapsuleShapeZD1Ev *INTERNAL* " demangled="btCapsuleShapeZ::~btCapsuleShapeZ()" location="f7:144" file="f7" line="144" endline="144" inline="1">
  </Destructor>
  <ReferenceType id="_2500" type="_117c" size="64" align="64"/>
  <Field id="_2501" name="m_chassisConnectionCS" type="_192" offset="0" context="_244" access="public" location="f67:21" file="f67" line="21"/>
  <Field id="_2502" name="m_wheelDirectionCS" type="_192" offset="128" context="_244" access="public" location="f67:22" file="f67" line="22"/>
  <Field id="_2503" name="m_wheelAxleCS" type="_192" offset="256" context="_244" access="public" location="f67:23" file="f67" line="23"/>
  <Field id="_2504" name="m_suspensionRestLength" type="_360" offset="384" context="_244" access="public" location="f67:24" file="f67" line="24"/>
  <Field id="_2505" name="m_maxSuspensionTravelCm" type="_360" offset="416" context="_244" access="public" location="f67:25" file="f67" line="25"/>
  <Field id="_2506" name="m_wheelRadius" type="_360" offset="448" context="_244" access="public" location="f67:26" file="f67" line="26"/>
  <Field id="_2507" name="m_suspensionStiffness" type="_360" offset="480" context="_244" access="public" location="f67:28" file="f67" line="28"/>
  <Field id="_2508" name="m_wheelsDampingCompression" type="_360" offset="512" context="_244" access="public" location="f67:29" file="f67" line="29"/>
  <Field id="_2509" name="m_wheelsDampingRelaxation" type="_360" offset="544" context="_244" access="public" location="f67:30" file="f67" line="30"/>
  <Field id="_2510" name="m_frictionSlip" type="_360" offset="576" context="_244" access="public" location="f67:31" file="f67" line="31"/>
  <Field id="_2511" name="m_maxSuspensionForce" type="_360" offset="608" context="_244" access="public" location="f67:32" file="f67" line="32"/>
  <Field id="_2512" name="m_bIsFrontWheel" type="_1816" offset="640" context="_244" access="public" location="f67:33" file="f67" line="33"/>
  <Destructor id="_2513" name="btWheelInfoConstructionInfo" artificial="1" throw="" context="_244" access="public" mangled="_ZN27btWheelInfoConstructionInfoD1Ev *INTERNAL* " demangled="btWheelInfoConstructionInfo::~btWheelInfoConstructionInfo()" location="f67:20" file="f67" line="20" endline="20" inline="1">
  </Destructor>
  <OperatorMethod id="_2514" name="=" returns="_8879" artificial="1" throw="" context="_244" access="public" mangled="_ZN27btWheelInfoConstructionInfoaSERKS_" demangled="btWheelInfoConstructionInfo::operator=(btWheelInfoConstructionInfo const&amp;)" location="f67:20" file="f67" line="20" endline="20" inline="1">
    <Argument type="_8880" location="f67:20" file="f67" line="20"/>
  </OperatorMethod>
  <Constructor id="_2515" name="btWheelInfoConstructionInfo" artificial="1" throw="" context="_244" access="public" mangled="_ZN27btWheelInfoConstructionInfoC1ERKS_ *INTERNAL* " demangled="btWheelInfoConstructionInfo::btWheelInfoConstructionInfo(btWheelInfoConstructionInfo const&amp;)" location="f67:20" file="f67" line="20" endline="20" inline="1">
    <Argument type="_8880" location="f67:20" file="f67" line="20"/>
  </Constructor>
  <Constructor id="_2516" name="btWheelInfoConstructionInfo" artificial="1" context="_244" access="public" mangled="_ZN27btWheelInfoConstructionInfoC1Ev *INTERNAL* " demangled="btWheelInfoConstructionInfo::btWheelInfoConstructionInfo()" location="f67:20" file="f67" line="20" endline="20" inline="1"/>
  <PointerType id="_2517" type="_508" size="64" align="64"/>
  <Field id="_2518" name="m_flags" type="_167" offset="0" context="_258" access="public" location="f8:91" file="f8" line="91"/>
  <Field id="_2519" name="m_edgeV0V1Angle" type="_359" offset="32" context="_258" access="public" location="f8:92" file="f8" line="92"/>
  <Field id="_2520" name="m_edgeV1V2Angle" type="_359" offset="64" context="_258" access="public" location="f8:93" file="f8" line="93"/>
  <Field id="_2521" name="m_edgeV2V0Angle" type="_359" offset="96" context="_258" access="public" location="f8:94" file="f8" line="94"/>
  <Destructor id="_2522" name="btTriangleInfoData" artificial="1" throw="" context="_258" access="public" mangled="_ZN18btTriangleInfoDataD1Ev *INTERNAL* " demangled="btTriangleInfoData::~btTriangleInfoData()" location="f8:90" file="f8" line="90" endline="90" inline="1">
  </Destructor>
  <OperatorMethod id="_2523" name="=" returns="_8881" artificial="1" throw="" context="_258" access="public" mangled="_ZN18btTriangleInfoDataaSERKS_" demangled="btTriangleInfoData::operator=(btTriangleInfoData const&amp;)" location="f8:90" file="f8" line="90" endline="90" inline="1">
    <Argument type="_8882" location="f8:90" file="f8" line="90"/>
  </OperatorMethod>
  <Constructor id="_2524" name="btTriangleInfoData" artificial="1" throw="" context="_258" access="public" mangled="_ZN18btTriangleInfoDataC1ERKS_ *INTERNAL* " demangled="btTriangleInfoData::btTriangleInfoData(btTriangleInfoData const&amp;)" location="f8:90" file="f8" line="90" endline="90" inline="1">
    <Argument type="_8882" location="f8:90" file="f8" line="90"/>
  </Constructor>
  <Constructor id="_2525" name="btTriangleInfoData" artificial="1" throw="" context="_258" access="public" mangled="_ZN18btTriangleInfoDataC1Ev *INTERNAL* " demangled="btTriangleInfoData::btTriangleInfoData()" location="f8:90" file="f8" line="90" inline="1"/>
  <Field id="_2526" name="m_collisionShapeData" type="_1290" offset="0" context="_259" access="public" location="f69:116" file="f69" line="116"/>
  <Field id="_2527" name="m_meshInterface" type="_1737" offset="128" context="_259" access="public" location="f69:118" file="f69" line="118"/>
  <Field id="_2528" name="m_quantizedFloatBvh" type="_8883" offset="384" context="_259" access="public" location="f69:120" file="f69" line="120"/>
  <Field id="_2529" name="m_quantizedDoubleBvh" type="_8884" offset="448" context="_259" access="public" location="f69:121" file="f69" line="121"/>
  <Field id="_2530" name="m_triangleInfoMap" type="_8885" offset="512" context="_259" access="public" location="f69:123" file="f69" line="123"/>
  <Field id="_2531" name="m_collisionMargin" type="_359" offset="576" context="_259" access="public" location="f69:125" file="f69" line="125"/>
  <Field id="_2532" name="m_pad3" type="_8708" offset="608" context="_259" access="public" location="f69:127" file="f69" line="127"/>
  <Destructor id="_2533" name="btTriangleMeshShapeData" artificial="1" throw="" context="_259" access="public" mangled="_ZN23btTriangleMeshShapeDataD1Ev *INTERNAL* " demangled="btTriangleMeshShapeData::~btTriangleMeshShapeData()" location="f69:115" file="f69" line="115" endline="115" inline="1">
  </Destructor>
  <OperatorMethod id="_2534" name="=" returns="_8886" artificial="1" throw="" context="_259" access="public" mangled="_ZN23btTriangleMeshShapeDataaSERKS_" demangled="btTriangleMeshShapeData::operator=(btTriangleMeshShapeData const&amp;)" location="f69:115" file="f69" line="115" endline="115" inline="1">
    <Argument type="_8887" location="f69:115" file="f69" line="115"/>
  </OperatorMethod>
  <Constructor id="_2535" name="btTriangleMeshShapeData" artificial="1" throw="" context="_259" access="public" mangled="_ZN23btTriangleMeshShapeDataC1ERKS_ *INTERNAL* " demangled="btTriangleMeshShapeData::btTriangleMeshShapeData(btTriangleMeshShapeData const&amp;)" location="f69:115" file="f69" line="115" endline="115" inline="1">
    <Argument type="_8887" location="f69:115" file="f69" line="115"/>
  </Constructor>
  <Constructor id="_2536" name="btTriangleMeshShapeData" artificial="1" throw="" context="_259" access="public" mangled="_ZN23btTriangleMeshShapeDataC1Ev *INTERNAL* " demangled="btTriangleMeshShapeData::btTriangleMeshShapeData()" location="f69:115" file="f69" line="115" inline="1"/>
  <Field id="_2537" name="m_solverInfo" type="_911" offset="0" context="_266" access="public" location="f70:159" file="f70" line="159"/>
  <Field id="_2538" name="m_gravity" type="_617" offset="704" context="_266" access="public" location="f70:160" file="f70" line="160"/>
  <Destructor id="_2539" name="btDynamicsWorldFloatData" artificial="1" throw="" context="_266" access="public" mangled="_ZN24btDynamicsWorldFloatDataD1Ev *INTERNAL* " demangled="btDynamicsWorldFloatData::~btDynamicsWorldFloatData()" location="f70:158" file="f70" line="158" endline="158" inline="1">
  </Destructor>
  <OperatorMethod id="_2540" name="=" returns="_8888" artificial="1" throw="" context="_266" access="public" mangled="_ZN24btDynamicsWorldFloatDataaSERKS_" demangled="btDynamicsWorldFloatData::operator=(btDynamicsWorldFloatData const&amp;)" location="f70:158" file="f70" line="158" endline="158" inline="1">
    <Argument type="_8889" location="f70:158" file="f70" line="158"/>
  </OperatorMethod>
  <Constructor id="_2541" name="btDynamicsWorldFloatData" artificial="1" throw="" context="_266" access="public" mangled="_ZN24btDynamicsWorldFloatDataC1ERKS_ *INTERNAL* " demangled="btDynamicsWorldFloatData::btDynamicsWorldFloatData(btDynamicsWorldFloatData const&amp;)" location="f70:158" file="f70" line="158" endline="158" inline="1">
    <Argument type="_8889" location="f70:158" file="f70" line="158"/>
  </Constructor>
  <Constructor id="_2542" name="btDynamicsWorldFloatData" artificial="1" throw="" context="_266" access="public" mangled="_ZN24btDynamicsWorldFloatDataC1Ev *INTERNAL* " demangled="btDynamicsWorldFloatData::btDynamicsWorldFloatData()" location="f70:158" file="f70" line="158" inline="1"/>
  <Field id="_2543" name="m_swapped" type="_1816" offset="64" context="_269" access="public" location="f71:28" file="f71" line="28"/>
  <OperatorMethod id="_2544" name="=" returns="_8890" artificial="1" throw="" context="_269" access="public" mangled="_ZN30btCollisionAlgorithmCreateFuncaSERKS_" demangled="btCollisionAlgorithmCreateFunc::operator=(btCollisionAlgorithmCreateFunc const&amp;)" location="f71:27" file="f71" line="27" endline="27" inline="1">
    <Argument type="_8891" location="f71:27" file="f71" line="27"/>
  </OperatorMethod>
  <Constructor id="_2545" name="btCollisionAlgorithmCreateFunc" artificial="1" throw="" context="_269" access="public" mangled="_ZN30btCollisionAlgorithmCreateFuncC1ERKS_ *INTERNAL* " demangled="btCollisionAlgorithmCreateFunc::btCollisionAlgorithmCreateFunc(btCollisionAlgorithmCreateFunc const&amp;)" location="f71:27" file="f71" line="27" endline="27" inline="1">
    <Argument type="_8891" location="f71:27" file="f71" line="27"/>
  </Constructor>
  <Constructor id="_2546" name="btCollisionAlgorithmCreateFunc" explicit="1" context="_269" access="public" mangled="_ZN30btCollisionAlgorithmCreateFuncC1Ev *INTERNAL* " demangled="btCollisionAlgorithmCreateFunc::btCollisionAlgorithmCreateFunc()" location="f71:30" file="f71" line="30" endline="31" inline="1"/>
  <Destructor id="_2547" name="btCollisionAlgorithmCreateFunc" virtual="1" overrides="" context="_269" access="public" mangled="_ZN30btCollisionAlgorithmCreateFuncD1Ev *INTERNAL* " demangled="btCollisionAlgorithmCreateFunc::~btCollisionAlgorithmCreateFunc()" location="f71:34" file="f71" line="34" endline="34" inline="1">
  </Destructor>
  <Method id="_2548" name="CreateCollisionAlgorithm" returns="_8892" virtual="1" overrides="" context="_269" access="public" mangled="_ZN30btCollisionAlgorithmCreateFunc24CreateCollisionAlgorithmER36btCollisionAlgorithmConstructionInfoPK24btCollisionObjectWrapperS4_" demangled="btCollisionAlgorithmCreateFunc::CreateCollisionAlgorithm(btCollisionAlgorithmConstructionInfo&amp;, btCollisionObjectWrapper const*, btCollisionObjectWrapper const*)" location="f71:36" file="f71" line="36" endline="41" inline="1">
    <Argument type="_8893" location="f71:36" file="f71" line="36"/>
    <Argument name="body0Wrap" type="_8843" location="f71:36" file="f71" line="36"/>
    <Argument name="body1Wrap" type="_8843" location="f71:36" file="f71" line="36"/>
  </Method>
  <PointerType id="_2549" type="_683" size="64" align="64"/>
  <PointerType id="_2550" type="_1482" size="64" align="64"/>
  <CvQualifiedType id="_1952r" type="_1952" restrict="1"/>
  <PointerType id="_2552" type="_646" size="64" align="64"/>
  <CvQualifiedType id="_2552r" type="_2552" restrict="1"/>
  <Field id="_2554" name="m_value" type="_167" offset="0" context="_287" access="public" location="f49:106" file="f49" line="106"/>
  <Destructor id="_2555" name="btIntIndexData" artificial="1" throw="" context="_287" access="public" mangled="_ZN14btIntIndexDataD1Ev *INTERNAL* " demangled="btIntIndexData::~btIntIndexData()" location="f49:105" file="f49" line="105" endline="105" inline="1">
  </Destructor>
  <OperatorMethod id="_2556" name="=" returns="_8894" artificial="1" throw="" context="_287" access="public" mangled="_ZN14btIntIndexDataaSERKS_" demangled="btIntIndexData::operator=(btIntIndexData const&amp;)" location="f49:105" file="f49" line="105" endline="105" inline="1">
    <Argument type="_8895" location="f49:105" file="f49" line="105"/>
  </OperatorMethod>
  <Constructor id="_2557" name="btIntIndexData" artificial="1" throw="" context="_287" access="public" mangled="_ZN14btIntIndexDataC1ERKS_ *INTERNAL* " demangled="btIntIndexData::btIntIndexData(btIntIndexData const&amp;)" location="f49:105" file="f49" line="105" endline="105" inline="1">
    <Argument type="_8895" location="f49:105" file="f49" line="105"/>
  </Constructor>
  <Constructor id="_2558" name="btIntIndexData" artificial="1" throw="" context="_287" access="public" mangled="_ZN14btIntIndexDataC1Ev *INTERNAL* " demangled="btIntIndexData::btIntIndexData()" location="f49:105" file="f49" line="105" inline="1"/>
  <Field id="_2559" name="m_broadphaseHandle" type="_1068" offset="0" context="_293" access="public" location="f55:462" file="f55" line="462"/>
  <Field id="_2560" name="m_collisionShape" type="_1068" offset="64" context="_293" access="public" location="f55:463" file="f55" line="463"/>
  <Field id="_2561" name="m_rootCollisionShape" type="_8760" offset="128" context="_293" access="public" location="f55:464" file="f55" line="464"/>
  <Field id="_2562" name="m_name" type="_1062" offset="192" context="_293" access="public" location="f55:465" file="f55" line="465"/>
  <Field id="_2563" name="m_worldTransform" type="_760" offset="256" context="_293" access="public" location="f55:467" file="f55" line="467"/>
  <Field id="_2564" name="m_interpolationWorldTransform" type="_760" offset="1280" context="_293" access="public" location="f55:468" file="f55" line="468"/>
  <Field id="_2565" name="m_interpolationLinearVelocity" type="_1342" offset="2304" context="_293" access="public" location="f55:469" file="f55" line="469"/>
  <Field id="_2566" name="m_interpolationAngularVelocity" type="_1342" offset="2560" context="_293" access="public" location="f55:470" file="f55" line="470"/>
  <Field id="_2567" name="m_anisotropicFriction" type="_1342" offset="2816" context="_293" access="public" location="f55:471" file="f55" line="471"/>
  <Field id="_2568" name="m_contactProcessingThreshold" type="_508" offset="3072" context="_293" access="public" location="f55:472" file="f55" line="472"/>
  <Field id="_2569" name="m_deactivationTime" type="_508" offset="3136" context="_293" access="public" location="f55:473" file="f55" line="473"/>
  <Field id="_2570" name="m_friction" type="_508" offset="3200" context="_293" access="public" location="f55:474" file="f55" line="474"/>
  <Field id="_2571" name="m_rollingFriction" type="_508" offset="3264" context="_293" access="public" location="f55:475" file="f55" line="475"/>
  <Field id="_2572" name="m_restitution" type="_508" offset="3328" context="_293" access="public" location="f55:476" file="f55" line="476"/>
  <Field id="_2573" name="m_hitFraction" type="_508" offset="3392" context="_293" access="public" location="f55:477" file="f55" line="477"/>
  <Field id="_2574" name="m_ccdSweptSphereRadius" type="_508" offset="3456" context="_293" access="public" location="f55:478" file="f55" line="478"/>
  <Field id="_2575" name="m_ccdMotionThreshold" type="_508" offset="3520" context="_293" access="public" location="f55:479" file="f55" line="479"/>
  <Field id="_2576" name="m_hasAnisotropicFriction" type="_167" offset="3584" context="_293" access="public" location="f55:481" file="f55" line="481"/>
  <Field id="_2577" name="m_collisionFlags" type="_167" offset="3616" context="_293" access="public" location="f55:482" file="f55" line="482"/>
  <Field id="_2578" name="m_islandTag1" type="_167" offset="3648" context="_293" access="public" location="f55:483" file="f55" line="483"/>
  <Field id="_2579" name="m_companionId" type="_167" offset="3680" context="_293" access="public" location="f55:484" file="f55" line="484"/>
  <Field id="_2580" name="m_activationState1" type="_167" offset="3712" context="_293" access="public" location="f55:485" file="f55" line="485"/>
  <Field id="_2581" name="m_internalType" type="_167" offset="3744" context="_293" access="public" location="f55:486" file="f55" line="486"/>
  <Field id="_2582" name="m_checkCollideWith" type="_167" offset="3776" context="_293" access="public" location="f55:487" file="f55" line="487"/>
  <Field id="_2583" name="m_padding" type="_8708" offset="3808" context="_293" access="public" location="f55:489" file="f55" line="489"/>
  <Destructor id="_2584" name="btCollisionObjectDoubleData" artificial="1" throw="" context="_293" access="public" mangled="_ZN27btCollisionObjectDoubleDataD1Ev *INTERNAL* " demangled="btCollisionObjectDoubleData::~btCollisionObjectDoubleData()" location="f55:461" file="f55" line="461" endline="461" inline="1">
  </Destructor>
  <OperatorMethod id="_2585" name="=" returns="_8896" artificial="1" throw="" context="_293" access="public" mangled="_ZN27btCollisionObjectDoubleDataaSERKS_" demangled="btCollisionObjectDoubleData::operator=(btCollisionObjectDoubleData const&amp;)" location="f55:461" file="f55" line="461" endline="461" inline="1">
    <Argument type="_8897" location="f55:461" file="f55" line="461"/>
  </OperatorMethod>
  <Constructor id="_2586" name="btCollisionObjectDoubleData" artificial="1" throw="" context="_293" access="public" mangled="_ZN27btCollisionObjectDoubleDataC1ERKS_ *INTERNAL* " demangled="btCollisionObjectDoubleData::btCollisionObjectDoubleData(btCollisionObjectDoubleData const&amp;)" location="f55:461" file="f55" line="461" endline="461" inline="1">
    <Argument type="_8897" location="f55:461" file="f55" line="461"/>
  </Constructor>
  <Constructor id="_2587" name="btCollisionObjectDoubleData" artificial="1" throw="" context="_293" access="public" mangled="_ZN27btCollisionObjectDoubleDataC1Ev *INTERNAL* " demangled="btCollisionObjectDoubleData::btCollisionObjectDoubleData()" location="f55:461" file="f55" line="461" inline="1"/>
  <Field id="_2588" name="m_dispatcherFlags" type="_167" offset="64" context="_296" access="protected" location="f15:48" file="f15" line="48"/>
  <Field id="_2589" name="m_manifoldsPtr" type="_1532" offset="128" context="_296" access="protected" location="f15:50" file="f15" line="50"/>
  <Field id="_2590" name="m_defaultManifoldResult" type="_170" offset="384" context="_296" access="protected" location="f15:52" file="f15" line="52"/>
  <Field id="_2591" name="m_nearCallback" type="_27" offset="768" context="_296" access="protected" location="f15:54" file="f15" line="54"/>
  <Field id="_2592" name="m_collisionAlgorithmPoolAllocator" type="_8871" offset="832" context="_296" access="protected" location="f15:56" file="f15" line="56"/>
  <Field id="_2593" name="m_persistentManifoldPoolAllocator" type="_8871" offset="896" context="_296" access="protected" location="f15:58" file="f15" line="58"/>
  <Field id="_2594" name="m_doubleDispatch" type="_8898" offset="960" context="_296" access="protected" location="f15:60" file="f15" line="60"/>
  <Field id="_2595" name="m_collisionConfiguration" type="_8899" offset="83904" context="_296" access="protected" location="f15:62" file="f15" line="62"/>
  <Enumeration id="_2596" name="DispatcherFlags" context="_296" access="public" location="f15:67" file="f15" line="67" artificial="1" size="32" align="32">
    <EnumValue name="CD_STATIC_STATIC_REPORTED" init="1"/>
    <EnumValue name="CD_USE_RELATIVE_CONTACT_BREAKING_THRESHOLD" init="2"/>
    <EnumValue name="CD_DISABLE_CONTACTPOOL_DYNAMIC_ALLOCATION" init="4"/>
  </Enumeration>
  <OperatorMethod id="_2597" name="=" returns="_8900" artificial="1" context="_296" access="public" mangled="_ZN21btCollisionDispatcheraSERKS_" demangled="btCollisionDispatcher::operator=(btCollisionDispatcher const&amp;)" location="f15:44" file="f15" line="44" endline="44" inline="1">
    <Argument type="_8901" location="f15:44" file="f15" line="44"/>
  </OperatorMethod>
  <Constructor id="_2598" name="btCollisionDispatcher" artificial="1" context="_296" access="public" mangled="_ZN21btCollisionDispatcherC1ERKS_ *INTERNAL* " demangled="btCollisionDispatcher::btCollisionDispatcher(btCollisionDispatcher const&amp;)" location="f15:44" file="f15" line="44" endline="44" inline="1">
    <Argument type="_8901" location="f15:44" file="f15" line="44"/>
  </Constructor>
  <Method id="_2599" name="getDispatcherFlags" returns="_167" const="1" context="_296" access="public" mangled="_ZNK21btCollisionDispatcher18getDispatcherFlagsEv" demangled="btCollisionDispatcher::getDispatcherFlags() const" location="f15:74" file="f15" line="74" endline="76" inline="1"/>
  <Method id="_2600" name="setDispatcherFlags" returns="_631" context="_296" access="public" mangled="_ZN21btCollisionDispatcher18setDispatcherFlagsEi" demangled="btCollisionDispatcher::setDispatcherFlags(int)" location="f15:79" file="f15" line="79" endline="81" inline="1">
    <Argument name="flags" type="_167" location="f15:79" file="f15" line="79"/>
  </Method>
  <Method id="_2601" name="registerCollisionCreateFunc" returns="_631" context="_296" access="public" mangled="_ZN21btCollisionDispatcher27registerCollisionCreateFuncEiiP30btCollisionAlgorithmCreateFunc" demangled="btCollisionDispatcher::registerCollisionCreateFunc(int, int, btCollisionAlgorithmCreateFunc*)" location="f15:85" file="f15" line="85" extern="1">
    <Argument name="proxyType0" type="_167" location="f15:85" file="f15" line="85"/>
    <Argument name="proxyType1" type="_167" location="f15:85" file="f15" line="85"/>
    <Argument name="createFunc" type="_8873" location="f15:85" file="f15" line="85"/>
  </Method>
  <Method id="_2602" name="getNumManifolds" returns="_167" const="1" virtual="1" overrides="_5353 " context="_296" access="public" mangled="_ZNK21btCollisionDispatcher15getNumManifoldsEv" demangled="btCollisionDispatcher::getNumManifolds() const" location="f15:87" file="f15" line="87" endline="89" inline="1"/>
  <Method id="_2603" name="getInternalManifoldPointer" returns="_4327" virtual="1" overrides="_5355 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher26getInternalManifoldPointerEv" demangled="btCollisionDispatcher::getInternalManifoldPointer()" location="f15:92" file="f15" line="92" endline="94" inline="1"/>
  <Method id="_2604" name="getManifoldByIndexInternal" returns="_4331" virtual="1" overrides="_5354 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher26getManifoldByIndexInternalEi" demangled="btCollisionDispatcher::getManifoldByIndexInternal(int)" location="f15:97" file="f15" line="97" endline="99" inline="1">
    <Argument name="index" type="_167" location="f15:97" file="f15" line="97"/>
  </Method>
  <Method id="_2605" name="getManifoldByIndexInternal" returns="_8847" const="1" context="_296" access="public" mangled="_ZNK21btCollisionDispatcher26getManifoldByIndexInternalEi" demangled="btCollisionDispatcher::getManifoldByIndexInternal(int) const" location="f15:102" file="f15" line="102" endline="104" inline="1">
    <Argument name="index" type="_167" location="f15:102" file="f15" line="102"/>
  </Method>
  <Constructor id="_2606" name="btCollisionDispatcher" context="_296" access="public" mangled="_ZN21btCollisionDispatcherC1EP24btCollisionConfiguration *INTERNAL* " demangled="btCollisionDispatcher::btCollisionDispatcher(btCollisionConfiguration*)" location="f15:107" file="f15" line="107" extern="1">
    <Argument name="collisionConfiguration" type="_8899" location="f15:107" file="f15" line="107"/>
  </Constructor>
  <Destructor id="_2607" name="btCollisionDispatcher" virtual="1" overrides="_5345 " context="_296" access="public" mangled="_ZN21btCollisionDispatcherD1Ev *INTERNAL* " demangled="btCollisionDispatcher::~btCollisionDispatcher()" location="f15:109" file="f15" line="109" extern="1">
  </Destructor>
  <Method id="_2608" name="getNewManifold" returns="_4331" virtual="1" overrides="_5347 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher14getNewManifoldEPK17btCollisionObjectS2_" demangled="btCollisionDispatcher::getNewManifold(btCollisionObject const*, btCollisionObject const*)" location="f15:111" file="f15" line="111" extern="1">
    <Argument name="b0" type="_4254" location="f15:111" file="f15" line="111"/>
    <Argument name="b1" type="_4254" location="f15:111" file="f15" line="111"/>
  </Method>
  <Method id="_2609" name="releaseManifold" returns="_631" virtual="1" overrides="_5348 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher15releaseManifoldEP20btPersistentManifold" demangled="btCollisionDispatcher::releaseManifold(btPersistentManifold*)" location="f15:113" file="f15" line="113" extern="1">
    <Argument name="manifold" type="_4331" location="f15:113" file="f15" line="113"/>
  </Method>
  <Method id="_2610" name="clearManifold" returns="_631" virtual="1" overrides="_5349 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher13clearManifoldEP20btPersistentManifold" demangled="btCollisionDispatcher::clearManifold(btPersistentManifold*)" location="f15:116" file="f15" line="116" extern="1">
    <Argument name="manifold" type="_4331" location="f15:116" file="f15" line="116"/>
  </Method>
  <Method id="_2611" name="findAlgorithm" returns="_8892" virtual="1" overrides="_5346 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher13findAlgorithmEPK24btCollisionObjectWrapperS2_P20btPersistentManifold" demangled="btCollisionDispatcher::findAlgorithm(btCollisionObjectWrapper const*, btCollisionObjectWrapper const*, btPersistentManifold*)" location="f15:118" file="f15" line="118" extern="1">
    <Argument name="body0Wrap" type="_8843" location="f15:118" file="f15" line="118"/>
    <Argument name="body1Wrap" type="_8843" location="f15:118" file="f15" line="118"/>
    <Argument name="sharedManifold" type="_4331" location="f15:118" file="f15" line="118" default="0"/>
  </Method>
  <Method id="_2612" name="needsCollision" returns="_1816" virtual="1" overrides="_5350 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher14needsCollisionEPK17btCollisionObjectS2_" demangled="btCollisionDispatcher::needsCollision(btCollisionObject const*, btCollisionObject const*)" location="f15:120" file="f15" line="120" extern="1">
    <Argument name="body0" type="_4254" location="f15:120" file="f15" line="120"/>
    <Argument name="body1" type="_4254" location="f15:120" file="f15" line="120"/>
  </Method>
  <Method id="_2613" name="needsResponse" returns="_1816" virtual="1" overrides="_5351 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher13needsResponseEPK17btCollisionObjectS2_" demangled="btCollisionDispatcher::needsResponse(btCollisionObject const*, btCollisionObject const*)" location="f15:122" file="f15" line="122" extern="1">
    <Argument name="body0" type="_4254" location="f15:122" file="f15" line="122"/>
    <Argument name="body1" type="_4254" location="f15:122" file="f15" line="122"/>
  </Method>
  <Method id="_2614" name="dispatchAllCollisionPairs" returns="_631" virtual="1" overrides="_5352 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher25dispatchAllCollisionPairsEP22btOverlappingPairCacheRK16btDispatcherInfoP12btDispatcher" demangled="btCollisionDispatcher::dispatchAllCollisionPairs(btOverlappingPairCache*, btDispatcherInfo const&amp;, btDispatcher*)" location="f15:124" file="f15" line="124" extern="1">
    <Argument name="pairCache" type="_8767" location="f15:124" file="f15" line="124"/>
    <Argument name="dispatchInfo" type="_8902" location="f15:124" file="f15" line="124"/>
    <Argument name="dispatcher" type="_8755" location="f15:124" file="f15" line="124"/>
  </Method>
  <Method id="_2615" name="setNearCallback" returns="_631" context="_296" access="public" mangled="_ZN21btCollisionDispatcher15setNearCallbackEPFvR16btBroadphasePairRS_RK16btDispatcherInfoE" demangled="btCollisionDispatcher::setNearCallback(void (*)(btBroadphasePair&amp;, btCollisionDispatcher&amp;, btDispatcherInfo const&amp;))" location="f15:126" file="f15" line="126" endline="128" inline="1">
    <Argument name="nearCallback" type="_27" location="f15:126" file="f15" line="126"/>
  </Method>
  <Method id="_2616" name="getNearCallback" returns="_27" const="1" context="_296" access="public" mangled="_ZNK21btCollisionDispatcher15getNearCallbackEv" demangled="btCollisionDispatcher::getNearCallback() const" location="f15:131" file="f15" line="131" endline="133" inline="1"/>
  <Method id="_2617" name="defaultNearCallback" returns="_631" static="1" context="_296" access="public" mangled="_ZN21btCollisionDispatcher19defaultNearCallbackER16btBroadphasePairRS_RK16btDispatcherInfo" demangled="btCollisionDispatcher::defaultNearCallback(btBroadphasePair&amp;, btCollisionDispatcher&amp;, btDispatcherInfo const&amp;)" location="f15:137" file="f15" line="137" extern="1">
    <Argument name="collisionPair" type="_4310" location="f15:137" file="f15" line="137"/>
    <Argument name="dispatcher" type="_8900" location="f15:137" file="f15" line="137"/>
    <Argument name="dispatchInfo" type="_8902" location="f15:137" file="f15" line="137"/>
  </Method>
  <Method id="_2618" name="allocateCollisionAlgorithm" returns="_1068" virtual="1" overrides="_5358 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher26allocateCollisionAlgorithmEi" demangled="btCollisionDispatcher::allocateCollisionAlgorithm(int)" location="f15:139" file="f15" line="139" extern="1">
    <Argument name="size" type="_167" location="f15:139" file="f15" line="139"/>
  </Method>
  <Method id="_2619" name="freeCollisionAlgorithm" returns="_631" virtual="1" overrides="_5359 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher22freeCollisionAlgorithmEPv" demangled="btCollisionDispatcher::freeCollisionAlgorithm(void*)" location="f15:141" file="f15" line="141" extern="1">
    <Argument name="ptr" type="_1068" location="f15:141" file="f15" line="141"/>
  </Method>
  <Method id="_2620" name="getCollisionConfiguration" returns="_8899" context="_296" access="public" mangled="_ZN21btCollisionDispatcher25getCollisionConfigurationEv" demangled="btCollisionDispatcher::getCollisionConfiguration()" location="f15:143" file="f15" line="143" endline="145" inline="1"/>
  <Method id="_2621" name="getCollisionConfiguration" returns="_8903" const="1" context="_296" access="public" mangled="_ZNK21btCollisionDispatcher25getCollisionConfigurationEv" demangled="btCollisionDispatcher::getCollisionConfiguration() const" location="f15:148" file="f15" line="148" endline="150" inline="1"/>
  <Method id="_2622" name="setCollisionConfiguration" returns="_631" context="_296" access="public" mangled="_ZN21btCollisionDispatcher25setCollisionConfigurationEP24btCollisionConfiguration" demangled="btCollisionDispatcher::setCollisionConfiguration(btCollisionConfiguration*)" location="f15:153" file="f15" line="153" endline="155" inline="1">
    <Argument name="config" type="_8899" location="f15:153" file="f15" line="153"/>
  </Method>
  <Method id="_2623" name="getInternalManifoldPool" returns="_8871" virtual="1" overrides="_5356 " context="_296" access="public" mangled="_ZN21btCollisionDispatcher23getInternalManifoldPoolEv" demangled="btCollisionDispatcher::getInternalManifoldPool()" location="f15:158" file="f15" line="158" endline="160" inline="1"/>
  <Method id="_2624" name="getInternalManifoldPool" returns="_8904" const="1" virtual="1" overrides="_5357 " context="_296" access="public" mangled="_ZNK21btCollisionDispatcher23getInternalManifoldPoolEv" demangled="btCollisionDispatcher::getInternalManifoldPool() const" location="f15:163" file="f15" line="163" endline="165" inline="1"/>
  <PointerType id="_2625" type="_354c" size="64" align="64"/>
  <Field id="_2626" name="m_jac" type="_8906" offset="576" context="_305" access="private" location="f76:55" file="f76" line="55"/>
  <Field id="_2627" name="m_jacAng" type="_8906" offset="2592" context="_305" access="private" location="f76:56" file="f76" line="56"/>
  <Field id="_2628" name="m_rbAFrame" type="_481" offset="4608" context="_305" access="private" location="f76:58" file="f76" line="58"/>
  <Field id="_2629" name="m_rbBFrame" type="_481" offset="5120" context="_305" access="private" location="f76:59" file="f76" line="59"/>
  <Field id="_2630" name="m_motorTargetVelocity" type="_360" offset="5632" context="_305" access="private" location="f76:61" file="f76" line="61"/>
  <Field id="_2631" name="m_maxMotorImpulse" type="_360" offset="5664" context="_305" access="private" location="f76:62" file="f76" line="62"/>
  <Field id="_2632" name="m_limit" type="_1692" offset="5696" context="_305" access="private" location="f76:66" file="f76" line="66"/>
  <Field id="_2633" name="m_kHinge" type="_360" offset="5952" context="_305" access="private" location="f76:80" file="f76" line="80"/>
  <Field id="_2634" name="m_accLimitImpulse" type="_360" offset="5984" context="_305" access="private" location="f76:83" file="f76" line="83"/>
  <Field id="_2635" name="m_hingeAngle" type="_360" offset="6016" context="_305" access="private" location="f76:84" file="f76" line="84"/>
  <Field id="_2636" name="m_referenceSign" type="_360" offset="6048" context="_305" access="private" location="f76:85" file="f76" line="85"/>
  <Field id="_2637" name="m_angularOnly" type="_1816" offset="6080" context="_305" access="private" location="f76:87" file="f76" line="87"/>
  <Field id="_2638" name="m_enableAngularMotor" type="_1816" offset="6088" context="_305" access="private" location="f76:88" file="f76" line="88"/>
  <Field id="_2639" name="m_useSolveConstraintObsolete" type="_1816" offset="6096" context="_305" access="private" location="f76:89" file="f76" line="89"/>
  <Field id="_2640" name="m_useOffsetForConstraintFrame" type="_1816" offset="6104" context="_305" access="private" location="f76:90" file="f76" line="90"/>
  <Field id="_2641" name="m_useReferenceFrameA" type="_1816" offset="6112" context="_305" access="private" location="f76:91" file="f76" line="91"/>
  <Field id="_2642" name="m_accMotorImpulse" type="_360" offset="6144" context="_305" access="private" location="f76:93" file="f76" line="93"/>
  <Field id="_2643" name="m_flags" type="_167" offset="6176" context="_305" access="private" location="f76:95" file="f76" line="95"/>
  <Field id="_2644" name="m_normalCFM" type="_360" offset="6208" context="_305" access="private" location="f76:96" file="f76" line="96"/>
  <Field id="_2645" name="m_stopCFM" type="_360" offset="6240" context="_305" access="private" location="f76:97" file="f76" line="97"/>
  <Field id="_2646" name="m_stopERP" type="_360" offset="6272" context="_305" access="private" location="f76:98" file="f76" line="98"/>
  <Constructor id="_2647" name="btHingeConstraint" artificial="1" context="_305" access="public" mangled="_ZN17btHingeConstraintC1ERKS_ *INTERNAL* " demangled="btHingeConstraint::btHingeConstraint(btHingeConstraint const&amp;)" location="f76:51" file="f76" line="51" endline="51" inline="1">
    <Argument type="_8907" location="f76:51" file="f76" line="51"/>
  </Constructor>
  <OperatorMethod id="_2648" name="new" returns="_1068" static="1" context="_305" access="public" mangled="_ZN17btHingeConstraintnwEm" demangled="btHingeConstraint::operator new(unsigned long)" location="f76:103" file="f76" line="103" endline="103" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f76:103" file="f76" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2649" name="delete" returns="_631" static="1" context="_305" access="public" mangled="_ZN17btHingeConstraintdlEPv" demangled="btHingeConstraint::operator delete(void*)" location="f76:103" file="f76" line="103" endline="103" inline="1">
    <Argument name="ptr" type="_1068" location="f76:103" file="f76" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2650" name="new" returns="_1068" static="1" context="_305" access="public" mangled="_ZN17btHingeConstraintnwEmPv" demangled="btHingeConstraint::operator new(unsigned long, void*)" location="f76:103" file="f76" line="103" endline="103" inline="1">
    <Argument type="_1155" location="f76:103" file="f76" line="103"/>
    <Argument name="ptr" type="_1068" location="f76:103" file="f76" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2651" name="delete" returns="_631" static="1" context="_305" access="public" mangled="_ZN17btHingeConstraintdlEPvS0_" demangled="btHingeConstraint::operator delete(void*, void*)" location="f76:103" file="f76" line="103" inline="1">
    <Argument type="_1068" location="f76:103" file="f76" line="103"/>
    <Argument type="_1068" location="f76:103" file="f76" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2652" name="new []" returns="_1068" static="1" context="_305" access="public" mangled="_ZN17btHingeConstraintnaEm" demangled="btHingeConstraint::operator new[](unsigned long)" location="f76:103" file="f76" line="103" endline="103" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f76:103" file="f76" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2653" name="delete []" returns="_631" static="1" context="_305" access="public" mangled="_ZN17btHingeConstraintdaEPv" demangled="btHingeConstraint::operator delete[](void*)" location="f76:103" file="f76" line="103" endline="103" inline="1">
    <Argument name="ptr" type="_1068" location="f76:103" file="f76" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2654" name="new []" returns="_1068" static="1" context="_305" access="public" mangled="_ZN17btHingeConstraintnaEmPv" demangled="btHingeConstraint::operator new[](unsigned long, void*)" location="f76:103" file="f76" line="103" endline="103" inline="1">
    <Argument type="_1155" location="f76:103" file="f76" line="103"/>
    <Argument name="ptr" type="_1068" location="f76:103" file="f76" line="103"/>
  </OperatorMethod>
  <OperatorMethod id="_2655" name="delete []" returns="_631" static="1" context="_305" access="public" mangled="_ZN17btHingeConstraintdaEPvS0_" demangled="btHingeConstraint::operator delete[](void*, void*)" location="f76:103" file="f76" line="103" inline="1">
    <Argument type="_1068" location="f76:103" file="f76" line="103"/>
    <Argument type="_1068" location="f76:103" file="f76" line="103"/>
  </OperatorMethod>
  <Constructor id="_2656" name="btHingeConstraint" explicit="1" context="_305" access="public" mangled="_ZN17btHingeConstraintC1ER11btRigidBodyS1_RK9btVector3S4_S4_S4_b *INTERNAL* " demangled="btHingeConstraint::btHingeConstraint(btRigidBody&amp;, btRigidBody&amp;, btVector3 const&amp;, btVector3 const&amp;, btVector3 const&amp;, btVector3 const&amp;, bool)" location="f76:105" file="f76" line="105" extern="1">
    <Argument name="rbA" type="_8718" location="f76:105" file="f76" line="105"/>
    <Argument name="rbB" type="_8718" location="f76:105" file="f76" line="105"/>
    <Argument name="pivotInA" type="_1806" location="f76:105" file="f76" line="105"/>
    <Argument name="pivotInB" type="_1806" location="f76:105" file="f76" line="105"/>
    <Argument name="axisInA" type="_1806" location="f76:105" file="f76" line="105"/>
    <Argument name="axisInB" type="_1806" location="f76:105" file="f76" line="105"/>
    <Argument name="useReferenceFrameA" type="_1816" location="f76:105" file="f76" line="105" default="false"/>
  </Constructor>
  <Constructor id="_2657" name="btHingeConstraint" explicit="1" context="_305" access="public" mangled="_ZN17btHingeConstraintC1ER11btRigidBodyRK9btVector3S4_b *INTERNAL* " demangled="btHingeConstraint::btHingeConstraint(btRigidBody&amp;, btVector3 const&amp;, btVector3 const&amp;, bool)" location="f76:107" file="f76" line="107" extern="1">
    <Argument name="rbA" type="_8718" location="f76:107" file="f76" line="107"/>
    <Argument name="pivotInA" type="_1806" location="f76:107" file="f76" line="107"/>
    <Argument name="axisInA" type="_1806" location="f76:107" file="f76" line="107"/>
    <Argument name="useReferenceFrameA" type="_1816" location="f76:107" file="f76" line="107" default="false"/>
  </Constructor>
  <Constructor id="_2658" name="btHingeConstraint" explicit="1" context="_305" access="public" mangled="_ZN17btHingeConstraintC1ER11btRigidBodyS1_RK11btTransformS4_b *INTERNAL* " demangled="btHingeConstraint::btHingeConstraint(btRigidBody&amp;, btRigidBody&amp;, btTransform const&amp;, btTransform const&amp;, bool)" location="f76:109" file="f76" line="109" extern="1">
    <Argument name="rbA" type="_8718" location="f76:109" file="f76" line="109"/>
    <Argument name="rbB" type="_8718" location="f76:109" file="f76" line="109"/>
    <Argument name="rbAFrame" type="_6832" location="f76:109" file="f76" line="109"/>
    <Argument name="rbBFrame" type="_6832" location="f76:109" file="f76" line="109"/>
    <Argument name="useReferenceFrameA" type="_1816" location="f76:109" file="f76" line="109" default="false"/>
  </Constructor>
  <Constructor id="_2659" name="btHingeConstraint" explicit="1" context="_305" access="public" mangled="_ZN17btHingeConstraintC1ER11btRigidBodyRK11btTransformb *INTERNAL* " demangled="btHingeConstraint::btHingeConstraint(btRigidBody&amp;, btTransform const&amp;, bool)" location="f76:111" file="f76" line="111" extern="1">
    <Argument name="rbA" type="_8718" location="f76:111" file="f76" line="111"/>
    <Argument name="rbAFrame" type="_6832" location="f76:111" file="f76" line="111"/>
    <Argument name="useReferenceFrameA" type="_1816" location="f76:111" file="f76" line="111" default="false"/>
  </Constructor>
  <Method id="_2660" name="buildJacobian" returns="_631" virtual="1" overrides="_1873 " context="_305" access="public" mangled="_ZN17btHingeConstraint13buildJacobianEv" demangled="btHingeConstraint::buildJacobian()" location="f76:114" file="f76" line="114" extern="1"/>
  <Method id="_2661" name="getInfo1" returns="_631" virtual="1" overrides="_1875 " context="_305" access="public" mangled="_ZN17btHingeConstraint8getInfo1EPN17btTypedConstraint17btConstraintInfo1E" demangled="btHingeConstraint::getInfo1(btTypedConstraint::btConstraintInfo1*)" location="f76:116" file="f76" line="116" extern="1">
    <Argument name="info" type="_3623" location="f76:116" file="f76" line="116"/>
  </Method>
  <Method id="_2662" name="getInfo1NonVirtual" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint18getInfo1NonVirtualEPN17btTypedConstraint17btConstraintInfo1E" demangled="btHingeConstraint::getInfo1NonVirtual(btTypedConstraint::btConstraintInfo1*)" location="f76:118" file="f76" line="118" extern="1">
    <Argument name="info" type="_3623" location="f76:118" file="f76" line="118"/>
  </Method>
  <Method id="_2663" name="getInfo2" returns="_631" virtual="1" overrides="_1876 " context="_305" access="public" mangled="_ZN17btHingeConstraint8getInfo2EPN17btTypedConstraint17btConstraintInfo2E" demangled="btHingeConstraint::getInfo2(btTypedConstraint::btConstraintInfo2*)" location="f76:120" file="f76" line="120" extern="1">
    <Argument name="info" type="_8749" location="f76:120" file="f76" line="120"/>
  </Method>
  <Method id="_2664" name="getInfo2NonVirtual" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint18getInfo2NonVirtualEPN17btTypedConstraint17btConstraintInfo2ERK11btTransformS5_RK9btVector3S8_" demangled="btHingeConstraint::getInfo2NonVirtual(btTypedConstraint::btConstraintInfo2*, btTransform const&amp;, btTransform const&amp;, btVector3 const&amp;, btVector3 const&amp;)" location="f76:122" file="f76" line="122" extern="1">
    <Argument name="info" type="_8749" location="f76:122" file="f76" line="122"/>
    <Argument name="transA" type="_6832" location="f76:122" file="f76" line="122"/>
    <Argument name="transB" type="_6832" location="f76:122" file="f76" line="122"/>
    <Argument name="angVelA" type="_1806" location="f76:122" file="f76" line="122"/>
    <Argument name="angVelB" type="_1806" location="f76:122" file="f76" line="122"/>
  </Method>
  <Method id="_2665" name="getInfo2Internal" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint16getInfo2InternalEPN17btTypedConstraint17btConstraintInfo2ERK11btTransformS5_RK9btVector3S8_" demangled="btHingeConstraint::getInfo2Internal(btTypedConstraint::btConstraintInfo2*, btTransform const&amp;, btTransform const&amp;, btVector3 const&amp;, btVector3 const&amp;)" location="f76:124" file="f76" line="124" extern="1">
    <Argument name="info" type="_8749" location="f76:124" file="f76" line="124"/>
    <Argument name="transA" type="_6832" location="f76:124" file="f76" line="124"/>
    <Argument name="transB" type="_6832" location="f76:124" file="f76" line="124"/>
    <Argument name="angVelA" type="_1806" location="f76:124" file="f76" line="124"/>
    <Argument name="angVelB" type="_1806" location="f76:124" file="f76" line="124"/>
  </Method>
  <Method id="_2666" name="getInfo2InternalUsingFrameOffset" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint32getInfo2InternalUsingFrameOffsetEPN17btTypedConstraint17btConstraintInfo2ERK11btTransformS5_RK9btVector3S8_" demangled="btHingeConstraint::getInfo2InternalUsingFrameOffset(btTypedConstraint::btConstraintInfo2*, btTransform const&amp;, btTransform const&amp;, btVector3 const&amp;, btVector3 const&amp;)" location="f76:125" file="f76" line="125" extern="1">
    <Argument name="info" type="_8749" location="f76:125" file="f76" line="125"/>
    <Argument name="transA" type="_6832" location="f76:125" file="f76" line="125"/>
    <Argument name="transB" type="_6832" location="f76:125" file="f76" line="125"/>
    <Argument name="angVelA" type="_1806" location="f76:125" file="f76" line="125"/>
    <Argument name="angVelB" type="_1806" location="f76:125" file="f76" line="125"/>
  </Method>
  <Method id="_2667" name="updateRHS" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint9updateRHSEf" demangled="btHingeConstraint::updateRHS(float)" location="f76:128" file="f76" line="128" extern="1">
    <Argument name="timeStep" type="_360" location="f76:128" file="f76" line="128"/>
  </Method>
  <Method id="_2668" name="getRigidBodyA" returns="_8750" const="1" context="_305" access="public" mangled="_ZNK17btHingeConstraint13getRigidBodyAEv" demangled="btHingeConstraint::getRigidBodyA() const" location="f76:130" file="f76" line="130" endline="132" inline="1"/>
  <Method id="_2669" name="getRigidBodyB" returns="_8750" const="1" context="_305" access="public" mangled="_ZNK17btHingeConstraint13getRigidBodyBEv" demangled="btHingeConstraint::getRigidBodyB() const" location="f76:134" file="f76" line="134" endline="136" inline="1"/>
  <Method id="_2670" name="getRigidBodyA" returns="_8718" context="_305" access="public" mangled="_ZN17btHingeConstraint13getRigidBodyAEv" demangled="btHingeConstraint::getRigidBodyA()" location="f76:139" file="f76" line="139" endline="141" inline="1"/>
  <Method id="_2671" name="getRigidBodyB" returns="_8718" context="_305" access="public" mangled="_ZN17btHingeConstraint13getRigidBodyBEv" demangled="btHingeConstraint::getRigidBodyB()" location="f76:144" file="f76" line="144" endline="146" inline="1"/>
  <Method id="_2672" name="getFrameOffsetA" returns="_8820" context="_305" access="public" mangled="_ZN17btHingeConstraint15getFrameOffsetAEv" demangled="btHingeConstraint::getFrameOffsetA()" location="f76:149" file="f76" line="149" endline="151" inline="1"/>
  <Method id="_2673" name="getFrameOffsetB" returns="_8820" context="_305" access="public" mangled="_ZN17btHingeConstraint15getFrameOffsetBEv" demangled="btHingeConstraint::getFrameOffsetB()" location="f76:154" file="f76" line="154" endline="156" inline="1"/>
  <Method id="_2674" name="setFrames" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint9setFramesERK11btTransformS2_" demangled="btHingeConstraint::setFrames(btTransform const&amp;, btTransform const&amp;)" location="f76:159" file="f76" line="159" extern="1">
    <Argument name="frameA" type="_6832" location="f76:159" file="f76" line="159"/>
    <Argument name="frameB" type="_6832" location="f76:159" file="f76" line="159"/>
  </Method>
  <Method id="_2675" name="setAngularOnly" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint14setAngularOnlyEb" demangled="btHingeConstraint::setAngularOnly(bool)" location="f76:161" file="f76" line="161" endline="163" inline="1">
    <Argument name="angularOnly" type="_1816" location="f76:161" file="f76" line="161"/>
  </Method>
  <Method id="_2676" name="enableAngularMotor" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint18enableAngularMotorEbff" demangled="btHingeConstraint::enableAngularMotor(bool, float, float)" location="f76:166" file="f76" line="166" endline="170" inline="1">
    <Argument name="enableMotor" type="_1816" location="f76:166" file="f76" line="166"/>
    <Argument name="targetVelocity" type="_360" location="f76:166" file="f76" line="166"/>
    <Argument name="maxMotorImpulse" type="_360" location="f76:166" file="f76" line="166"/>
  </Method>
  <Method id="_2677" name="enableMotor" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint11enableMotorEb" demangled="btHingeConstraint::enableMotor(bool)" location="f76:176" file="f76" line="176" endline="176" inline="1">
    <Argument name="enableMotor" type="_1816" location="f76:176" file="f76" line="176"/>
  </Method>
  <Method id="_2678" name="setMaxMotorImpulse" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint18setMaxMotorImpulseEf" demangled="btHingeConstraint::setMaxMotorImpulse(float)" location="f76:177" file="f76" line="177" endline="177" inline="1">
    <Argument name="maxMotorImpulse" type="_360" location="f76:177" file="f76" line="177"/>
  </Method>
  <Method id="_2679" name="setMotorTarget" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint14setMotorTargetERK12btQuaternionf" demangled="btHingeConstraint::setMotorTarget(btQuaternion const&amp;, float)" location="f76:178" file="f76" line="178" extern="1">
    <Argument name="qAinB" type="_3254" location="f76:178" file="f76" line="178"/>
    <Argument name="dt" type="_360" location="f76:178" file="f76" line="178"/>
  </Method>
  <Method id="_2680" name="setMotorTarget" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint14setMotorTargetEff" demangled="btHingeConstraint::setMotorTarget(float, float)" location="f76:179" file="f76" line="179" extern="1">
    <Argument name="targetAngle" type="_360" location="f76:179" file="f76" line="179"/>
    <Argument name="dt" type="_360" location="f76:179" file="f76" line="179"/>
  </Method>
  <Method id="_2681" name="setLimit" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint8setLimitEfffff" demangled="btHingeConstraint::setLimit(float, float, float, float, float)" location="f76:182" file="f76" line="182" endline="185" inline="1">
    <Argument name="low" type="_360" location="f76:182" file="f76" line="182"/>
    <Argument name="high" type="_360" location="f76:182" file="f76" line="182"/>
    <Argument name="_softness" type="_360" location="f76:182" file="f76" line="182" default="8.9999997615814208984375e-1f"/>
    <Argument name="_biasFactor" type="_360" location="f76:182" file="f76" line="182" default="3.00000011920928955078125e-1f"/>
    <Argument name="_relaxationFactor" type="_360" location="f76:182" file="f76" line="182" default="1.0e+0f"/>
  </Method>
  <Method id="_2682" name="setAxis" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint7setAxisER9btVector3" demangled="btHingeConstraint::setAxis(btVector3&amp;)" location="f76:195" file="f76" line="195" endline="216" inline="1">
    <Argument name="axisInA" type="_2481" location="f76:195" file="f76" line="195"/>
  </Method>
  <Method id="_2683" name="getLowerLimit" returns="_360" const="1" context="_305" access="public" mangled="_ZNK17btHingeConstraint13getLowerLimitEv" demangled="btHingeConstraint::getLowerLimit() const" location="f76:220" file="f76" line="220" endline="223" inline="1"/>
  <Method id="_2684" name="getUpperLimit" returns="_360" const="1" context="_305" access="public" mangled="_ZNK17btHingeConstraint13getUpperLimitEv" demangled="btHingeConstraint::getUpperLimit() const" location="f76:229" file="f76" line="229" endline="232" inline="1"/>
  <Method id="_2685" name="getHingeAngle" returns="_360" context="_305" access="public" mangled="_ZN17btHingeConstraint13getHingeAngleEv" demangled="btHingeConstraint::getHingeAngle()" location="f76:239" file="f76" line="239" extern="1"/>
  <Method id="_2686" name="getHingeAngle" returns="_360" context="_305" access="public" mangled="_ZN17btHingeConstraint13getHingeAngleERK11btTransformS2_" demangled="btHingeConstraint::getHingeAngle(btTransform const&amp;, btTransform const&amp;)" location="f76:241" file="f76" line="241" extern="1">
    <Argument name="transA" type="_6832" location="f76:241" file="f76" line="241"/>
    <Argument name="transB" type="_6832" location="f76:241" file="f76" line="241"/>
  </Method>
  <Method id="_2687" name="testLimit" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint9testLimitERK11btTransformS2_" demangled="btHingeConstraint::testLimit(btTransform const&amp;, btTransform const&amp;)" location="f76:243" file="f76" line="243" extern="1">
    <Argument name="transA" type="_6832" location="f76:243" file="f76" line="243"/>
    <Argument name="transB" type="_6832" location="f76:243" file="f76" line="243"/>
  </Method>
  <Method id="_2688" name="getAFrame" returns="_6832" const="1" context="_305" access="public" mangled="_ZNK17btHingeConstraint9getAFrameEv" demangled="btHingeConstraint::getAFrame() const" location="f76:246" file="f76" line="246" endline="246" inline="1"/>
  <Method id="_2689" name="getBFrame" returns="_6832" const="1" context="_305" access="public" mangled="_ZNK17btHingeConstraint9getBFrameEv" demangled="btHingeConstraint::getBFrame() const" location="f76:247" file="f76" line="247" endline="247" inline="1"/>
  <Method id="_2690" name="getAFrame" returns="_8820" context="_305" access="public" mangled="_ZN17btHingeConstraint9getAFrameEv" demangled="btHingeConstraint::getAFrame()" location="f76:249" file="f76" line="249" endline="249" inline="1"/>
  <Method id="_2691" name="getBFrame" returns="_8820" context="_305" access="public" mangled="_ZN17btHingeConstraint9getBFrameEv" demangled="btHingeConstraint::getBFrame()" location="f76:250" file="f76" line="250" endline="250" inline="1"/>
  <Method id="_2692" name="getSolveLimit" returns="_167" context="_305" access="public" mangled="_ZN17btHingeConstraint13getSolveLimitEv" demangled="btHingeConstraint::getSolveLimit()" location="f76:252" file="f76" line="252" endline="255" inline="1"/>
  <Method id="_2693" name="getLimitSign" returns="_360" context="_305" access="public" mangled="_ZN17btHingeConstraint12getLimitSignEv" demangled="btHingeConstraint::getLimitSign()" location="f76:261" file="f76" line="261" endline="264" inline="1"/>
  <Method id="_2694" name="getAngularOnly" returns="_1816" context="_305" access="public" mangled="_ZN17btHingeConstraint14getAngularOnlyEv" demangled="btHingeConstraint::getAngularOnly()" location="f76:270" file="f76" line="270" endline="272" inline="1"/>
  <Method id="_2695" name="getEnableAngularMotor" returns="_1816" context="_305" access="public" mangled="_ZN17btHingeConstraint21getEnableAngularMotorEv" demangled="btHingeConstraint::getEnableAngularMotor()" location="f76:274" file="f76" line="274" endline="276" inline="1"/>
  <Method id="_2696" name="getMotorTargetVelosity" returns="_360" context="_305" access="public" mangled="_ZN17btHingeConstraint22getMotorTargetVelosityEv" demangled="btHingeConstraint::getMotorTargetVelosity()" location="f76:278" file="f76" line="278" endline="280" inline="1"/>
  <Method id="_2697" name="getMaxMotorImpulse" returns="_360" context="_305" access="public" mangled="_ZN17btHingeConstraint18getMaxMotorImpulseEv" demangled="btHingeConstraint::getMaxMotorImpulse()" location="f76:282" file="f76" line="282" endline="284" inline="1"/>
  <Method id="_2698" name="getUseFrameOffset" returns="_1816" context="_305" access="public" mangled="_ZN17btHingeConstraint17getUseFrameOffsetEv" demangled="btHingeConstraint::getUseFrameOffset()" location="f76:287" file="f76" line="287" endline="287" inline="1"/>
  <Method id="_2699" name="setUseFrameOffset" returns="_631" context="_305" access="public" mangled="_ZN17btHingeConstraint17setUseFrameOffsetEb" demangled="btHingeConstraint::setUseFrameOffset(bool)" location="f76:288" file="f76" line="288" endline="288" inline="1">
    <Argument name="frameOffsetOnOff" type="_1816" location="f76:288" file="f76" line="288"/>
  </Method>
  <Method id="_2700" name="setParam" returns="_631" virtual="1" overrides="_1904 " context="_305" access="public" mangled="_ZN17btHingeConstraint8setParamEifi" demangled="btHingeConstraint::setParam(int, float, int)" location="f76:293" file="f76" line="293" extern="1">
    <Argument name="num" type="_167" location="f76:293" file="f76" line="293"/>
    <Argument name="value" type="_360" location="f76:293" file="f76" line="293"/>
    <Argument name="axis" type="_167" location="f76:293" file="f76" line="293" default="-0x00000000000000001"/>
  </Method>
  <Method id="_2701" name="getParam" returns="_360" const="1" virtual="1" overrides="_1905 " context="_305" access="public" mangled="_ZNK17btHingeConstraint8getParamEii" demangled="btHingeConstraint::getParam(int, int) const" location="f76:295" file="f76" line="295" extern="1">
    <Argument name="num" type="_167" location="f76:295" file="f76" line="295"/>
    <Argument name="axis" type="_167" location="f76:295" file="f76" line="295" default="-0x00000000000000001"/>
  </Method>
  <Method id="_2702" name="calculateSerializeBufferSize" returns="_167" const="1" virtual="1" overrides="_1906 " context="_305" access="public" mangled="_ZNK17btHingeConstraint28calculateSerializeBufferSizeEv" demangled="btHingeConstraint::calculateSerializeBufferSize() const" location="f76:347" file="f76" line="347" endline="349" inline="1"/>
  <Method id="_2703" name="serialize" returns="_1805" const="1" virtual="1" overrides="_1907 " context="_305" access="public" mangled="_ZNK17btHingeConstraint9serializeEPvP12btSerializer" demangled="btHingeConstraint::serialize(void*, btSerializer*) const" location="f76:353" file="f76" line="353" endline="380" inline="1">
    <Argument name="dataBuffer" type="_1068" location="f76:353" file="f76" line="353"/>
    <Argument name="serializer" type="_8713" location="f76:353" file="f76" line="353"/>
  </Method>
  <Destructor id="_2704" name="btHingeConstraint" virtual="1" overrides="_1867 " artificial="1" context="_305" access="public" mangled="_ZN17btHingeConstraintD1Ev *INTERNAL* " demangled="btHingeConstraint::~btHingeConstraint()" location="f76:51" file="f76" line="51" endline="51" inline="1">
  </Destructor>
  <Field id="_2705" name="m_typeConstraintData" type="_401" offset="0" context="_311" access="public" location="f48:139" file="f48" line="139"/>
  <Field id="_2706" name="m_pivotInA" type="_1342" offset="512" context="_311" access="public" location="f48:140" file="f48" line="140"/>
  <Field id="_2707" name="m_pivotInB" type="_1342" offset="768" context="_311" access="public" location="f48:141" file="f48" line="141"/>
  <Destructor id="_2708" name="btPoint2PointConstraintDoubleData" artificial="1" throw="" context="_311" access="public" mangled="_ZN33btPoint2PointConstraintDoubleDataD1Ev *INTERNAL* " demangled="btPoint2PointConstraintDoubleData::~btPoint2PointConstraintDoubleData()" location="f48:138" file="f48" line="138" endline="138" inline="1">
  </Destructor>
  <OperatorMethod id="_2709" name="=" returns="_8908" artificial="1" throw="" context="_311" access="public" mangled="_ZN33btPoint2PointConstraintDoubleDataaSERKS_" demangled="btPoint2PointConstraintDoubleData::operator=(btPoint2PointConstraintDoubleData const&amp;)" location="f48:138" file="f48" line="138" endline="138" inline="1">
    <Argument type="_8909" location="f48:138" file="f48" line="138"/>
  </OperatorMethod>
  <Constructor id="_2710" name="btPoint2PointConstraintDoubleData" artificial="1" throw="" context="_311" access="public" mangled="_ZN33btPoint2PointConstraintDoubleDataC1ERKS_ *INTERNAL* " demangled="btPoint2PointConstraintDoubleData::btPoint2PointConstraintDoubleData(btPoint2PointConstraintDoubleData const&amp;)" location="f48:138" file="f48" line="138" endline="138" inline="1">
    <Argument type="_8909" location="f48:138" file="f48" line="138"/>
  </Constructor>
  <Constructor id="_2711" name="btPoint2PointConstraintDoubleData" artificial="1" throw="" context="_311" access="public" mangled="_ZN33btPoint2PointConstraintDoubleDataC1Ev *INTERNAL* " demangled="btPoint2PointConstraintDoubleData::btPoint2PointConstraintDoubleData()" location="f48:138" file="f48" line="138" inline="1"/>
  <PointerType id="_2712" type="_354" size="64" align="64"/>
  <FundamentalType id="_2713" name="long long unsigned int" size="64" align="64"/>
  <Field id="_2714" name="m_useSolveConstraintObsolete" type="_1816" offset="576" context="_328" access="protected" location="f50:67" file="f50" line="67"/>
  <Field id="_2715" name="m_useOffsetForConstraintFrame" type="_1816" offset="584" context="_328" access="protected" location="f50:68" file="f50" line="68"/>
  <Field id="_2716" name="m_frameInA" type="_481" offset="608" context="_328" access="protected" location="f50:69" file="f50" line="69"/>
  <Field id="_2717" name="m_frameInB" type="_481" offset="1120" context="_328" access="protected" location="f50:70" file="f50" line="70"/>
  <Field id="_2718" name="m_useLinearReferenceFrameA" type="_1816" offset="1632" context="_328" access="protected" location="f50:72" file="f50" line="72"/>
  <Field id="_2719" name="m_lowerLinLimit" type="_360" offset="1664" context="_328" access="protected" location="f50:74" file="f50" line="74"/>
  <Field id="_2720" name="m_upperLinLimit" type="_360" offset="1696" context="_328" access="protected" location="f50:75" file="f50" line="75"/>
  <Field id="_2721" name="m_lowerAngLimit" type="_360" offset="1728" context="_328" access="protected" location="f50:77" file="f50" line="77"/>
  <Field id="_2722" name="m_upperAngLimit" type="_360" offset="1760" context="_328" access="protected" location="f50:78" file="f50" line="78"/>
  <Field id="_2723" name="m_softnessDirLin" type="_360" offset="1792" context="_328" access="protected" location="f50:85" file="f50" line="85"/>
  <Field id="_2724" name="m_restitutionDirLin" type="_360" offset="1824" context="_328" access="protected" location="f50:86" file="f50" line="86"/>
  <Field id="_2725" name="m_dampingDirLin" type="_360" offset="1856" context="_328" access="protected" location="f50:87" file="f50" line="87"/>
  <Field id="_2726" name="m_cfmDirLin" type="_360" offset="1888" context="_328" access="protected" location="f50:88" file="f50" line="88"/>
  <Field id="_2727" name="m_softnessDirAng" type="_360" offset="1920" context="_328" access="protected" location="f50:90" file="f50" line="90"/>
  <Field id="_2728" name="m_restitutionDirAng" type="_360" offset="1952" context="_328" access="protected" location="f50:91" file="f50" line="91"/>
  <Field id="_2729" name="m_dampingDirAng" type="_360" offset="1984" context="_328" access="protected" location="f50:92" file="f50" line="92"/>
  <Field id="_2730" name="m_cfmDirAng" type="_360" offset="2016" context="_328" access="protected" location="f50:93" file="f50" line="93"/>
  <Field id="_2731" name="m_softnessLimLin" type="_360" offset="2048" context="_328" access="protected" location="f50:95" file="f50" line="95"/>
  <Field id="_2732" name="m_restitutionLimLin" type="_360" offset="2080" context="_328" access="protected" location="f50:96" file="f50" line="96"/>
  <Field id="_2733" name="m_dampingLimLin" type="_360" offset="2112" context="_328" access="protected" location="f50:97" file="f50" line="97"/>
  <Field id="_2734" name="m_cfmLimLin" type="_360" offset="2144" context="_328" access="protected" location="f50:98" file="f50" line="98"/>
  <Field id="_2735" name="m_softnessLimAng" type="_360" offset="2176" context="_328" access="protected" location="f50:100" file="f50" line="100"/>
  <Field id="_2736" name="m_restitutionLimAng" type="_360" offset="2208" context="_328" access="protected" location="f50:101" file="f50" line="101"/>
  <Field id="_2737" name="m_dampingLimAng" type="_360" offset="2240" context="_328" access="protected" location="f50:102" file="f50" line="102"/>
  <Field id="_2738" name="m_cfmLimAng" type="_360" offset="2272" context="_328" access="protected" location="f50:103" file="f50" line="103"/>
  <Field id="_2739" name="m_softnessOrthoLin" type="_360" offset="2304" context="_328" access="protected" location="f50:105" file="f50" line="105"/>
  <Field id="_2740" name="m_restitutionOrthoLin" type="_360" offset="2336" context="_328" access="protected" location="f50:106" file="f50" line="106"/>
  <Field id="_2741" name="m_dampingOrthoLin" type="_360" offset="2368" context="_328" access="protected" location="f50:107" file="f50" line="107"/>
  <Field id="_2742" name="m_cfmOrthoLin" type="_360" offset="2400" context="_328" access="protected" location="f50:108" file="f50" line="108"/>
  <Field id="_2743" name="m_softnessOrthoAng" type="_360" offset="2432" context="_328" access="protected" location="f50:110" file="f50" line="110"/>
  <Field id="_2744" name="m_restitutionOrthoAng" type="_360" offset="2464" context="_328" access="protected" location="f50:111" file="f50" line="111"/>
  <Field id="_2745" name="m_dampingOrthoAng" type="_360" offset="2496" context="_328" access="protected" location="f50:112" file="f50" line="112"/>
  <Field id="_2746" name="m_cfmOrthoAng" type="_360" offset="2528" context="_328" access="protected" location="f50:113" file="f50" line="113"/>
  <Field id="_2747" name="m_solveLinLim" type="_1816" offset="2560" context="_328" access="protected" location="f50:116" file="f50" line="116"/>
  <Field id="_2748" name="m_solveAngLim" type="_1816" offset="2568" context="_328" access="protected" location="f50:117" file="f50" line="117"/>
  <Field id="_2749" name="m_flags" type="_167" offset="2592" context="_328" access="protected" location="f50:119" file="f50" line="119"/>
  <Field id="_2750" name="m_jacLin" type="_8906" offset="2624" context="_328" access="protected" location="f50:121" file="f50" line="121"/>
  <Field id="_2751" name="m_jacLinDiagABInv" type="_8910" offset="4640" context="_328" access="protected" location="f50:122" file="f50" line="122"/>
  <Field id="_2752" name="m_jacAng" type="_8906" offset="4736" context="_328" access="protected" location="f50:124" file="f50" line="124"/>
  <Field id="_2753" name="m_timeStep" type="_360" offset="6752" context="_328" access="protected" location="f50:126" file="f50" line="126"/>
  <Field id="_2754" name="m_calculatedTransformA" type="_481" offset="6784" context="_328" access="protected" location="f50:127" file="f50" line="127"/>
  <Field id="_2755" name="m_calculatedTransformB" type="_481" offset="7296" context="_328" access="protected" location="f50:128" file="f50" line="128"/>
  <Field id="_2756" name="m_sliderAxis" type="_192" offset="7808" context="_328" access="protected" location="f50:130" file="f50" line="130"/>
  <Field id="_2757" name="m_realPivotAInW" type="_192" offset="7936" context="_328" access="protected" location="f50:131" file="f50" line="131"/>
  <Field id="_2758" name="m_realPivotBInW" type="_192" offset="8064" context="_328" access="protected" location="f50:132" file="f50" line="132"/>
  <Field id="_2759" name="m_projPivotInW" type="_192" offset="8192" context="_328" access="protected" location="f50:133" file="f50" line="133"/>
  <Field id="_2760" name="m_delta" type="_192" offset="8320" context="_328" access="protected" location="f50:134" file="f50" line="134"/>
  <Field id="_2761" name="m_depth" type="_192" offset="8448" context="_328" access="protected" location="f50:135" file="f50" line="135"/>
  <Field id="_2762" name="m_relPosA" type="_192" offset="8576" context="_328" access="protected" location="f50:136" file="f50" line="136"/>
  <Field id="_2763" name="m_relPosB" type="_192" offset="8704" context="_328" access="protected" location="f50:137" file="f50" line="137"/>
  <Field id="_2764" name="m_linPos" type="_360" offset="8832" context="_328" access="protected" location="f50:139" file="f50" line="139"/>
  <Field id="_2765" name="m_angPos" type="_360" offset="8864" context="_328" access="protected" location="f50:140" file="f50" line="140"/>
  <Field id="_2766" name="m_angDepth" type="_360" offset="8896" context="_328" access="protected" location="f50:142" file="f50" line="142"/>
  <Field id="_2767" name="m_kAngle" type="_360" offset="8928" context="_328" access="protected" location="f50:143" file="f50" line="143"/>
  <Field id="_2768" name="m_poweredLinMotor" type="_1816" offset="8960" context="_328" access="protected" location="f50:145" file="f50" line="145"/>
  <Field id="_2769" name="m_targetLinMotorVelocity" type="_360" offset="8992" context="_328" access="protected" location="f50:146" file="f50" line="146"/>
  <Field id="_2770" name="m_maxLinMotorForce" type="_360" offset="9024" context="_328" access="protected" location="f50:147" file="f50" line="147"/>
  <Field id="_2771" name="m_accumulatedLinMotorImpulse" type="_360" offset="9056" context="_328" access="protected" location="f50:148" file="f50" line="148"/>
  <Field id="_2772" name="m_poweredAngMotor" type="_1816" offset="9088" context="_328" access="protected" location="f50:150" file="f50" line="150"/>
  <Field id="_2773" name="m_targetAngMotorVelocity" type="_360" offset="9120" context="_328" access="protected" location="f50:151" file="f50" line="151"/>
  <Field id="_2774" name="m_maxAngMotorForce" type="_360" offset="9152" context="_328" access="protected" location="f50:152" file="f50" line="152"/>
  <Field id="_2775" name="m_accumulatedAngMotorImpulse" type="_360" offset="9184" context="_328" access="protected" location="f50:153" file="f50" line="153"/>
  <Constructor id="_2776" name="btSliderConstraint" artificial="1" context="_328" access="public" mangled="_ZN18btSliderConstraintC1ERKS_ *INTERNAL* " demangled="btSliderConstraint::btSliderConstraint(btSliderConstraint const&amp;)" location="f50:64" file="f50" line="64" endline="64" inline="1">
    <Argument type="_8911" location="f50:64" file="f50" line="64"/>
  </Constructor>
  <Method id="_2777" name="initParams" returns="_631" context="_328" access="protected" mangled="_ZN18btSliderConstraint10initParamsEv" demangled="btSliderConstraint::initParams()" location="f50:156" file="f50" line="156" extern="1"/>
  <OperatorMethod id="_2778" name="new" returns="_1068" static="1" context="_328" access="public" mangled="_ZN18btSliderConstraintnwEm" demangled="btSliderConstraint::operator new(unsigned long)" location="f50:158" file="f50" line="158" endline="158" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f50:158" file="f50" line="158"/>
  </OperatorMethod>
  <OperatorMethod id="_2779" name="delete" returns="_631" static="1" context="_328" access="public" mangled="_ZN18btSliderConstraintdlEPv" demangled="btSliderConstraint::operator delete(void*)" location="f50:158" file="f50" line="158" endline="158" inline="1">
    <Argument name="ptr" type="_1068" location="f50:158" file="f50" line="158"/>
  </OperatorMethod>
  <OperatorMethod id="_2780" name="new" returns="_1068" static="1" context="_328" access="public" mangled="_ZN18btSliderConstraintnwEmPv" demangled="btSliderConstraint::operator new(unsigned long, void*)" location="f50:158" file="f50" line="158" endline="158" inline="1">
    <Argument type="_1155" location="f50:158" file="f50" line="158"/>
    <Argument name="ptr" type="_1068" location="f50:158" file="f50" line="158"/>
  </OperatorMethod>
  <OperatorMethod id="_2781" name="delete" returns="_631" static="1" context="_328" access="public" mangled="_ZN18btSliderConstraintdlEPvS0_" demangled="btSliderConstraint::operator delete(void*, void*)" location="f50:158" file="f50" line="158" inline="1">
    <Argument type="_1068" location="f50:158" file="f50" line="158"/>
    <Argument type="_1068" location="f50:158" file="f50" line="158"/>
  </OperatorMethod>
  <OperatorMethod id="_2782" name="new []" returns="_1068" static="1" context="_328" access="public" mangled="_ZN18btSliderConstraintnaEm" demangled="btSliderConstraint::operator new[](unsigned long)" location="f50:158" file="f50" line="158" endline="158" inline="1">
    <Argument name="sizeInBytes" type="_1155" location="f50:158" file="f50" line="158"/>
  </OperatorMethod>
  <OperatorMethod id="_2783" name="delete []" returns="_631" static="1" context="_328" access="public" mangled="_ZN18btSliderConstraintdaEPv" demangled="btSliderConstraint::operator delete[](void*)" location="f50:158" file="f50" line="158" endline="158" inline="1">
    <Argument name="ptr" type="_1068" location="f50:158" file="f50" line="158"/>
  </OperatorMethod>
  <OperatorMethod id="_2784" name="new []" returns="_1068" static="1" context="_328" access="public" mangled="_ZN18btSliderConstraintnaEmPv" demangled="btSliderConstraint::operator new[](unsigned long, void*)" location="f50:158" file="f50" line="158" endline="158" inline="1">
    <Argument type="_1155" location="f50:158" file="f50" line="158"/>
    <Argument name="ptr" type="_1068" location="f50:158" file="f50" line="158"/>
  </OperatorMethod>
  <OperatorMethod id="_2785" name="delete []" returns="_631" static="1" context="_328" access="public" mangled="_ZN18btSliderConstraintdaEPvS0_" demangled="btSliderConstraint::operator delete[](void*, void*)" location="f50:158" file="f50" line="158" inline="1">
    <Argument type="_1068" location="f50:158" file="f50" line="158"/>
    <Argument type="_1068" location="f50:158" file="f50" line="158"/>
  </OperatorMethod>
  <Constructor id="_2786" name="btSliderConstraint" explicit="1" context="_328" access="public" mangled="_ZN18btSliderConstraintC1ER11btRigidBodyS1_RK11btTransformS4_b *INTERNAL* " demangled="btSliderConstraint::btSliderConstraint(btRigidBody&amp;, btRigidBody&amp;, btTransform const&amp;, btTransform const&amp;, bool)" location="f50:161" file="f50" line="161" extern="1">
    <Argument name="rbA" type="_8718" location="f50:161" file="f50" line="161"/>
    <Argument name="rbB" type="_8718" location="f50:161" file="f50" line="161"/>
    <Argument name="frameInA" type="_6832" location="f50:161" file="f50" line="161"/>
    <Argument name="frameInB" type="_6832" location="f50:161" file="f50" line="161"/>
    <Argument name="useLinearReferenceFrameA" type="_1816" location="f50:161" file="f50" line="161"/>
  </Constructor>
  <Constructor id="_2787" name="btSliderConstraint" explicit="1" context="_328" access="public" mangled="_ZN18btSliderConstraintC1ER11btRigidBodyRK11btTransformb *INTERNAL* " demangled="btSliderConstraint::btSliderConstraint(btRigidBody&amp;, btTransform const&amp;, bool)" location="f50:162" file="f50" line="162" extern="1">
    <Argument name="rbB" type="_8718" location="f50:162" file="f50" line="162"/>
    <Argument name="frameInB" type="_6832" location="f50:162" file="f50" line="162"/>
    <Argument name="useLinearReferenceFrameA" type="_1816" location="f50:162" file="f50" line="162"/>
  </Constructor>
  <Method id="_2788" name="getInfo1" returns="_631" virtual="1" overrides="_1875 " context="_328" access="public" mangled="_ZN18btSliderConstraint8getInfo1EPN17btTypedConstraint17btConstraintInfo1E" demangled="btSliderConstraint::getInfo1(btTypedConstraint::btConstraintInfo1*)" location="f50:166" file="f50" line="166" extern="1">
    <Argument name="info" type="_3623" location="f50:166" file="f50" line="166"/>
  </Method>
  <Method id="_2789" name="getInfo1NonVirtual" returns="_631" context="_328" access="public" mangled="_ZN18btSliderConstraint18getInfo1NonVirtualEPN17btTypedConstraint17btConstraintInfo1E" demangled="btSliderConstraint::getInfo1NonVirtual(btTypedConstraint::btConstraintInfo1*)" location="f50:168" file="f50" line="168" extern="1">
    <Argument name="info" type="_3623" location="f50:168" file="f50" line="168"/>
  </Method>
  <Method id="_2790" name="getInfo2" returns="_631" virtual="1" overrides="_1876 " context="_328" access="public" mangled="_ZN18btSliderConstraint8getInfo2EPN17btTypedConstraint17btConstraintInfo2E" demangled="btSliderConstraint::getInfo2(btTypedConstraint::btConstraintInfo2*)" location="f50:170" file="f50" line="170" extern="1">
    <Argument name="info" type="_8749" location="f50:170" file="f50" line="170"/>
  </Method>
  <Method id="_2791" name="getInfo2NonVirtual" returns="_631" context="_328" access="public" mangled="_ZN18btSliderConstraint18getInfo2NonVirtualEPN17btTypedConstraint17btConstraintInfo2ERK11btTransformS5_RK9btVector3S8_ff" demangled="btSliderConstraint::getInfo2NonVirtual(btTypedConstraint::btConstraintInfo2*, btTransform const&amp;, btTransform const&amp;, btVector3 const&amp;, btVector3 const&amp;, float, float)" location="f50:172" file="f50" line="172" extern="1">
    <Argument name="info" type="_8749" location="f50:172" file="f50" line="172"/>
    <Argument name="transA" type="_6832" location="f50:172" file="f50" line="172"/>
    <Argument name="transB" type="_6832" location="f50:172" file="f50" line="172"/>
    <Argument name="linVelA" type="_1806" location="f50:172" file="f50" line="172"/>
    <Argument name="linVelB" type="_1806" location="f50:172" file="f50" line="172"/>
    <Argument name="rbAinvMass" type="_360" location="f50:172" file="f50" line="172"/>
    <Argument name="rbBinvMass" type="_360" location="f50:172" file="f50" line="172"/>
  </Method>
  <Method id="_2792" name="getRigidBodyA" returns="_8750" const="1" context="_328" access="public" mangled="_ZNK18btSliderConstraint13getRigidBodyAEv" demangled="btSliderConstraint::getRigidBodyA() const" location="f50:176" file="f50" line="176" endline="176" inline="1"/>
  <Method id="_2793" name="getRigidBodyB" returns="_8750" const="1" context="_328" access="public" mangled="_ZNK18btSliderConstraint13getRigidBodyBEv" demangled="btSliderConstraint::getRigidBodyB() const" location="f50:177" file="f50" line="177" endline="177" inline="1"/>
  <Method id="_2794" name="getCalculatedTransformA" returns="_6832" const="1" context="_328" access="public" mangled="_ZNK18btSliderConstraint23getCalculatedTransformAEv" demangled="btSliderConstraint::getCalculatedTransformA() const" location="f50:178" file="f50" line="178" endline="178" inline="1"/>
  <Method id="_2795" name="getCalculatedTransformB" returns="_6832" const="1" context="_328" access="public" mangled="_ZNK18btSliderConstraint23getCalculatedTransformBEv" demangled="btSliderConstraint::getCalculatedTransformB() const" location="f50:179" file="f50" line="179" endline="179" inline="1"/>
  <Method id="_2796" name="getFrameOffsetA" returns="_6832" const="1" context="_328" access="public" mangled="_ZNK18btSliderConstraint15getFrameOffsetAEv" demangled="btSliderConstraint::getFrameOffsetA() const" location="f50:180" file="f50" line="180" endline="180" inline="1"/>
